{
  "video_id": "5sCGZAcXKWg",
  "channel": "The Diary Of A CEO",
  "channel_slug": "the-diary-of-a-ceo",
  "title": "Kevin Hart: They're Lying To You About How To Become A Millionaire! I Was Doing 28 Sets A Weekend!",
  "date": "2025-11-20",
  "upload_date": "20251120",
  "duration": 5793,
  "url": "https://www.youtube.com/watch?v=5sCGZAcXKWg",
  "chapters": [
    {
      "title": "Intro",
      "start_time": 0.0,
      "end_time": 167.0
    },
    {
      "title": "What Made You Who You Are Today?",
      "start_time": 167.0,
      "end_time": 209.0
    },
    {
      "title": "There's No Success Without Failure",
      "start_time": 209.0,
      "end_time": 244.0
    },
    {
      "title": "What Were You Like as a Kid?",
      "start_time": 244.0,
      "end_time": 405.0
    },
    {
      "title": "I Didn’t Grow Up with My Dad at Home",
      "start_time": 405.0,
      "end_time": 597.0
    },
    {
      "title": "The Biggest Lesson I Learned from My Mother",
      "start_time": 597.0,
      "end_time": 909.0
    },
    {
      "title": "I Thought My Future Was in a Shoe Store",
      "start_time": 909.0,
      "end_time": 994.0
    },
    {
      "title": "The Proposition That Changed My Life",
      "start_time": 994.0,
      "end_time": 1360.0
    },
    {
      "title": "13 Years of Struggle & Failures to Reach the Top",
      "start_time": 1360.0,
      "end_time": 1624.0
    },
    {
      "title": "How I Got Into Business & Business Development",
      "start_time": 1624.0,
      "end_time": 1771.0
    },
    {
      "title": "The Importance of Not Quitting",
      "start_time": 1771.0,
      "end_time": 1914.0
    },
    {
      "title": "Advice to Young People",
      "start_time": 1914.0,
      "end_time": 2301.0
    },
    {
      "title": "The One Moment I Knew Things Would Change Forever",
      "start_time": 2301.0,
      "end_time": 2431.0
    },
    {
      "title": "It Took 13 Years to Make It",
      "start_time": 2431.0,
      "end_time": 2725.0
    },
    {
      "title": "The Deep Expertise That Allows You to Succeed",
      "start_time": 2725.0,
      "end_time": 2857.0
    },
    {
      "title": "Be Comfortable with Coming Across as Stupid",
      "start_time": 2857.0,
      "end_time": 3198.0
    },
    {
      "title": "Seeing Behind the Curtains",
      "start_time": 3198.0,
      "end_time": 3552.0
    },
    {
      "title": "How Much About Business Is About People?",
      "start_time": 3552.0,
      "end_time": 3754.0
    },
    {
      "title": "The Importance of Communication in Business",
      "start_time": 3754.0,
      "end_time": 3890.0
    },
    {
      "title": "How Do You Know Who to Trust in Business?",
      "start_time": 3890.0,
      "end_time": 4224.0
    },
    {
      "title": "What's the Cost of Success?",
      "start_time": 4224.0,
      "end_time": 4685.0
    },
    {
      "title": "Kevin Hart Show: Acting My Age",
      "start_time": 4685.0,
      "end_time": 4769.0
    },
    {
      "title": "The Men's Crisis",
      "start_time": 4769.0,
      "end_time": 4854.0
    },
    {
      "title": "What Does It Take to Be a Good Man?",
      "start_time": 4854.0,
      "end_time": 5179.0
    },
    {
      "title": "What’s the Best Advice You Got as an Adult?",
      "start_time": 5179.0,
      "end_time": 5276.0
    },
    {
      "title": "One More Thing About What's Happening with Men",
      "start_time": 5276.0,
      "end_time": 5419.0
    },
    {
      "title": "Is There a Cost for Your Family?",
      "start_time": 5419.0,
      "end_time": 5793
    }
  ],
  "transcript": "[00:00] You can't be afraid to verbalize your\n[00:03] ignorance. That's holding you back.\n[00:05] >> Give me an example.\n[00:06] >> I can give you several like investing.\n[00:08] Like you're telling me that if I put\n[00:10] this money in here right now, I get 30x\n[00:13] 20x. What the a scam? I know a scam.\n[00:16] When I see one, go find you another\n[00:18] idiot cuz it ain't happening over here,\n[00:20] buddy. But when you go, you say, \"I\n[00:23] don't know what that means. How does\n[00:24] investing really work? I don't know\n[00:26] where to get it.\" Now you're a part of\n[00:28] the right conversations. You're part of\n[00:29] the right opportunities, but you get\n[00:31] there by being the dummy in them. And\n[00:34] now look at what I'm able to do.\n[00:36] >> Kevin,\n[00:38] I love it. I love it.\n[00:39] >> Kevin, it took 13 years from where you\n[00:41] did your first stand up to you having\n[00:43] your moment. But why didn't you quit?\n[00:44] >> Because of the lessons that my mom gave\n[00:46] from being [music] very scarred from my\n[00:48] brother. So, let's go back. I grew up in\n[00:51] North Philadelphia. My brother sold the\n[00:52] drugs. My dad was always in jail, out of\n[00:55] jail. My mom wasn't going to let that\n[00:56] happen with me. So, we had an agreement.\n[00:58] I had a certain amount of time to make\n[00:59] comedy work. [music] And in my mind, it\n[01:01] wasn't going to be hard because there\n[01:03] was no other option. I would figure it\n[01:04] out. So, I was driving from Philadelphia\n[01:06] to New York every day. I wasn't coming\n[01:08] home until 4:00 a.m. where I was doing\n[01:10] 25 to 28 sets a weekend.\n[01:14] I worked at for a very, very long time.\n[01:16] And the struggle left you with days of\n[01:18] what am I doing? Can I [music] pay my\n[01:20] rent? This man, but my mom's biggest\n[01:23] lesson was you're not quitting. And not\n[01:25] many people are going to do the 13 years\n[01:27] of hard. Most people opt out at year two\n[01:29] and want to go find a quick return.\n[01:31] Well, you keep quitting to start\n[01:32] something else that you think is the\n[01:33] idea. It's just a cycle. You're never\n[01:35] completing anything. You got to make a\n[01:36] choice of the thing you're going to do\n[01:37] and finish. I made the choice that\n[01:39] standup comedy was what I was going to\n[01:41] finish. Because if I focused and did it\n[01:43] well, that would open up the doors for\n[01:45] me to do everything else [music] that I\n[01:47] want to do.\n[01:48] >> But they say that you can't have\n[01:49] everything in life.\n[01:50] >> So, what is the cost? Have you struggled\n[01:52] with your mental health? What advice\n[01:53] have you got for young men in terms of\n[01:55] like what it takes to be a good man?\n[01:57] >> It's a weird thing that's happening\n[01:58] where the definition of a good man is so\n[02:01] foggy. It seems that in this time today\n[02:03] more men are being forward [music]\n[02:06] wanting to express and talk but the fear\n[02:08] of being judged [music] after.\n[02:11] >> Do you have that fear?\n[02:18] I see messages all the time in the\n[02:20] comments section that some of you didn't\n[02:21] realize you didn't subscribe. So, if you\n[02:23] could do me a favor and double check if\n[02:25] you're a subscriber to this channel,\n[02:26] that would be tremendously appreciated.\n[02:27] It's the simple, it's the free thing\n[02:29] that anybody that watches this show\n[02:31] frequently can do to help us here to\n[02:32] keep everything going in this show in\n[02:34] the trajectory it's on. So, please do\n[02:36] double check if you've subscribed and uh\n[02:38] thank you so much because in a strange\n[02:39] way, you are you're part of our history\n[02:42] and you're on this journey with us and I\n[02:43] appreciate you for that. So yeah, thank\n[02:45] you. [music]\n[02:49] In so many ways, you're clearly an\n[02:52] anomaly. For you to be the way that you\n[02:54] are, there must be some kind of early\n[02:56] context that people need to be aware of,\n[02:57] a certain wiring or a cauldron that has\n[03:00] has sort of shaped you into who you are.\n[03:01] What is that context that I need to\n[03:03] understand?\n[03:05] >> I am a very driven individual and I'm\n[03:08] driven off of ideiation. I I like the\n[03:12] fact that you can have thoughts and if\n[03:17] you're in love with the thoughts that\n[03:18] you're having, you can be energized to\n[03:21] bring those thoughts like into a bigger\n[03:24] reality. That's like that's the real\n[03:28] fuel to the brain for me.\n[03:30] >> Do you think at the at the very core of\n[03:32] you that's what's motivating you because\n[03:35] >> absolutely\n[03:36] >> that's like a process but the the\n[03:38] outcome of that is success in all its\n[03:40] forms. It's material success\n[03:41] >> or failure. I mean like there is no\n[03:43] success without failure. They go hand in\n[03:45] hand. And with the failure comes amazing\n[03:48] lessons, adjustments\n[03:51] and you get sharper because of the [ __ ]\n[03:53] that you've done wrong or that you\n[03:55] didn't know to approach a certain way\n[03:57] that you now know how to approach. So I\n[04:00] embrace the concept of failure just as\n[04:02] much as I embrace the win of success.\n[04:06] Had I met you at 10 years old or 15\n[04:08] years old,\n[04:10] how similar would you have looked in?\n[04:12] >> Not even close.\n[04:13] >> Not even close. Not motivated to do the\n[04:16] things that I didn't want to do. Uh not\n[04:19] a good student, kind of [ __ ] off\n[04:22] school, the opportunities that come with\n[04:23] school, the extracurricular activities\n[04:25] that I didn't want to do that I was\n[04:26] doing that my mom made me do. Hanging\n[04:28] out was the thing. Hanging out was the\n[04:31] luxury. It was the fun. And it's it\n[04:34] wasn't available. My mom was strict. So,\n[04:37] I didn't have the luxury of doing all\n[04:39] those things, which is why I wanted them\n[04:41] more.\n[04:42] >> I found this photo of your mother.\n[04:43] >> Yeah. Me and Nancy Hart.\n[04:45] >> She was strict.\n[04:46] >> Very strict with me. Uh my older\n[04:49] brother, he had the, you know, he had he\n[04:52] had a little more lenency. He he freed\n[04:54] him, you know, he curfew late at night.\n[04:58] But my brother did all the all of the\n[04:59] other stuff. My brother sold the drugs,\n[05:03] you know,\n[05:05] did the, you know, the smaller tears of\n[05:07] crime and and stupid [ __ ] as a teenager\n[05:11] to her own mom felt like she wasn't\n[05:12] going to let that happen with me. So,\n[05:14] she was much more protective\n[05:16] um because of the mistakes she saw that\n[05:18] she made with my brother.\n[05:20] >> You see what I'm saying? So, I got the I\n[05:22] got the short end of the stick.\n[05:24] >> So, I didn't have the curfew. I didn't I\n[05:27] wasn't able to go hang out. I wasn't\n[05:29] able to do all those things. That's why\n[05:30] I wanted that so much. So I rebelled in\n[05:33] the spaces where you have to do this and\n[05:37] I was like, \"Well, you don't let me do\n[05:39] this, so I don't\n[05:40] >> I don't want to do this.\" So I kind of\n[05:42] [ __ ] off a lot of those opportunities.\n[05:44] And your father,\n[05:45] >> Henry Witherspoon, Spoon G's, my guy.\n[05:50] Uh, you know, a [ __ ] up in the eyes of\n[05:53] most, but\n[05:55] my my dad, you know, he didn't\n[05:58] necessarily do the right things in life.\n[06:00] Um,\n[06:02] gang, crime, all of the [ __ ] Jail, in\n[06:06] jail, out of jail, drugs. Uh\n[06:10] I mean that that environment that we\n[06:13] were raised in is not like you know the\n[06:16] the best environment for for anyone but\n[06:20] it's a it's an amazing environment for\n[06:22] those that live in it because it's all\n[06:23] we know and the normaly is the low. My\n[06:27] mom strive for the higher side of it. My\n[06:29] mom was education uh degree, trying to\n[06:33] get another degree, trying to get a\n[06:34] master's, trying to My mom was like\n[06:36] always wanting to get better, always\n[06:38] wanting to educate herself more because\n[06:41] she felt that it was the biggest\n[06:43] strength that nobody could control but\n[06:46] her.\n[06:46] >> And they separated.\n[06:48] >> Yeah. They were never never married.\n[06:49] >> Never married.\n[06:50] >> Never married.\n[06:50] >> And did they physically separate at a\n[06:53] certain point? I mean, I think my dad my\n[06:55] dad only lived in the house with me like\n[06:58] my really younger years. Like maybe from\n[07:02] like\n[07:05] five to seven,\n[07:07] maybe eight if I can remember. Like I\n[07:10] didn't have I didn't grow up with like\n[07:12] my dad home, you know? So when my mom\n[07:15] was like, \"Fuck that. You're out of\n[07:17] here.\" It was over. like he my dad he\n[07:20] was a weekend dad or every other weekend\n[07:23] dad or you know during the week stopped\n[07:26] by then he was in and out of jail then\n[07:28] we got on drugs we didn't see him at\n[07:30] all.\n[07:30] >> How did you understand that as a kid?\n[07:32] Like how does a kid understand the the\n[07:34] dad coming and going being in jail\n[07:35] drugs?\n[07:36] >> You are\n[07:39] a product of your environment and in\n[07:42] that environment that's the norm. So\n[07:44] when you so when you say like how did\n[07:46] you understand that? Well, nobody had a\n[07:48] dad.\n[07:49] >> Yeah.\n[07:49] >> Right. Like all all my friends, our\n[07:52] dads, like we see him when we see him\n[07:54] and we love him because that's what we\n[07:57] that's what we thought that it should\n[07:59] be. It's not like I'm going over a\n[08:02] volume of homes where I'm seeing the\n[08:05] father sit with the family and the mom\n[08:08] and they're doing dinner and they're\n[08:10] having [snorts] conversations and\n[08:12] they're, you know, it's this happy\n[08:15] household. I I I only had a couple of\n[08:18] examples like that. I remember when I\n[08:21] went over one of my friends houses um\n[08:23] from the swim team and I remember he had\n[08:25] his own room.\n[08:27] It was like crazy.\n[08:29] You get to close the door and [ __ ] like\n[08:31] this is your space. Yeah. This is my\n[08:33] room. I had a hallway. We ain't have no\n[08:35] goddamn room. We had a hallway. My bed's\n[08:38] in the hallway. Every You could always\n[08:39] see me. This is where [laughter]\n[08:42] this is where I am. Me and my brother\n[08:44] right here in the hall on these bunk\n[08:46] beds. My friend had grass. He had a\n[08:49] backyard. This is [ __ ] crazy. Yeah,\n[08:52] we don't have none of this where we\n[08:53] live. So, because that is the norm, I\n[08:57] never it never affected me, right? Like\n[09:00] I never\n[09:02] I was never taken back by the obstacles\n[09:06] of our household. My mom and dad just\n[09:10] didn't get along and it didn't work. All\n[09:11] right. It is what it is.\n[09:13] >> Did you have male role models at the\n[09:14] time?\n[09:15] >> I don't think that I was in the space of\n[09:18] no\n[09:19] when it comes to role model like at this\n[09:21] time like I I I didn't have the mindset\n[09:25] of what a role model is or should be. I\n[09:28] just had good people around me who acted\n[09:32] as like parenting aids to my mother to\n[09:35] help her because of her schedule. But I\n[09:37] never remember at that age looking at\n[09:39] other families like, \"Oh, this is what I\n[09:42] this is what I want and this is what I'm\n[09:44] striving\n[09:45] to get or gain.\" You know, like I it was\n[09:49] it was shoulder shrug. A lot of shoulder\n[09:51] shrugs. It wasn't until I got older that\n[09:53] I think the lessons not I think I know\n[09:55] the lessons that my mom was kind of\n[09:56] laying down started to click in\n[09:58] differently. I mean, one of those\n[10:00] lessons that your mother was trying to\n[10:01] lay down can be seen\n[10:04] >> in a Bible thousand%.\n[10:06] >> With this, there's a\n[10:08] >> Mhm.\n[10:09] >> Best story ever. Best story um that I'm\n[10:12] able to tell.\n[10:13] >> She put something in the Bible that's\n[10:15] hanging out there as you can see.\n[10:16] >> Checks, man. I couldn't pay my rent. I\n[10:19] cannot pay my rent. I needed help. And\n[10:23] she was like, \"Well, I'm not helping you\n[10:25] until you start reading the Bible.\" And\n[10:27] I was like, \"Mom, I'm reading the\n[10:28] Bible.\" I was lying. Just lying. I'm\n[10:31] reading it. Come on, Mom. This is real.\n[10:33] Mom, they're going to kick me out. Are\n[10:35] you reading your Bible? Yes.\n[10:38] When you read your Bible, then talk to\n[10:40] me. And she did this for like a while.\n[10:45] And one day I was like, you know what,\n[10:46] man? I was I was by myself and I was\n[10:48] like, what am I going to do? I said, let\n[10:51] me get this Bible.\n[10:54] I read the Bible. And I opened up the\n[10:56] Bible\n[10:58] and like my checks,\n[11:00] rent, like multiple months of rent\n[11:02] checks had fell out. And I was like, you\n[11:05] know what?\n[11:07] It's pretty amazing. [clears throat]\n[11:09] Pretty amazing. And then I had to\n[11:11] actually open a Bible and and start\n[11:15] reading the Bible. But that was her way\n[11:18] of of course knowing that I'm lying\n[11:21] first of all and b giving me like one of\n[11:24] the best lessons ever. You know\n[11:26] somewhere along the lines the gyms that\n[11:29] she dropped started to click\n[11:33] and\n[11:35] the idea of not starting things that I'm\n[11:39] not going to finish.\n[11:41] That's what really resonated with me the\n[11:43] most. So, like I started a lot of stuff\n[11:47] that I didn't complete in the younger\n[11:49] years. That was me and my mom's battle.\n[11:52] No, you're gonna finish it. And she\n[11:53] would make me finish it. No, I want to\n[11:56] quit. No, you're going to finish it. So,\n[11:58] I ended up doing a lot of things with an\n[11:59] attitude, which is why I have to ask it.\n[12:02] >> Then, as I got older, you realize, well,\n[12:05] why are you putting time into something\n[12:07] in the beginning that you don't want to\n[12:09] see through? Why? or just because you\n[12:12] have like a rough moment or a rough\n[12:13] patch, why is it so easy for you to\n[12:16] quit? Why why is the idea of quit so\n[12:20] quick to you to come up with and why are\n[12:22] you so comfortable with the results of\n[12:25] that?\n[12:27] I shouldn't be\n[12:29] and that shouldn't be my like motto.\n[12:32] So, we don't stop. If we start\n[12:34] something, we see it the entire way\n[12:36] through. And at the end of it, even if\n[12:39] you don't like it to the highest level,\n[12:42] you know that you put your time, energy\n[12:44] into something that you're at least\n[12:45] proud.\n[12:47] Proud that you did, proud that you were\n[12:50] able to put a period on that sentence\n[12:53] and now you can start the next thing.\n[12:55] But it's not until you complete\n[12:57] something that you can honestly sit with\n[13:00] yourself and go,\n[13:03] that's that's that's\n[13:05] what life is.\n[13:07] That's called seeing things through the\n[13:09] entire way.\n[13:10] >> What was it that changed in you? Like\n[13:12] what happened that made you suddenly\n[13:13] start to take opportunities more\n[13:15] seriously?\n[13:16] >> When you saw the opportunity, you [ __ ]\n[13:17] off. I remember the the the\n[13:22] my big dummy moment and I've had a lot\n[13:24] so I don't know how much time we have to\n[13:25] go down but I got a lot of dummy moments\n[13:29] but my biggest dummy moment\n[13:33] we hookie school to go and have our\n[13:36] senior day. We go to Great Adventure\n[13:38] theme park on the east coast and there\n[13:40] was a moment where we're done\n[13:46] and we're talking. like eating and\n[13:47] hanging out and all my friends were\n[13:49] talking about the college that they were\n[13:51] going to go to and they had already been\n[13:54] accepted. They had already had letters\n[13:57] and [ __ ]\n[14:01] When did y'all do this?\n[14:05] When did everybody apply? When did\n[14:07] everybody\n[14:08] When did you guys take the SAT? I just I\n[14:12] took mine, but I rushed it because I\n[14:13] wanted to get here. I wanted a hookie.\n[14:15] Wait.\n[14:16] How do you guys know where you going\n[14:18] already? I had no knowledge, no idea.\n[14:24] All my friends have went on to the next\n[14:25] stage.\n[14:27] They let me be the dummy by myself. And\n[14:29] that's when it dawned on me that like\n[14:34] nobody cares about you more than you\n[14:37] should care about yourself.\n[14:39] And nobody\n[14:43] is giving you the road map to like the\n[14:47] winds. You have to go find that\n[14:48] information. You got to go discover it.\n[14:51] You got to you got to want to get it.\n[14:53] You got to want to do it. And with the\n[14:56] right help, the right world of\n[14:57] knowledge, it can better help position\n[14:59] you. But ultimately, you have to want to\n[15:02] you got to want to do it. and me and\n[15:04] just not wanting to do [ __ ] kind of put\n[15:07] me in a really [ __ ] up position early\n[15:09] on.\n[15:11] >> Was it finding the thing, your thing\n[15:14] that put some wind in your sales and\n[15:16] made you more of a apparently sort of\n[15:18] motivated individual? Cuz at some point\n[15:20] you go from being that Kevin to the\n[15:22] Kevin that can't stop working.\n[15:24] >> Yeah. Well, you Well, that was my light\n[15:25] bulb moment.\n[15:26] >> Okay.\n[15:26] >> My light bulb moment was look at what\n[15:29] not applying myself got me. I feel like\n[15:31] the dummy that doesn't know what he\n[15:33] wants to do with his life. And now I'm\n[15:35] at community college. I'm working as a\n[15:37] lifeguard. I eventually went to go work\n[15:39] for City Sports, which is a sneaker\n[15:41] store. And I remember when I started\n[15:43] working at the sneaker store. Talked\n[15:46] about this for years, too. I was like,\n[15:47] \"Oh man, this is this is cool. This is\n[15:50] what I want to do. I got the thing that\n[15:52] I want to do.\" I was so excited that I\n[15:55] went and got a job, found a job. I'll do\n[15:57] this forever and I'm going to make it to\n[15:59] the highest level so I can have a\n[16:01] career. So I become the manager and\n[16:03] after being the manager I work for\n[16:04] corporate and this is something that I\n[16:06] can build like I was already inspiring\n[16:08] because I was like I I got to\n[16:10] [clears throat] figure out what I'm\n[16:10] doing with the rest of my life. What is\n[16:12] my life now? I'm panicking. What?\n[16:16] And I was flourishing\n[16:18] in the space of sneaker sales,\n[16:22] right? Education and college degree I\n[16:25] don't have. But in the space of\n[16:26] personality and sale,\n[16:29] I was able to maneuver. This is it. This\n[16:33] is my calling.\n[16:36] That's where\n[16:39] the real beacon of light presented\n[16:40] itself\n[16:42] through ideas of my friends. You should\n[16:45] do standup because you're funny.\n[16:48] You should try standup.\n[16:49] >> Do you remember where you were when they\n[16:50] said that?\n[16:51] >> In my workplace. I'm working every Hey,\n[16:53] I'm on the floor\n[16:54] >> and someone a colleague of yours that\n[16:56] works\n[16:57] >> Alice colleague of mine that I work\n[16:59] with.\n[16:59] >> What did your brain think when she said\n[17:01] that? Was it was it just blowing on a\n[17:03] fire that was kind of already there or\n[17:04] was it lighting the fire?\n[17:06] >> No, I think it the the fire was lit.\n[17:08] Like I I never thought about pursuing\n[17:11] standup comedy prior to like the idea\n[17:15] came up. I was always funny, but I\n[17:16] wasn't like man I got to figure out how\n[17:18] to become a comedian. That was never a\n[17:20] thought. I knew that I was very funny. I\n[17:23] knew that I was entertaining. I knew\n[17:25] that I can make people laugh. I love\n[17:26] being the center of attention. I love\n[17:28] the idea of a stage and a light, but\n[17:33] that wasn't the thing. I wasn't like, I\n[17:36] got it and this is what it's going to\n[17:38] do. It was presented and then I went and\n[17:40] did the amate and that's when I fell in\n[17:42] love.\n[17:43] >> Why did you like the stage and the light\n[17:46] and and why did you like performing\n[17:48] >> the laugh?\n[17:49] >> Why? There's nothing better than to\n[17:52] laugh.\n[17:54] There's nothing better than\n[17:59] being on stage having the bright light.\n[18:02] And\n[18:06] the only energy of good that you're able\n[18:10] to take away from what you're doing is\n[18:12] the laugh. Ha.\n[18:17] Hearing people laugh, I was like, \"Oh\n[18:19] [ __ ]\n[18:21] that feels different.\"\n[18:23] >> Why?\n[18:24] >> This This is\n[18:26] This is energizing. This is like\n[18:29] >> How does it make you feel about you?\n[18:31] >> I feel like I'm doing a service of good.\n[18:35] If I can make people feel better, if I\n[18:37] can brighten up your day,\n[18:40] it's a service of good.\n[18:43] That means I'm like a shepherd of some\n[18:47] sort. I'm\n[18:49] I am responsible for making people feel\n[18:52] better. Oh my god. That means\n[18:54] in success I can bring people to one\n[18:57] destination\n[18:59] and everybody can share a moment and a\n[19:02] laugh and all relate that it came from\n[19:05] me. Oh my god, this can get global. This\n[19:08] can get bigger. Well, this is starting\n[19:10] to change now.\n[19:12] Oh wow. Wait, this has opened up doors\n[19:15] for me to do this or that or this or\n[19:18] that. It all started with the laugh. It\n[19:21] all started with the stage.\n[19:23] >> So, you went to that comedy show. Um,\n[19:25] I've got a I was looking at some of\n[19:27] those early clips of you performing.\n[19:30] It's funny cuz I think this is the early\n[19:31] 2000s.\n[19:32] >> Okay.\n[19:33] >> But, I mean, you probably\n[19:35] >> Oh my god. Caroline.\n[19:37] Caroline. This right here. My best set\n[19:41] in the beginning of my career.\n[19:43] Everything I say here tonight is a joke,\n[19:45] okay? It is nothing else. I don't want\n[19:48] nobody take none of this stuff too\n[19:49] serious.\n[19:49] >> I don't want nobody coming up to me\n[19:51] after the show saying, \"Who's the funny\n[19:53] one now?\" Yeah. Yeah. This this that\n[19:57] tape. So that was when you know\n[20:02] the thing I needed was a tape. Mhm.\n[20:05] >> And [clears throat] the reason why I\n[20:05] needed the tape was so that I could send\n[20:07] it to the other comedy club so that they\n[20:10] could have an example of me, my talent,\n[20:12] and then dictator judge if I can get a\n[20:14] live audition in person.\n[20:16] >> And how old are you at that point?\n[20:17] >> Oh my god. Right there. I'm like\n[20:20] 18, 19.\n[20:21] >> That's crazy.\n[20:22] >> 18, 19 years old.\n[20:23] >> Cuz you're so That clip is so funny. I\n[20:25] watched it this morning and like I was\n[20:27] dying.\n[20:30] If you could understand the feeling of\n[20:32] getting off that stage, having a good\n[20:35] set and then them putting the tape in my\n[20:38] hand, it was gold.\n[20:40] I got it. I got a good tape.\n[20:43] I got to go make copies of my tape and I\n[20:46] just got to send them to everybody. I\n[20:48] just used to\n[20:51] because it was it was it was valuable.\n[20:54] It was value. Started getting in comedy\n[20:56] clubs, started getting auditions,\n[20:57] started getting more\n[20:59] Oh my god. Kevin's up for an audition.\n[21:01] Uh movie audition, cast of directors,\n[21:03] they all got that tape. Everybody got\n[21:06] that tape.\n[21:07] >> From that period onwards, from 18 to\n[21:09] let's say to your early 20s, you were at\n[21:11] this point a very motivated individual.\n[21:13] You're working hard.\n[21:15] >> You're focused\n[21:15] >> very.\n[21:16] >> And what was your when you speak to your\n[21:17] mom and your dad at this point about\n[21:19] comedy? Do they think that's a serious\n[21:21] career?\n[21:22] >> My dad not as much cuz I didn't really\n[21:25] talk to my dad through these years.\n[21:27] That's my dad was kind of dealing with\n[21:28] his his world of issues. Um, my mom, we\n[21:33] had an agreement. I had a certain amount\n[21:35] of time to make comedy make sense and\n[21:39] figure out a way to support myself. Um,\n[21:42] if I didn't do it, then I had to go with\n[21:44] my mom's idea, which was education and\n[21:48] getting a job while getting my\n[21:50] education. My plan didn't it didn't\n[21:52] involve college. I'm out. I'm done. I'm\n[21:56] done. No more community. This is what I\n[21:58] want to do. I got it. My I've never been\n[22:00] more excited about my future. This is it\n[22:04] for me.\n[22:07] How you going to make your money, Kevin?\n[22:09] I'm going figure it out. How you going\n[22:11] to figure it out? I'mma figure it out\n[22:14] though. I'm just going to go down to the\n[22:16] comedy clubs and I've been winning the\n[22:17] amateur nights. I think the amateur\n[22:19] nights help me pay for my rent cuz I was\n[22:20] winning the amateur nights. I won a\n[22:22] bunch of them in a row. In my mind, it\n[22:25] wasn't hard. It wasn't going to be hard\n[22:27] because there was no other option. All\n[22:29] my eggs were in this basket and I was\n[22:31] very happy with that choice.\n[22:34] I put every last egg in this thing.\n[22:37] Nothing else matters but this. I promise\n[22:40] you I will figure it out.\n[22:42] >> Can you draw me a picture? If your\n[22:44] career was a graph?\n[22:45] >> Mhm.\n[22:45] >> Okay. So, I'm going to say here is 18\n[22:48] years old and you're 40 46 now. So,\n[22:51] you're 46 now. This is the axis of this\n[22:54] graph and on this axis we have let's say\n[22:57] success\n[22:59] and on this axis we have age. Can you\n[23:02] draw me a p a line that shows how how\n[23:06] >> success and age? Okay. So success for me\n[23:11] knowing what I want to do in life comes\n[23:13] here.\n[23:14] >> Yeah. right now. Figuring out\n[23:18] how to get to like\n[23:20] money, revenue,\n[23:23] just supporting yourself through telling\n[23:26] a joke, man. Let's go. Let's go here for\n[23:28] a second. We flatlining. Okay. Like, I'm\n[23:32] I mean, I'm making people laugh.\n[23:36] I'm I'm getting in some comedy clubs,\n[23:38] but you only get paid with food. But\n[23:41] then something weird happens where you\n[23:42] start figuring out, oh wait, here's kind\n[23:44] of where the spots come in. I can make\n[23:47] money on the weekends and I can get 20\n[23:51] to $25 a spot. So rather than doing one\n[23:55] spot, I would do, let's just say in a\n[24:00] weekend, I got to the point where I was\n[24:02] doing 25 to 28 sets.\n[24:06] >> A weekend.\n[24:07] >> Wow. Well, I started making 500 $500 a\n[24:11] week. $400 a week.\n[24:14] >> How many years in is this to you making?\n[24:17] >> 18. Let's say 22\n[24:21] >> two. Yeah.\n[24:22] >> So, I was driving from Philadelphia to\n[24:23] New York every day. But because of that,\n[24:26] now you got to get into a comedy\n[24:28] festival. All right. So, now let's start\n[24:31] to go here because we did these spots\n[24:33] for a while. But then I got in a comedy\n[24:34] festival. Oh [ __ ] I got in a comedy\n[24:36] festival.\n[24:37] But that's when the industry saw me.\n[24:39] Who's this new guy? Who's this guy with\n[24:41] all this energy? Who's this [ __ ] guy?\n[24:44] This guy here, he's got something.\n[24:46] All right. So, I started meetings,\n[24:48] general meetings, and now I get a\n[24:50] holding deal. So, let's go up a little\n[24:52] bit. I think it was ABC. They gave me\n[24:54] like 250 grand. So, they're holding you\n[24:56] in hopes they get something. Nothing\n[24:58] happens. So, we're flatlining here. Now,\n[25:00] I'm just waiting for the phone to ring.\n[25:01] That's how this works. What if I want to\n[25:04] create my own thing? Create a show. Oh\n[25:06] my god. Show gets picked up. I create\n[25:08] something else. They decide to do it. Oh\n[25:11] [ __ ] there's a pattern. I can do that\n[25:12] as much as I want. I can treat that just\n[25:15] how I was treating the spots and stuff\n[25:16] in New York. I'm out. I'm moving to LA.\n[25:20] No plan, no nothing. Flatline.\n[25:24] I'm here. I just did it. I just came and\n[25:26] moved out. [ __ ] man. This is weird. I\n[25:29] don't like this [laughter]\n[25:32] work. I'm not getting no work, man. This\n[25:34] [ __ ] is is real stagnant. I'm going on\n[25:37] the road. I want to I want to work the\n[25:40] road. I'm going to be a headliner. I'm\n[25:42] going to do colleges. So, I'm going to\n[25:44] get college money and comedy club money\n[25:47] and I'm going to do it. I worked that\n[25:49] for a very long time. Right. Very, very\n[25:52] long time to the point where now I'm\n[25:55] selling out comedy clubs. After I\n[25:57] started selling out comedy clubs,\n[25:59] my person at the time was like, \"Yo, we\n[26:02] can probably do theaters. You're adding\n[26:03] a lot of shows.\n[26:04] >> Are you a millionaire at this point?\n[26:06] >> No. No. I'm just an active active comic.\n[26:09] The next stage of success, right, was\n[26:13] let's go from comedy clubs to theaters.\n[26:16] All right. Boom. Let's go here. Then\n[26:19] let's go up again. Theaters start\n[26:21] selling out real quick. Oh, [ __ ] Let's\n[26:24] go from theaters, right, to like arenas.\n[26:28] Oh [ __ ] Will Packer, he was like, \"I\n[26:32] got this book that I want to make a\n[26:34] movie. It's called Think Like a Man.\n[26:35] Steve Harvey wrote it. I think you're\n[26:38] funny as hell. I've been tracking you on\n[26:40] tour. I want you to be the star.\" We\n[26:43] film it. Think Like a Man comes out.\n[26:44] Think Like a Man did 90 something\n[26:46] million dollars in the box office. And\n[26:48] Will says, \"Hey man, working with you is\n[26:50] great. Let's do something else. I got\n[26:52] this movie called Ride Along. You and\n[26:54] Ice Cube would be great.\" Boom. Ride\n[26:56] Along does 140. Like the movies just\n[26:59] started to pow, get hard, central\n[27:02] intelligence, me and the rock. I mean,\n[27:04] it just happened so fast. So now because\n[27:08] the movies are working, I'm like, this\n[27:10] is so cool. But while this is happening,\n[27:14] I should figure out like how to kind of\n[27:17] create my own source of like\n[27:21] opportunity. Like people keep bringing\n[27:23] opportunities to me. How do I create my\n[27:26] own source of opportunity? I'm gonna\n[27:28] start a a production company.\n[27:31] I need to start developing. But now I'm\n[27:33] like, I created that. Let's create\n[27:34] something else. So then I say, let's go\n[27:36] like Heartbeat Ventures and let's do a\n[27:39] VC. Oh man, I'm creating a bunch of\n[27:41] stuff. Hey, these entities around me,\n[27:43] it's all happening because my likeness.\n[27:45] My likeness allows me to get in these\n[27:47] rooms and start relationships and put\n[27:49] myself in a position to make deals and\n[27:52] create long-term revenue. How do I get\n[27:54] more of that? Wow.\n[27:57] Like NASCAR, people attach themselves to\n[28:00] the car they think is doing the best.\n[28:02] I'm a car. I should have brand\n[28:05] partnerships.\n[28:06] Chase, DraftKings, Fablettics.\n[28:11] I should have my own brands and\n[28:12] businesses that I'm building where more\n[28:16] opportunity for long-term revenue can\n[28:17] present itself.\n[28:19] Grand Cormino, wine, spirits. Now, oh\n[28:22] wow, I've grabbed this concept of\n[28:27] business control ownership and mirrored\n[28:30] it with Kevin's drive and entertainment\n[28:35] and visibility.\n[28:37] Leverage that to get me into the rooms\n[28:40] where I may not be as visible or as\n[28:44] strong, but once I'm embedded into these\n[28:46] environments, I can bring them value. I\n[28:49] can help amplify or uplift their brands,\n[28:52] their products. So, my case study of\n[28:57] Fablettics,\n[28:59] of DraftKings, before I got there versus\n[29:02] after I got there, Chase financial\n[29:05] literacy, like C4, like these are things\n[29:08] where I'm now, well, I'm not just a\n[29:11] partner, I'm an owner, I'm a endorser,\n[29:15] I'm an ambassador.\n[29:17] Oh, wow. This\n[29:19] is where the real money is made. The\n[29:22] ecosystem of life. How do you how do you\n[29:26] put yourself in a position to be a part\n[29:28] of everyday movement in life?\n[29:33] You're looking at things in a much\n[29:34] granular scale. And now I go way back\n[29:38] here\n[29:40] to when I was like not really focusing,\n[29:44] not thinking about life, not thinking\n[29:46] about how things connect. I'm now able\n[29:49] to tap into the lessons that my mom\n[29:51] gave. And I'm like,\n[29:55] all good things that happen happen when\n[29:56] they're supposed to. But now I'm poised\n[29:59] and polished enough with a mindset that\n[30:02] understands, well, I don't want to start\n[30:04] something that I'm not going to finish.\n[30:06] So, if I'm going to put myself in\n[30:07] position to do these things, how do I\n[30:10] make sure that my partners know I'm\n[30:11] willing to give my all?\n[30:14] How do I show that I'm not going to\n[30:15] quit?\n[30:17] Which back here, my mom's biggest lesson\n[30:20] was, you're not quitting. If you start\n[30:22] it, you're going to finish it. So, how\n[30:24] do I make my partners that I'm now\n[30:25] saying you should work with me? How do I\n[30:28] make Netflix secure and knowing that\n[30:30] when you get me, you get 100% of me and\n[30:33] I'm never going to quit. I'm going to\n[30:35] finish it all. How do I make my other\n[30:37] studio affiliates understand and working\n[30:40] with Heartbeat, it is in my best\n[30:42] interest to bring you great product,\n[30:43] great material so that you understand\n[30:46] what we do so that we can continue to\n[30:49] drive a business that has the best\n[30:51] interest for both of us. How do I sell\n[30:54] you on that? So now my business of sell\n[30:58] mirrors and matches my business of grow.\n[31:01] Nothing that I'm doing doesn't go hand\n[31:02] in hand. And I should be able to embed\n[31:06] the products or the partnerships that\n[31:08] I'm now operationally like attached to\n[31:12] into the ecosystem of entertainment. So\n[31:15] if I have a C4 can and I'm doing an\n[31:19] activation and health and wellness, well\n[31:22] C4 is my partner, I should integrate you\n[31:24] in this opportunity. Hey, my movie, we\n[31:27] have an opportunity to basically wear a\n[31:30] product. I should be in Fablettics in\n[31:33] this scene because this makes my partner\n[31:36] feel valued and positioned. Oh wow. This\n[31:39] is what I do. I elevate\n[31:44] I I I basically navigate my space of\n[31:47] ownership in a way like only I can to\n[31:50] elevate my partners so that my partners\n[31:53] go and say you're different. This is\n[31:56] different and this is what we need more\n[31:57] of.\n[31:59] That's my graph.\n[32:01] >> I've got some questions about the graph.\n[32:03] So, I guess the parts that I'm curious\n[32:05] about are this initial period when\n[32:07] you're 18 where like nothing's really\n[32:08] happening\n[32:09] >> because so many of my listeners,\n[32:11] probably most of them are in some\n[32:13] pursuit or sort of professional endeavor\n[32:15] in their life in this kind of stagnant\n[32:17] moment\n[32:18] >> where maybe they enjoy it, but like it\n[32:20] ain't paying the bills. No one believes\n[32:22] in them. Maybe some of their friends are\n[32:23] rolling their eyes when they tell them\n[32:24] what they're doing. When you look back\n[32:26] on this season of life, like what is\n[32:28] that season and how do you how'd you get\n[32:30] through it?\n[32:31] >> Nobody\n[32:32] believed that I was funny when I said I\n[32:35] was going to be a comedian. Like they\n[32:37] were like, \"You funny but not comedian\n[32:39] funny.\"\n[32:40] Like my friends were,\n[32:44] \"Yeah, what do you mean you gonna get on\n[32:45] stage? What do you mean I'm going to get\n[32:46] on stage? I'm going be a comedian.\"\n[32:48] G like how? Like Eddie Murphy. Like I'm\n[32:51] going be a comedian. Yeah, but you're\n[32:52] never going to be Eddie Murphy. Yeah, I\n[32:54] know. But I'm I'm saying like I'm going\n[32:56] to do it. Like I'm going to be I'm be a\n[32:57] star. No,\n[32:59] I don't know, man.\n[33:02] I don't know about the whole star thing.\n[33:03] I think you're tripping. I think I don't\n[33:06] I don't I don't think that's it. Nobody\n[33:09] has the confidence in the decisions that\n[33:10] you're making for yourself like you do.\n[33:14] So if you're waiting for that to connect\n[33:16] in the beginning stages, it may or may\n[33:18] not. If it doesn't, it shouldn't prevent\n[33:20] you from like following through on\n[33:23] whatever the the line of like go is for\n[33:27] you.\n[33:29] The money is never coming fast.\n[33:33] We're in a time today where this\n[33:35] generation has found ways to make money\n[33:40] in a entrepreneur manner\n[33:44] that we've never seen before. like the\n[33:46] the social media machine and how this\n[33:51] generation navigates that machine to\n[33:53] find revenue and to own\n[33:56] is unbelievable. That didn't exist. We\n[34:00] didn't have the like in in my time. We\n[34:03] didn't have that.\n[34:04] >> We just had the struggle\n[34:06] >> and the struggle left you with days of\n[34:08] like literally sitting in the living\n[34:10] room going, \"What the [ __ ] man?\"\n[34:13] >> So, why didn't you quit? because no\n[34:15] money, everyone's doubting it. What What\n[34:17] were you believing in?\n[34:18] >> I was believing in the idea that I\n[34:20] finally found the thing that I want to\n[34:22] do.\n[34:22] >> So, it was passion that was really you\n[34:24] anchored to\n[34:24] >> I I found the thing that I want to do\n[34:27] and I'm not going to quit it because I\n[34:30] love it this much and I strongly believe\n[34:34] that the sun is at the end of this dark\n[34:36] tunnel, but I got to be willing to get\n[34:38] there. And I I just don't know how to\n[34:40] get there yet, but I'mma figure it out.\n[34:44] Guess I'm going to LA.\n[34:47] I was in New York, but after New York,\n[34:48] they say go to LA. I'm gone.\n[34:51] What you going to do when you get there?\n[34:52] I'll figure it out.\n[34:55] I can always get on the plane and fly\n[34:56] where I got to go for stand up. If\n[34:58] that's the case, I can always go and\n[35:00] make money doing standup\n[35:03] if I have to, but I'm not going to get\n[35:04] to the star\n[35:06] by just doing that. I got to I got to go\n[35:09] there. I got to get close to it. I got\n[35:12] to smell it. I got to feel it. I got to\n[35:13] find out where the people are that are\n[35:16] trying to do it, too. I got to get\n[35:17] acting classes. I got to I got to get\n[35:19] around the the the Hollywood. Like, what\n[35:21] is H? I got to get there. And what\n[35:24] happens when you're there? It fuels\n[35:26] another another like\n[35:30] another appetite of of hunger cuz I'm\n[35:34] there in real time. I'm seeing people\n[35:36] better. I remember I tell this Cat\n[35:38] Williams story and I don't I don't even\n[35:41] think I told Cat this. Uh\n[35:48] there was a moment where I was opening\n[35:49] for Cat Williams and\n[35:52] I remember\n[35:54] I remember being at the the BET Comedy\n[35:57] Awards\n[35:59] and I'm in I'm in attendance and this is\n[36:02] like you know I'd had a couple of shots\n[36:04] at some things but they just you know it\n[36:06] wasn't the things weren't sticking like\n[36:08] the the the pilots I thought were going\n[36:11] to hit weren't going to hit the the\n[36:13] things that I thought were going to\n[36:14] happen, they just weren't. It just\n[36:16] didn't seem like it was adding up,\n[36:18] right? Like the the roles are little\n[36:20] small roles or little small cameos, but\n[36:23] like it wasn't it wasn't the thing. And\n[36:25] I remember Cat Williams set during the\n[36:28] BET Comedy Awards, he had like a leopard\n[36:31] suit,\n[36:33] destroyed,\n[36:35] destroyed the Comedy Awards, destroyed\n[36:38] this moment. And\n[36:41] audience goes crazy, stands up.\n[36:45] I remember being in the audience and I\n[36:47] was like, that's it.\n[36:50] I say like that's the that's the thing.\n[36:53] that thing, that reaction, that roar,\n[36:56] that moment.\n[36:58] I got to be patient because my moment is\n[37:01] going to come. I witnessed his moment.\n[37:05] And he after that moment,\n[37:09] it was Friday after next, you know, that\n[37:11] I mean, he went on and started to do\n[37:13] crazy things in his career, right? But I\n[37:16] witnessed the moment. And in that\n[37:18] moment, my takeaway was that he was\n[37:21] ready for the moment.\n[37:23] his material, the the jokes, everything,\n[37:28] it all hit. And I didn't watch it in a\n[37:31] in a manner of like jealous or angry. I\n[37:34] was like that that's it. Like he's\n[37:40] probably out of here after this. I mean,\n[37:42] it's the BT Comedy Awards. At the time,\n[37:45] I'm like, this is the biggest thing\n[37:47] ever, right? This the comedy awards. By\n[37:49] the way, they never did the Comedy\n[37:50] Awards again. I think this is like the\n[37:53] last one they did. But that moment,\n[37:57] if the ball is dropped in that moment,\n[38:01] then the moment goes. You don't know\n[38:04] when the moment is presenting itself,\n[38:07] but I'm staying with the thing because I\n[38:09] know that the moment is going to come.\n[38:12] And when I'm in the moment, if I knock\n[38:15] that [ __ ] moment out the park,\n[38:18] all things will change. But you may not\n[38:20] know it. You may not know when the\n[38:21] moment comes.\n[38:22] >> When did your moment come?\n[38:24] >> Shaq's all-star comedy jam. The reason\n[38:27] why I equated with the story with cat.\n[38:30] Uh I believe it was Tommy Davidson. It\n[38:32] was D set of the Entertainer was a host.\n[38:35] I headlined it. I end up having one of\n[38:39] the best sets that I've ever had. And at\n[38:42] the end of the Shacks Allstar Comedy\n[38:44] Jam, I say good night and they do like a\n[38:46] slow motion walkoff.\n[38:49] It's a slow motion thing and it's like\n[38:51] I'm I'm walking, the crowd stands up and\n[38:56] they're going crazy. By the way, I don't\n[38:57] know the slow motion walkoff is going to\n[38:59] happen in the edit of the special, but I\n[39:02] remember in real time crowds standing\n[39:04] up, stars were there. Everybody was\n[39:07] there, right? And in that moment,\n[39:12] show you how [ __ ] crazy the world is.\n[39:15] This is why I hate that like me and Cat\n[39:18] went through our stuff and we're much\n[39:20] better now. I'm going show you how the\n[39:22] world aligns.\n[39:24] Cat was in the audience. The Shacks\n[39:27] Allstar Comedy Jam and Cat was watching\n[39:30] the show. He was just there as a fan,\n[39:31] but at this time everything big is\n[39:34] happening.\n[39:36] And I had a moment\n[39:39] and that was the moment that then took\n[39:41] me and shot me out the cannon.\n[39:45] And if I wasn't prepared for the moment\n[39:47] and I wouldn't have known all the things\n[39:49] to come. Okay. But that then set up I\n[39:52] was releasing my special. My special\n[39:54] seriously funny. I was taping in two\n[39:56] weeks.\n[39:58] So Shaq's Allstar Comedy Jam goes they\n[40:00] rush to put it out. It crushes. I then\n[40:03] tape my comedy special. Seriously funny\n[40:07] was my next special. Seriously funny\n[40:10] destroys,\n[40:12] but it only destroyed because of Shaq's\n[40:14] All-Star Comedy Jam. And the audience\n[40:16] that watched that and I was like, \"Oh my\n[40:19] god, this guy showed up in droves for\n[40:21] Seriously Funny.\" And then Seriously\n[40:23] Funny was like, \"Oh [ __ ] this big ass\n[40:26] special.\" And then the arenas and\n[40:30] everything. Boom, boom, boom, boom,\n[40:31] boom.\n[40:33] >> So about 12, 13 years from the moment\n[40:36] you did your first sort of standup event\n[40:38] to you having your moment. And I find\n[40:41] that fascinating cuz those 13 years most\n[40:43] people\n[40:44] >> aren't willing to do something for 13\n[40:45] years without their moment showing up.\n[40:47] >> Like when you hear like I don't know\n[40:49] [ __ ] on Instagram or quotes or you watch\n[40:50] motivational videos and stuff.\n[40:52] >> If they told you that it would take 13\n[40:54] years for you to have your moment,\n[40:55] almost nobody would take part.\n[40:57] >> Nobody. No. and those 13 years of your\n[41:00] training.\n[41:00] >> I mean, so Scooter Braun told me one\n[41:04] time, he was like, what makes him\n[41:06] different is the work that he's willing\n[41:08] to do in something. And he was like, you\n[41:12] know, if they were giving out like a\n[41:16] million dollars for somebody that can\n[41:19] hit a fast ball pitch, you know, from a\n[41:23] from the best pitcher in baseball,\n[41:26] right? And this thing will basically\n[41:29] require everybody everybody's going to\n[41:32] go and try to hit this because everybody\n[41:33] wants the million dollars. So the first\n[41:36] day of the announcement, the line to hit\n[41:40] this pitch is going to be\n[41:43] droves, right? Like I mean millions of\n[41:45] people, who knows how many people would\n[41:46] be in this line and people would go up\n[41:49] and strike out and after that they would\n[41:53] go, \"Damn, it's over.\" like I missed.\n[41:59] Not many people would like miss and then\n[42:02] go stand back in line to go hit the ball\n[42:06] again. He was like, I'm going to keep\n[42:10] getting in line. What you'll find is\n[42:13] that the line will get smaller and\n[42:14] smaller\n[42:16] because of how many people are dropping\n[42:19] out and optioning not to wait and do the\n[42:22] hard thing again.\n[42:25] That comparison and that\n[42:28] world of understanding is like something\n[42:31] that equates to life\n[42:33] very well, right? Not many people are\n[42:36] going to wait through the 13 years of\n[42:39] like [ __ ] hardship. Most people opt\n[42:43] out at year two,\n[42:45] maybe three, no money, whatever. I need\n[42:48] to figure something else out. Year six,\n[42:50] [ __ ] this man. Stupid. What am I doing?\n[42:53] Why am I doing it? Right? I'm going to\n[42:56] go find the quick avenue or the quick\n[42:58] return because money is the that's what\n[43:01] it boils down to for most people.\n[43:04] Where's the money? Where am I making the\n[43:06] money?\n[43:09] When the money comes, it comes.\n[43:11] [clears throat]\n[43:13] What you find is that it's not hard to\n[43:16] make money once you start making money.\n[43:18] You learn\n[43:20] how to make money. like you. It comes\n[43:23] with education. It comes with\n[43:26] understanding and it comes with a better\n[43:30] resource of mind that makes you go, \"No,\n[43:34] I'm going to do this and I'm going to\n[43:35] build this and I'm going to go here. I'm\n[43:36] going to meet. I'm going to present. I\n[43:37] have an idea. I'm going to pitch it.\"\n[43:39] like you you're now a a much better\n[43:42] machine because you understand\n[43:46] money is no longer the thing that you\n[43:50] think it was when you get to it. But\n[43:52] getting to it to get that understanding,\n[43:56] you lose the pack.\n[43:58] You lose the pack because the pack is\n[44:00] like, I want it here. And because it\n[44:03] didn't show up here, I got to go figure\n[44:05] out a new thing to do that's going to\n[44:06] give it to me here. And they got to\n[44:07] recycle like\n[44:08] >> they lose focus.\n[44:09] >> Yes. You you're never completing\n[44:11] anything. You never finish nothing. So\n[44:14] the thing that you think you're focusing\n[44:15] on, you keep quitting to start something\n[44:17] else that you think is an idea and it's\n[44:18] just a cycle. It's a cycle.\n[44:21] >> Don't you notice that people come up to\n[44:23] I notice this a lot with young\n[44:24] entrepreneurs, especially those that\n[44:25] aren't having success. They start one\n[44:27] thing. Well, they when they come and\n[44:28] tell you what they do, they tell you 17\n[44:30] things.\n[44:30] >> 17.\n[44:31] >> None of them have ever say 17 things.\n[44:33] >> Mhm. And they think that more doing more\n[44:36] things is increasing the probability of\n[44:37] success.\n[44:38] >> 100% where it's the opposite. [laughter]\n[44:42] >> It's the opposite. It's the it's the\n[44:44] thing that you actually thought of that\n[44:46] you are going to put 100% of your mind\n[44:50] and focus into to complete. And then\n[44:53] after that, you're able to pick it apart\n[44:55] and take the good, the bad, the whatever\n[44:57] and either restart that thing again to\n[45:00] improve it or make a decision to do\n[45:02] something else. But you finished. I made\n[45:05] the choice that standup comedy was what\n[45:07] I was going to finish. I made a choice\n[45:10] that becoming a good comic and a good\n[45:12] headliner, if I focused and did it well,\n[45:16] that would open up the doors for me to\n[45:18] do everything else that I want to do. If\n[45:21] I don't have that,\n[45:24] how do I expect to get in?\n[45:27] >> I was speaking to Evan at Snapchat and\n[45:28] he was talking about T-shaped people. So\n[45:30] you have like a broad understanding of\n[45:32] of a lot of things, but then you're like\n[45:33] really deep on one particular thing. And\n[45:35] that one particular thing is almost I\n[45:37] guess you could see as like screw that\n[45:39] gets you into the industries. So for me,\n[45:41] mine would have originally been\n[45:43] marketing, but I was able to use that\n[45:44] like deep expertise to then launch this\n[45:46] media business cuz it's still the same\n[45:48] game of marketing that I did for for 15\n[45:49] years. I was able to go into like the\n[45:51] stock market because they really needed\n[45:53] to understand marketing. And it was that\n[45:55] deep expertise in one thing that was my\n[45:57] leverage in all of these really\n[45:58] interesting rooms. It's kind of what you\n[45:59] were saying at the start like you had\n[46:00] this deep expertise, this deep IP\n[46:02] experience value that allowed you to\n[46:04] like break in as an investor and then to\n[46:06] production and all these other areas. I\n[46:09] mean the value the value for me it was\n[46:10] self but\n[46:13] the value of self and understanding\n[46:17] of how to truly control and operate that\n[46:20] and navigate that correctly.\n[46:22] That's a that's a world of its own. So\n[46:27] the bigger that the star gets,\n[46:30] the brighter that the star shines.\n[46:33] If you are paying attention, it's only\n[46:37] positioning you to go in places where\n[46:40] people say, \"Oh my god, I know you.\" And\n[46:42] where you can shake a hand, but the\n[46:44] interest of just knowing you because of\n[46:45] the place from the star, it allows a\n[46:48] moment for the conversation of, \"So what\n[46:51] is it that you do?\"\n[46:53] Oh my god. Like that's that's so cool. I\n[46:56] would love to learn more about that. And\n[46:58] what you'll find is that the resources\n[47:00] of opportunity over there are endless.\n[47:02] Oh my god. Are you serious? We would\n[47:03] love to partner with you in something\n[47:05] like this. I mean, in this space, are\n[47:07] you talking about mental health,\n[47:09] wellness? Listen, strong voices and\n[47:12] confident voices or inspiring voices.\n[47:14] There could be a lot for us in what we\n[47:16] do here. Hey, maybe there's a\n[47:18] partnership that we can form. Oh my god,\n[47:22] man. Back to school kids. I love kids.\n[47:23] I'm thinking about doing more like\n[47:25] here's something where I think I can\n[47:27] have a very very good cadence and a and\n[47:29] a very good energy towards getting kids\n[47:32] hype about school education because it's\n[47:35] not something that I took serious. How\n[47:37] do I help? Where did you learn? So when\n[47:40] I look at this graph here, I see this\n[47:42] sort of moment where things become go up\n[47:45] and to the right very quickly where you\n[47:46] start to get into entrepreneurship. But\n[47:48] at this moment that comes before it, you\n[47:50] didn't know this stuff. So at some point\n[47:52] you acquired information. So for the\n[47:54] people that are listening now that are\n[47:55] thinking like how did Kevin go from a\n[47:56] kid that was in this rough area, dad\n[47:58] wasn't around much, his mom was raising\n[48:00] him to a guy that knows all this stuff.\n[48:03] >> You get there now by being a sponge and\n[48:08] not being afraid to ask questions. I am\n[48:12] I'm very secure\n[48:14] in myself\n[48:16] and being the dummy in the room.\n[48:19] I am extremely secure and saying I don't\n[48:22] know what that means.\n[48:24] Explain that.\n[48:25] >> Give me an example of a context where\n[48:27] you\n[48:27] >> I can give you several like venture and\n[48:31] investing.\n[48:33] I was a firm believer that nobody's\n[48:35] stealing my money\n[48:38] and giving you nothing.\n[48:40] Yeah. You going to go and put it where?\n[48:42] [laughter] Yeah. No, my money going to\n[48:44] stay right here under my bed. I'm not\n[48:46] doing that. So give you you want me to\n[48:49] give you money and you telling me you\n[48:52] going to get you going to take that\n[48:54] money and then that money is going to\n[48:56] turn into what? Yeah.\n[49:00] Okay. Go find you another idiot cuz it\n[49:03] ain't happening over here, buddy. Get\n[49:05] your scamming ass up out of here. Okay.\n[49:07] I come from the world of everything is a\n[49:09] scam. Okay. It's a [ __ ] scam. I know\n[49:12] a scam when I see one. All right. But\n[49:15] when you go, you say, \"Well, how does\n[49:18] the stock market really work?\" Or, \"How\n[49:20] does investing really work?\" Or, \"What\n[49:22] do you mean you make money while you\n[49:23] sleeping?\" What does that mean? What do\n[49:26] you mean by that? How does this brand\n[49:27] [clears throat]\n[49:28] partnership [ __ ] really work? Like, you\n[49:32] you can't be afraid\n[49:35] to like verbalize your ignorance.\n[49:39] And and the bigger problem,\n[49:42] [clears throat] which I'm sure a lot of\n[49:43] your viewers\n[49:46] have,\n[49:48] is like insecurely like just being quiet\n[49:54] about the [ __ ] that they don't know\n[49:58] as if you're going to figure it out\n[50:00] because someday, one day, somebody's\n[50:02] going to go, \"Hey, you look like you\n[50:04] need to know.\"\n[50:07] >> [laughter]\n[50:07] >> It'll never happen that way. It's never\n[50:10] going to happen. You're never going to\n[50:11] run into a person who's randomly going\n[50:14] to talk about the things that you wish\n[50:16] you had more knowledge in. It will never\n[50:19] happen. And what you'll find is that\n[50:21] information is not free, but it's\n[50:24] available.\n[50:25] It's not actually hard to obtain. It's\n[50:27] only hard to people that are very\n[50:30] insecure about just verbalizing\n[50:35] I don't know where to get it.\n[50:38] Look at how many howto's help to all of\n[50:42] these things today. the the success that\n[50:45] we're seeing in entrepreneur and\n[50:46] influencer streamer and all of this\n[50:48] stuff in entertainment is the same\n[50:50] success that you're seeing in\n[50:53] uh\n[50:55] we can call them motivational speakers,\n[50:57] howto experts, uh step one through five\n[51:00] and what to do. The idea of I'm here to\n[51:04] service you and give you the information\n[51:05] that you don't know is available. So,\n[51:07] let me tell you how to get it.\n[51:09] Here's what I'm going to help you. three\n[51:11] easy steps to making sure that you can\n[51:14] and I don't care if you want to go to\n[51:17] the world of athletics or you want to go\n[51:19] to corporate or you want to go to\n[51:21] entertainment like you can break it down\n[51:23] golf do you know how much money is being\n[51:25] made in a game of golf because you got\n[51:30] millions of people that are trying to\n[51:32] give people information on how to better\n[51:35] improve your golf swing cuz I don't want\n[51:37] to I don't want to say out loud my swing\n[51:39] ain't [ __ ] but I don't know Man, I keep\n[51:42] coming down on top of the ball. Why the\n[51:44] [ __ ] am I coming down on top of the\n[51:46] ball? I don't know what's happening. And\n[51:48] some people would rather go out in their\n[51:50] backyard every day, hit the same ball,\n[51:54] then just ask somebody, \"Hey man, any\n[51:57] way that you can tell me [laughter] how\n[51:58] to come like what? How do you get that\n[52:00] [ __ ] in the air?\" So now people online\n[52:03] go, well, we're just going to put it out\n[52:05] here and that person that's struggling\n[52:07] quietly where they're going to discover\n[52:08] me and in silence they'll watch and\n[52:11] they'll look to improve because nobody\n[52:13] knows\n[52:15] and they still get to be quiet.\n[52:18] That's the problem.\n[52:21] Just give me a minute of your time and\n[52:22] I'll tell you about a device that my\n[52:24] team's been using that they won't seem\n[52:26] to shut up about. It's called the Note\n[52:28] Pro and it's by our sponsor Plaude. This\n[52:32] tiny card clips onto the back of your\n[52:34] phone and captures everything. But why\n[52:37] it's so clever is that it picks up\n[52:39] multiple voices at the same time. And\n[52:41] when someone says something important,\n[52:43] you just push this tiny little button\n[52:44] here and that moment gets highlighted in\n[52:48] your notes and captured. It records the\n[52:50] conversations that it hears, takes those\n[52:52] conversations, creates a transcript, and\n[52:55] it uses AI to synthesize all of that\n[52:57] information into whatever template suits\n[53:00] you. You get a summary, action points,\n[53:02] highlights, and even a mind map sent\n[53:05] straight to the Plaude app. So, I highly\n[53:07] recommend you check out Plaude's\n[53:08] products using the link in the\n[53:10] description below. Don't tell anybody\n[53:12] this, but if you use code DOAC22,\n[53:16] you'll get 22% off on some of Plaude's\n[53:18] products. There's also unknown unknowns,\n[53:21] which you would have experienced. I\n[53:23] remember you talking about um you got to\n[53:25] see behind curtains and you didn't even\n[53:26] know people were behind there. And when\n[53:28] when I heard you say that, it was the\n[53:29] perfect metaphor and analogy for exactly\n[53:32] what I had experienced in my life.\n[53:33] Coming from a kid that came from a very\n[53:34] normal background, was was born in\n[53:36] Africa, moved to the UK, mother's\n[53:38] Nigerian, dad's English, and didn't know\n[53:41] that all these like rich people were\n[53:43] back here playing money games. I thought\n[53:45] the way you make money is you like work\n[53:46] in McDonald's, you like work really\n[53:48] hard, you might become manager, D. And\n[53:50] then at like I'm going to say 27 being\n[53:53] sat in a billionaire's kitchen and\n[53:55] watching him on the phone and he's\n[53:57] calling his boy and they're doing 50\n[53:59] million just before the IPO happens so\n[54:01] that they get a better price and I'm\n[54:03] thinking [ __ ] hell.\n[54:04] >> It's all it\n[54:07] the the the thing that I've realized\n[54:10] right when you look at your biggest\n[54:12] investors right\n[54:16] you'll find that they're all together.\n[54:19] None of them are investing in the new\n[54:22] thing alone.\n[54:25] They all are like, \"Well, it's better\n[54:28] with you,\n[54:30] so do it with me.\" Well, what about\n[54:31] Gary? Yeah, call Gary, too. Let's see if\n[54:33] we can get him in here. What about\n[54:35] Michelle? Yeah. Hey, Michelle. What\n[54:37] about Melissa? All right. You'll find\n[54:40] that this group of 10 people all who\n[54:44] could easily do something on their own\n[54:47] do not believe in the struggles of self\n[54:50] when you can combine\n[54:52] this machine of great minds\n[54:55] to provide another great opportunity and\n[54:58] in success. Well, this thing works. The\n[55:01] company gets bigger. Well, let's use our\n[55:03] resources to go out and make sure that\n[55:05] we align the person that they already\n[55:08] have with more amazing individuals,\n[55:12] create more jobs, more opportunities for\n[55:14] new minds to become successful. And then\n[55:17] in those minds building and that\n[55:20] personnel like elevating,\n[55:24] well, now this person that was at the\n[55:25] bottom here, we then go and ask this\n[55:27] person to run this thing. And now\n[55:30] underneath this thing we get another\n[55:32] version of a downpour.\n[55:34] New minds, new personnel, new things.\n[55:36] Okay, this whole business of venture,\n[55:40] this whole business of company build,\n[55:42] whether it's tech, lifestyle, health,\n[55:44] well, it doesn't matter what it is. You\n[55:46] will notice that the people that started\n[55:48] from the bottom are now running the new\n[55:50] companies of today. And now the source\n[55:53] of personnel that's underneath it will\n[55:56] be the minds running the company of\n[55:58] tomorrow.\n[55:59] It's not like rocket science. Once\n[56:02] you're behind the curtain\n[56:05] once you go, \"Oh shit.\"\n[56:09] I remember when when I first started\n[56:11] like investing this, \"Oh my god, Kevin,\n[56:13] like your your money in this would add a\n[56:15] crazy amount of value.\" Well, I ain't\n[56:17] putting in what y'all put in. No, but\n[56:19] the fact that you're involved in it at\n[56:20] all is just big that you believe in it\n[56:22] and we're able to say that you believe\n[56:23] in it with us is huge.\n[56:26] What do you mean by that? [laughter]\n[56:28] You trying to [ __ ] steal? What are\n[56:30] you doing? What are you doing, man? You\n[56:32] talking too fast. Say what you said\n[56:33] again. Slow down so I understand it.\n[56:35] Don't talk fast to me because I'm so\n[56:38] insecure cuz I don't know what you're\n[56:40] saying and it might be some [ __ ] in\n[56:42] here.\n[56:44] But it's No. Well,\n[56:46] we know that you're you're doing well\n[56:49] over here and your movies and all that\n[56:50] stuff is cool, but this is different.\n[56:53] This business, Kevin, could be different\n[56:54] for you. It's a business of multiple. So\n[56:58] we play a game of multiples of X. So\n[57:01] what your money is today? Well, we think\n[57:03] in success if this is a light bulb or a\n[57:07] bottle rocket, you 30X, 20X. What the\n[57:10] [ __ ] You're telling me that if I put\n[57:13] this money in here right now, and if my\n[57:17] voice is attached to the thing that I\n[57:19] think it is, which is a crazy\n[57:21] crazy venture, a crazy opportunity.\n[57:25] Well, yeah, Kevin. I mean, look, we all\n[57:27] believe that, but with your voice, we\n[57:29] may be able to say it a little louder.\n[57:31] Oh my.\n[57:34] Oh my. Okay. Well, I did it. Oh my. I I\n[57:36] won. I got a return. Oh my.\n[57:40] Oh.\n[57:44] Oh.\n[57:45] So, now I figured it out. Now, now\n[57:48] you're part of the right conversations.\n[57:49] You're part of the the right\n[57:51] opportunities. But once again,\n[57:54] the information is discovered\n[57:57] because of the opportunity to be the\n[57:59] flower on the wall in the spaces that\n[58:01] you never imagined yourself being in.\n[58:03] But now, look at what I'm able to do.\n[58:05] I'm able to take this information, take\n[58:07] all the [ __ ] that I know, come and have\n[58:09] these [ __ ] organic conversations like\n[58:12] I am now. And we're sharing it. And some\n[58:16] people that are watching this are going\n[58:18] to take that information and go, I knew\n[58:20] it.\n[58:22] and I'm doing the right thing and it's a\n[58:24] matter of time before I get around them.\n[58:25] And when I do, oh my god, the things\n[58:27] that I have, the stuff that I have on\n[58:29] the table, the things that I have\n[58:31] created, the opportunities,\n[58:34] I'mma be the next person to bring the\n[58:36] thing that everybody else is involved\n[58:37] in. I'mma be the next person to be the\n[58:40] [ __ ] energy source to tomorrow's\n[58:42] future future within. like people just\n[58:46] need to hear\n[58:48] how fast it happens, quick it happens,\n[58:50] and and and when it does what you're\n[58:52] supposed to be ready for.\n[58:54] >> And you were able to invest in lots of\n[58:56] great companies like Function Health,\n[58:57] that's valued at 2.5 billion now. 11\n[59:00] Labs, everybody knows in the tech space,\n[59:02] those 11 Labs, which were valued valued\n[59:04] at three billion now, Moonpay, um\n[59:07] >> Young Labs, Sweat Pals, Radiant,\n[59:09] Noranics, Paltown, um\n[59:11] >> tons of stuff stuff that you would never\n[59:12] expect me to be in. How much of this\n[59:14] game have you learned in hindsight is\n[59:16] about\n[59:18] people about like getting because even\n[59:21] when that person was saying to you that\n[59:22] analogy you gave of they're telling you\n[59:23] to put your money into this thing and\n[59:24] you're going [ __ ] me are they stealing\n[59:26] you're going to have to lean on someone\n[59:27] you trust like someone in your circle\n[59:29] that you know\n[59:31] >> and I'm I'm wondering cuz people don't\n[59:32] talk about it enough how how important\n[59:35] it is to like\n[59:36] >> collect the right people and can you\n[59:38] think of moments where you like met a\n[59:40] person and that was like gamechanging\n[59:43] and you understanding a whole new world\n[59:44] and what was behind the curtain.\n[59:46] >> All of my people could see this. I'm I'm\n[59:48] just going to be extremely transparent.\n[59:51] Like you\n[59:53] before you get to the right people, you\n[59:54] run through wrong people.\n[59:57] And\n[59:59] with wrong people, you can go like,\n[01:00:01] they're wrong. They don't work. I got to\n[01:00:03] get somebody else. Or you can grow with\n[01:00:05] people.\n[01:00:07] I'm a believer of the grow, right? Like\n[01:00:11] I think it's dope when we can all say we\n[01:00:14] started a certain way but we're ending\n[01:00:16] up in a completely different space along\n[01:00:19] that journey of growth. Some people\n[01:00:21] won't make it. You can be patient and\n[01:00:24] you can want the best for some but they\n[01:00:26] might not want the same for themselves.\n[01:00:29] So because of that the falloff\n[01:00:32] presents itself to be a little more\n[01:00:34] consistent um than what it should be.\n[01:00:37] Right. Mhm.\n[01:00:38] >> But in business, what you'll find\n[01:00:41] is that the emotions\n[01:00:44] can be your like\n[01:00:47] can be your worst asset. Having emotions\n[01:00:50] in business attached to business\n[01:00:54] can be everything but beneficial to the\n[01:00:56] business. So the more that I was able to\n[01:01:02] detach my emotions\n[01:01:04] from the world of want and understand\n[01:01:07] that the things that I'm doing are to\n[01:01:09] better position the business\n[01:01:12] and the people that have worked so hard\n[01:01:14] to help this business get to where it is\n[01:01:16] today. I have a service to them as well.\n[01:01:19] How do I bring in the right valuable\n[01:01:21] assets to put us in a bigger position to\n[01:01:24] win? Sometimes you got to let go\n[01:01:28] of things that you thought would be the\n[01:01:30] thing, but you can you can climax. You\n[01:01:32] can you can get to a place where it's a\n[01:01:33] ceiling. You're like, we're not getting\n[01:01:35] past the ceiling unless we go get the\n[01:01:36] right people, unless we go get the\n[01:01:38] correct personnel. So, I'm a firm\n[01:01:40] believer in talent. I'm a firm believer\n[01:01:44] in rewarding those that do a job and\n[01:01:48] that can do a job at a high level. But\n[01:01:50] the only way to you realize that is to\n[01:01:52] get out of the way. I had to learn to\n[01:01:55] stop trying to control everything. Stop\n[01:01:56] trying to do everything. Stop trying to\n[01:01:58] be with my the one with my hands in\n[01:02:00] everything and put people in a position\n[01:02:02] to do the thing that they've been hired\n[01:02:05] to do and do it well. But the patience\n[01:02:09] that you have to have\n[01:02:12] and learning people and dealing with\n[01:02:16] people is a talent within itself. I want\n[01:02:20] to say like you're\n[01:02:24] at this stage I'm more\n[01:02:27] I'm more of a hard drive\n[01:02:31] of other people's issues or problems\n[01:02:34] than I am a person. [laughter]\n[01:02:38] I I am a hard drive of can I talk to\n[01:02:42] you? I want to tell you what's going on.\n[01:02:45] I have an issue with. Hey man, look, I'm\n[01:02:49] trying to do this. I don't know what\n[01:02:50] they trying to do. Here's what I'm\n[01:02:51] trying to do. And you have to be a\n[01:02:53] positive source of solution all day,\n[01:02:56] every day. Because if you're talking and\n[01:02:59] you're talking to do anything but solve,\n[01:03:01] then you shouldn't be in the chair of\n[01:03:03] control. So I am solutiondriven\n[01:03:07] every single day because I am faced with\n[01:03:10] a new problem attached to the ecosystem\n[01:03:13] and the community that I built\n[01:03:14] underneath me of how to navigate or how\n[01:03:17] to better navigate in the world because\n[01:03:20] everybody's trying to do something to\n[01:03:22] prove that they're worthy of the seat or\n[01:03:24] seats that they have or that they want.\n[01:03:28] So every day\n[01:03:30] you're dealing with a board of shuffle\n[01:03:32] and a new board of opportunity\n[01:03:34] >> and drama.\n[01:03:34] >> And every day you're telling people not\n[01:03:37] now and time. Slow up. I hear you. We'll\n[01:03:43] deal with it. Let's all talk together.\n[01:03:47] Communication is key. Let's table this\n[01:03:49] and make sure everybody's on the same\n[01:03:51] page. you're saying things five and six\n[01:03:54] times because you have to make sure that\n[01:03:57] you're the best example of what you're\n[01:03:59] speaking.\n[01:04:00] So every day\n[01:04:03] the thing that you never thought would\n[01:04:05] come into play\n[01:04:07] is communication\n[01:04:10] and like the ability to [ __ ] give\n[01:04:13] great dialogue in the hopes of getting\n[01:04:16] the return of effort and work. So now\n[01:04:18] you're going back to ground zero when\n[01:04:21] you were with your mom and you were with\n[01:04:22] your friends in the early days of life.\n[01:04:25] And what was the thing that I told you I\n[01:04:27] did very well? I connected with\n[01:04:28] everybody in a lunchroom. I was at\n[01:04:31] everybody's table. Didn't matter who you\n[01:04:33] were, what you were, what race, what\n[01:04:36] didn't matter in this space of now\n[01:04:39] business and corporation. If everybody\n[01:04:41] doesn't feel like they can trust or\n[01:04:43] believe or follow\n[01:04:47] my direction, my vision, something about\n[01:04:50] what I'm doing is wrong.\n[01:04:52] >> How does one build an empire that relies\n[01:04:56] on people when they naturally\n[01:05:00] don't come from a place of that\n[01:05:01] information? So they they might have\n[01:05:03] trust issues like you were referring to\n[01:05:04] these kind of trust issues like wait a\n[01:05:05] minute, you're trying to steal my money.\n[01:05:06] How does you've got this big empire of\n[01:05:08] lots of different verticals within\n[01:05:10] within Heartbeat and your your companies\n[01:05:12] and your personal IP. You're going to\n[01:05:14] have to be trusting a lot of other\n[01:05:16] people with your wealth, with your\n[01:05:19] business, and with your with your\n[01:05:21] children's inheritance. And I hear so\n[01:05:22] many of these stories of I trusted a guy\n[01:05:24] and I lost everything. Especially\n[01:05:27] honestly, especially in the like black\n[01:05:28] community.\n[01:05:29] >> Mhm.\n[01:05:30] >> It's a major fact. Um, but we're also a\n[01:05:34] community that\n[01:05:36] gets taken advantage of\n[01:05:39] because of the lack of knowledge, right?\n[01:05:42] We get [ __ ] over more than we don't\n[01:05:46] because\n[01:05:48] All right. Well, it says here that\n[01:05:49] you're a lawyer and that you have my\n[01:05:51] best interest. All right. It says that\n[01:05:53] you're my manager and you have my best\n[01:05:56] interest.\n[01:05:58] All right. Well, you read the paperwork.\n[01:06:02] All right. You read the contract and\n[01:06:04] it's good and I'm just signing, right?\n[01:06:08] My ignorance doesn't mean that I'm lazy.\n[01:06:11] My ignorance means that I believe you.\n[01:06:15] And\n[01:06:17] I don't know to second guessess or\n[01:06:18] second check or to hire or onboard\n[01:06:22] people to second guess to second check\n[01:06:25] to show me\n[01:06:27] fine print fine line because it's\n[01:06:30] impossible. I can't get [ __ ] cuz you\n[01:06:32] said\n[01:06:34] well yeah I can't but you said\n[01:06:40] go back to the emotions and why I say\n[01:06:42] emotions had to be removed. I'm going to\n[01:06:45] have somebody look at this just so I\n[01:06:47] know that it is what it is. I wouldn't\n[01:06:49] lie to you. I know. But it's in the best\n[01:06:51] nature of business just for me to make\n[01:06:53] sure that my eyes that I have lay eyes\n[01:06:56] on it and they can just say what you\n[01:06:57] just said but just make sure I\n[01:06:59] understand it correctly. Yeah. But you\n[01:07:01] don't have to do that. It's nothing\n[01:07:02] against you. It's just a practice that I\n[01:07:05] have within the way that I now approach\n[01:07:07] business and anything that you do. It's\n[01:07:11] never personal. I don't take offense to\n[01:07:14] anything that you want to check or\n[01:07:16] background check on me. You should. It's\n[01:07:18] business.\n[01:07:20] I think that\n[01:07:24] we don't get a fair level of\n[01:07:26] understanding for our fuckups, for our\n[01:07:28] mishaps, of how the road presented\n[01:07:31] itself for somebody to take from me. So\n[01:07:34] when I'm recovering from the take,\n[01:07:37] well, you got to start at a safe space.\n[01:07:40] My space was never safe because they're\n[01:07:42] sharks. So they focus on the [ __ ]\n[01:07:45] prey. The young talent in the music\n[01:07:48] business is prey.\n[01:07:50] So the sharks see the young talent.\n[01:07:52] Whichever one gets there first\n[01:07:55] has an opportunity\n[01:07:57] to [ __ ] give me the presentation of\n[01:08:00] the world and make it bells, whistles,\n[01:08:01] and candy. Well, if I get there right\n[01:08:04] and the prey doesn't have the right\n[01:08:06] people around them, I'm going with the\n[01:08:07] shark every time.\n[01:08:08] >> I guess you there is an element of\n[01:08:10] responsibility here which people don't\n[01:08:12] like to acknowledge that you got to take\n[01:08:14] responsibility. I signed bad contracts\n[01:08:17] in my career and I was like I look back\n[01:08:18] at 20 years I go [ __ ] you know I lost\n[01:08:20] a lot there. But that was on me and if I\n[01:08:23] don't take responsibility then it's\n[01:08:24] going to happen again. But there's also\n[01:08:26] you you'll know a lot of people that\n[01:08:28] become victims. I don't think it's the\n[01:08:30] worst thing, right? Like it's when it\n[01:08:34] happens early on. Like I got a lot of\n[01:08:37] friends that are in the music business,\n[01:08:38] a lot of artists that are now\n[01:08:40] independent artists that control and own\n[01:08:41] their labels and are doing much better\n[01:08:44] at this position than they were when\n[01:08:46] they were signed underneath the big\n[01:08:48] thing. And they were getting taken, but\n[01:08:49] after finding out how it was and why it\n[01:08:52] was, they said, \"I'm going to go create\n[01:08:53] my own.\" Like, you know, when you look\n[01:08:55] at the biggest labels that are\n[01:08:57] independent and you look at the artists\n[01:08:58] that fall underneath these independent\n[01:09:00] labels, well, you'll look at a blueprint\n[01:09:03] of people following\n[01:09:06] >> the person that was like in front of\n[01:09:09] them and what they said, but it was only\n[01:09:11] because they learned the business of the\n[01:09:14] business, right? Like so being a part of\n[01:09:16] a business that's just succeeding and\n[01:09:18] you being embedded into it\n[01:09:21] >> and just being the work for hire that\n[01:09:22] just follows the suit what they say.\n[01:09:24] Well that's not smart if you have an\n[01:09:26] opportunity to mirror what they're doing\n[01:09:28] and create your own. So what I do like\n[01:09:31] within a culture is a lot of the artists\n[01:09:33] that are that are independent or that\n[01:09:35] are that are now like\n[01:09:39] able to say I have my own version\n[01:09:42] whether it's studio production company\n[01:09:45] label independent label whether it's own\n[01:09:48] line of product that they share\n[01:09:50] ownership with like people are now\n[01:09:53] learning to follow and and repeat what\n[01:09:57] the conglomerates are doing. I can use a\n[01:10:00] conglomerate and I can take your machine\n[01:10:04] and create a small version of a machine\n[01:10:07] underneath yours and partner with you\n[01:10:09] and give you a piece of my machine, but\n[01:10:12] it allows me to own I can leverage the\n[01:10:15] the the bank of opportunity and consumer\n[01:10:18] that you have here under this brand.\n[01:10:21] >> What's the cost though? Because you\n[01:10:23] know, you're incredibly successful.\n[01:10:24] You've got all this empire of companies\n[01:10:26] and businesses and ventures you've\n[01:10:27] started. They say that you can't have\n[01:10:29] everything in life,\n[01:10:31] >> especially not at the same time.\n[01:10:32] >> So, what is the cost of this pursuit?\n[01:10:35] Because\n[01:10:36] >> time.\n[01:10:36] >> Time.\n[01:10:37] >> Is your ambition like in uns insatiable?\n[01:10:40] >> Yes.\n[01:10:40] >> It just won't. You couldn't switch it\n[01:10:42] off if you wanted to.\n[01:10:43] >> And does that not make you feel like\n[01:10:45] you're being dragged versus being\n[01:10:46] driven?\n[01:10:47] >> You for sure have your days. I'm\n[01:10:48] absolutely stressed out. I'm stressed\n[01:10:51] the [ __ ] out on the daily, but I operate\n[01:10:54] within stress.\n[01:10:55] >> Are you happy?\n[01:10:56] >> I'm 10,000% happy, but I'm stressed out\n[01:11:00] with the concept of I have to do.\n[01:11:03] >> If your life ended now, God forbid.\n[01:11:05] >> Mhm.\n[01:11:06] >> Do do you think if you if you found out\n[01:11:07] today that it was ending, you would\n[01:11:09] reflect on it and say, do you know, I\n[01:11:10] think I might have had things in the\n[01:11:12] wrong order, would there be any mis\n[01:11:13] prioritization in hindsight if today was\n[01:11:15] the day? If life ended today,\n[01:11:19] I could cross my legs comfortably\n[01:11:22] and be okay.\n[01:11:25] That it's that it's time. I did it\n[01:11:28] correctly. I\n[01:11:31] made sure that I applied myself to the\n[01:11:34] best of my ability.\n[01:11:36] I tried my best to put those that I\n[01:11:38] loved in a better position so that they\n[01:11:41] could see more and do more.\n[01:11:44] My last name and my family name is much\n[01:11:48] stronger today than it was yesterday.\n[01:11:52] The idea of\n[01:11:55] the world is something that I was able\n[01:11:58] to see and understand better\n[01:12:01] because I was blessed and fortunate\n[01:12:02] enough to travel and meet so many\n[01:12:09] people\n[01:12:12] are made to like we're here to embrace,\n[01:12:15] we're here to love, we're here to like\n[01:12:17] share.\n[01:12:18] >> Mhm. [clears throat]\n[01:12:19] I was an energy source of good to bring\n[01:12:23] people closer together through all\n[01:12:24] things that I've done. So, it all\n[01:12:27] connects. And I'm okay.\n[01:12:29] I'm okay with if it stopped, it stopped.\n[01:12:35] What I'm what I'm not okay with is while\n[01:12:38] I have the bandwidth of good health,\n[01:12:42] [ __ ] great mind, strong\n[01:12:46] [ __ ] like mind concept and I can I\n[01:12:51] can go I can do it. I can get there.\n[01:12:54] I'm not okay with wasting that time.\n[01:12:58] I'm not okay with wasting my time of\n[01:13:02] good and I can do and I'm strong enough\n[01:13:05] to connect at a very high level. My star\n[01:13:09] is bright which allows me to go and get\n[01:13:12] into these spaces. If I wait for this to\n[01:13:14] dim out and I try to get into these\n[01:13:16] spaces, what if I can't?\n[01:13:17] >> Is there always a fear because of where\n[01:13:19] you came from that the stuff absolutely\n[01:13:20] might dim?\n[01:13:21] >> Absolutely. Like you you can't be\n[01:13:24] unrealistic.\n[01:13:25] Nothing is going to last forever.\n[01:13:28] nothing. I don't give a [ __ ] who you\n[01:13:30] are. I don't It's not true. You can\n[01:13:33] recreate and you can figure out ways to\n[01:13:36] find success again\n[01:13:38] and again,\n[01:13:40] but the one thing that you are winning\n[01:13:42] in, you're not going to win in it\n[01:13:44] forever, right? Like\n[01:13:47] I love talking about my guy man Hoveve\n[01:13:51] and Ruben, Michael Rubin. like\n[01:13:55] two great [clears throat]\n[01:13:56] friends but two good examples\n[01:13:59] of recreation\n[01:14:01] amplification\n[01:14:03] and step repeat right successful rapper\n[01:14:08] albums some albums hope will never make\n[01:14:10] again some will you don't look at them\n[01:14:13] all like they are all the best some you\n[01:14:15] think are better than others but the\n[01:14:18] fight to be the thing that you were when\n[01:14:22] it was at your highest\n[01:14:24] is a driving factor to get you. But then\n[01:14:26] as a talent, you you let go of that\n[01:14:28] because you become comfortable with\n[01:14:30] knowing that I'm never going to create\n[01:14:32] that again. That was my lightning in the\n[01:14:35] bottle moment. I'm never going to create\n[01:14:38] this again, but I can have fun doing\n[01:14:41] what I'm doing and I can create a\n[01:14:42] variation\n[01:14:44] of versions of this that still display\n[01:14:46] my talent and that I'm doing it at a\n[01:14:48] high level. Man, you know what? This\n[01:14:51] right here, it could cap out. But boy oh\n[01:14:54] boy, did I find [ __ ] momentum and now\n[01:14:58] the movies or in Ho's case is the\n[01:15:01] example I was using. He then found\n[01:15:02] momentum and well this thing, the\n[01:15:07] Rockefeller thing, him dame created this\n[01:15:10] thing and then the artists underneath\n[01:15:11] the thing and the progression of the\n[01:15:14] artist underneath that brand and started\n[01:15:16] to go bow pow Kanye bow state property\n[01:15:20] beanie seagull bow bow bow Rihanna all\n[01:15:22] these people bow now this thing was so\n[01:15:24] dope that we were able to create other\n[01:15:26] people that's more energy so now I don't\n[01:15:29] need the [ __ ] I don't need the\n[01:15:33] I'm looking at the product of a valuable\n[01:15:36] asset that we created that's premium\n[01:15:39] enough to display that the talent that\n[01:15:41] comes from underneath us\n[01:15:44] is strong [ __ ] talent and we do\n[01:15:46] amazing things. Now my business because\n[01:15:49] of this business well this business\n[01:15:51] becomes great too. Ace of spades and\n[01:15:53] deuce say and all oh [ __ ] the value the\n[01:15:56] exit the return he keeps finding more\n[01:15:59] energy in these other things. Mhm.\n[01:16:01] >> Oh [ __ ] 4040 club. More assets, more\n[01:16:06] brand, likeness, partnership, ownership.\n[01:16:10] But the backdrop to it all is the\n[01:16:12] artists.\n[01:16:14] Just give me 15 seconds to explain how\n[01:16:16] you can build a viable business online.\n[01:16:18] The people I see winning in life don't\n[01:16:20] have a perfect plan. They just take the\n[01:16:21] first step and then the next and then\n[01:16:23] they keep going. They stay obsessed and\n[01:16:24] they stay consistent. And Standstore, a\n[01:16:27] platform I co-own and one of our\n[01:16:29] sponsors, is the best first step to help\n[01:16:31] turn your knowledge into income. It only\n[01:16:33] takes a couple of minutes to launch your\n[01:16:35] business and start selling digital\n[01:16:37] products, coaching, memberships, or\n[01:16:38] communities online without any tech\n[01:16:41] headaches or endless setup. Thousands of\n[01:16:43] entrepreneurs, creators, and risktakers\n[01:16:45] use Stan to take control of their\n[01:16:47] future. Because Stan is for\n[01:16:49] entrepreneurs, for those willing to put\n[01:16:50] in the work and bet on themselves. If\n[01:16:53] you're ready to start building, join us.\n[01:16:55] Launch your business today with a free\n[01:16:57] 14-day trial at\n[01:16:59] stevenbartlet.stan.store.\n[01:17:03] Have you ever heard about this before?\n[01:17:04] This thing I'm holding in my hands now.\n[01:17:06] This is called ketone IQ. The website is\n[01:17:08] ketone.com. You've heard me on this\n[01:17:11] podcast talking about the fact that I\n[01:17:12] stay much of the year in a ketogenic\n[01:17:14] state, which is a highly restricted\n[01:17:16] diet. And the reason I do that is\n[01:17:18] plentifold. One of them is I spend hours\n[01:17:20] and hours talking to people for a\n[01:17:21] living. So, I want to make sure my brain\n[01:17:23] is firing in an optimal way. And the\n[01:17:25] other reason that I do the ketogenic\n[01:17:26] diet is because I just feel better. So,\n[01:17:30] when I discovered this, which is what\n[01:17:31] they call an exogenous ketone product\n[01:17:34] where you can drink it and it increases\n[01:17:36] your blood's ketone levels, I was blown\n[01:17:39] away. I contacted them, I met them, I\n[01:17:41] invested extremely heavily into their\n[01:17:43] company and I've become a co-owner of\n[01:17:45] the company accordingly and they sponsor\n[01:17:47] this show now. So, if you want to try\n[01:17:48] this out for yourself, I recommend you\n[01:17:51] try it. Just visit ketone.com/stephven\n[01:17:54] and you'll get 30% off your first\n[01:17:55] subscription order. You'll also get a\n[01:17:57] free gift with your second shipment.\n[01:17:59] That's ketone.com/stephven.\n[01:18:03] Your show is called Your New Well, it's\n[01:18:05] not new necessarily. I actually saw it\n[01:18:07] in in London. Me and my girlfriend were\n[01:18:09] were near the front row when you came\n[01:18:10] and did um acting acting my age in\n[01:18:13] London. The show was absolutely\n[01:18:15] hilarious and we were dying of laughter\n[01:18:17] and it's coming to Netflix Monday the\n[01:18:19] 24th of November. So\n[01:18:21] >> if you're listening now, you've got to\n[01:18:22] go and watch it. But the title of the\n[01:18:24] show,\n[01:18:24] >> acting my age,\n[01:18:26] >> what does what do you mean acting my\n[01:18:28] age? And why now?\n[01:18:29] >> Um, [snorts]\n[01:18:31] you know, you got to grow up.\n[01:18:34] I think it's like one of the\n[01:18:36] one of the toughest things\n[01:18:39] in life is just realizing\n[01:18:42] like what grow up actually means, right?\n[01:18:45] And like you can you can be an adult but\n[01:18:49] still not embrace\n[01:18:52] what being an adult actually is. And\n[01:18:56] when it's time to grow up, you start\n[01:18:59] sacrificing\n[01:19:01] the the [ __ ] that the younger version of\n[01:19:05] you with less responsibilities thrived\n[01:19:08] and flourished off of. And in you\n[01:19:12] realize that a lot of that [ __ ] gets\n[01:19:14] thrown on the back burner and is no\n[01:19:16] longer important because\n[01:19:20] you're [ __ ] getting older and some\n[01:19:22] [ __ ] just isn't isn't the same, right?\n[01:19:25] Like I just made a decision to let go of\n[01:19:28] a certain version of life and embrace my\n[01:19:32] age and all the fun that comes with it.\n[01:19:34] >> What about being a man? It's it's\n[01:19:36] confusing. I think it's more confusing\n[01:19:37] than ever for many to be a man. And we\n[01:19:39] often talk about this masculinity crisis\n[01:19:41] where men have less men male friends\n[01:19:44] than ever before. Um the stats are\n[01:19:46] pretty shocking on this. The suicide\n[01:19:48] suicidation is 300 to 400% higher in\n[01:19:51] men. There's a college degree gap. For\n[01:19:53] every two men who earn a bachelor's\n[01:19:55] degree in the women, three in the US,\n[01:19:57] three women do. There's a workforce\n[01:19:59] dropout rate, which is pretty\n[01:20:00] terrifying. Millions of prime age men\n[01:20:02] between the age of 24 and 50 are no\n[01:20:04] longer in the labor force, representing\n[01:20:06] an almost 10% drop.\n[01:20:08] >> Um, being a man is tough these days\n[01:20:12] >> for a bunch of different reasons.\n[01:20:14] >> You got a plethora\n[01:20:15] >> a plethora of it's it's not it's not\n[01:20:18] straightforward.\n[01:20:18] >> Yes. polluted waters is what I call it.\n[01:20:21] Extremely polluted waters.\n[01:20:24] >> What advice have you got for for young\n[01:20:26] men on in terms of like what it takes to\n[01:20:28] be a a good man?\n[01:20:29] >> You know, I think the definition of a of\n[01:20:33] a good man is so foggy today.\n[01:20:36] >> Mhm.\n[01:20:37] >> Right. [clears throat] And\n[01:20:39] I'm a firm believer that change comes\n[01:20:42] within time. [clears throat] So I'll\n[01:20:44] start by saying that and I understand\n[01:20:46] that you know\n[01:20:48] nothing should stay the same.\n[01:20:52] Everything should evolve\n[01:20:55] when it's evolving. The conversation of\n[01:20:58] a of a man and what makes a man a man is\n[01:21:01] weird. It's like\n[01:21:04] >> it's not evolving right. And you know, I\n[01:21:07] was raised on a foundation of\n[01:21:12] a leader or leadership. And I think, you\n[01:21:16] know, rest in peace to my dad.\n[01:21:20] It's [ __ ] up of a road that my dad\n[01:21:22] had.\n[01:21:24] My dad's like later years\n[01:21:29] were driven from accountability.\n[01:21:32] I'm aware of what I didn't do. I'm aware\n[01:21:35] of the mistakes that I made and I'm\n[01:21:37] aware of what I should have did much\n[01:21:39] better. I can't change those things, but\n[01:21:43] I would love to try to be the best\n[01:21:44] grandfather\n[01:21:46] or grandparent that I can be.\n[01:21:49] Kevin,\n[01:21:50] I love you and I love your brother, but\n[01:21:53] I can't go back. I can only say I'm\n[01:21:55] sorry\n[01:21:57] and I wish I could. You don't have to.\n[01:21:59] Like, the grandkids are your focus. And\n[01:22:01] if you can be the dopest example of a\n[01:22:04] grandpop to them,\n[01:22:06] then that's the win for me at this\n[01:22:08] point. But his accountability in that\n[01:22:11] moment is what I remember the most about\n[01:22:14] my father and love the most. Because\n[01:22:16] leadership or lack thereof\n[01:22:20] put me in a position to say I don't want\n[01:22:22] to do that.\n[01:22:24] I want to do\n[01:22:27] this. And not because my dad is like the\n[01:22:30] worst, but [ __ ] man, if he didn't do\n[01:22:32] these things wrong, back to tying [ __ ]\n[01:22:34] in, I wouldn't know how to do them\n[01:22:37] right. Mhm.\n[01:22:38] >> So now I got two boys. I want to make\n[01:22:42] sure that my example\n[01:22:44] of man to my to my sons, it's\n[01:22:47] leadership, responsibility,\n[01:22:50] it's accountability,\n[01:22:52] >> emotions,\n[01:22:53] >> you know, I'm not against emotions, but\n[01:22:55] but I am also I am a student of\n[01:23:01] everybody has problems.\n[01:23:04] Nobody there's not a shortage of\n[01:23:05] problems. So the weight of the world\n[01:23:08] that you feel is the heaviest for you\n[01:23:11] may not come close to what the weight of\n[01:23:13] the world is for you. And I think in\n[01:23:16] sharing your emotions and having an\n[01:23:20] opportunity to voice or offload them\n[01:23:23] extremely important but you also in a\n[01:23:27] world where you know weakness can at\n[01:23:30] some point in time be taken advantage\n[01:23:32] of. Right?\n[01:23:34] You are in a world of like prey and and\n[01:23:39] and and sharks as I presented earlier.\n[01:23:42] And it's it doesn't mean that your\n[01:23:44] emotions don't matter because they do.\n[01:23:47] It means that you also have to be smart\n[01:23:49] and aware, right? And what are you\n[01:23:52] ultimately trying your best to become?\n[01:23:56] And what are you ultimately trying to be\n[01:23:58] the best example for yourself first and\n[01:24:02] then others for?\n[01:24:04] I don't mind being weak, but I talk to\n[01:24:06] my kids. I talk to them in our voice.\n[01:24:09] Your dad deals with struggles that\n[01:24:11] you'll never know about because I don't\n[01:24:12] want you to have to feel the burden of\n[01:24:14] them. It's my job to try my best to make\n[01:24:17] life easier for you so that you can go\n[01:24:19] on and do way more than I ever have.\n[01:24:22] It's my job to give you the\n[01:24:24] opportunities to learn [ __ ] that I never\n[01:24:26] knew that I could learn at this stage.\n[01:24:28] But I'm going to make sure that I\n[01:24:29] communicate with you differently than I\n[01:24:30] was communicated with. I'm not going to\n[01:24:32] let you [ __ ] off or take advantage of\n[01:24:34] the things that you have as resources at\n[01:24:35] your fingertips. I'm not going to let\n[01:24:37] you tell me the things that you think\n[01:24:39] you should do because you feel when I\n[01:24:41] know right now at this stage in your\n[01:24:43] life what's best for you.\n[01:24:46] That's my format of parenting and it\n[01:24:48] doesn't mean it's the same for others.\n[01:24:51] But for the man that I am,\n[01:24:54] I know the type of man that I want my\n[01:24:55] kids to be based off of what my outcome\n[01:24:58] was and is. And I think that if I\n[01:25:02] correctly position them to simply\n[01:25:04] understand in your older age, you make\n[01:25:07] whatever decisions you want. I'm your\n[01:25:08] father. I'm gonna love you regardless.\n[01:25:10] Has no care worry to me. I want to know\n[01:25:14] that I did my job for what I was\n[01:25:16] supposed to control. And I want to know\n[01:25:18] that our conversations and our dialogue\n[01:25:21] was always straight up and\n[01:25:23] straightforward enough to where you were\n[01:25:24] comfortable to talk to me and you were\n[01:25:26] comfortable and feeling like your father\n[01:25:29] has your best interest. That's for me\n[01:25:32] that's my makeup. And in a time today,\n[01:25:37] my makeup doesn't have to fit yours. And\n[01:25:40] I'm okay with that. And I'm okay with\n[01:25:43] yours being whatever it is for you. But\n[01:25:46] I think we're in a time today where\n[01:25:48] society wants to fight with one another\n[01:25:49] about it's it's just too much of like,\n[01:25:52] well, if you don't see it my way, then\n[01:25:54] you're dumb.\n[01:25:55] >> Yeah.\n[01:25:55] >> And and that's I think that's why the\n[01:25:57] conversation has gotten so inconsistent\n[01:26:00] and polluted.\n[01:26:02] That's my personal opinion and my side\n[01:26:06] of information attached to it. So\n[01:26:08] hopefully, you know, your viewers can\n[01:26:09] hear that and understand that and know\n[01:26:11] it's okay with not being okay with my\n[01:26:13] choice.\n[01:26:14] >> Mhm.\n[01:26:15] That's okay.\n[01:26:17] >> Kevin, we have a closing tradition where\n[01:26:18] the last guest leaves a question for the\n[01:26:19] next, not knowing who they're leaving it\n[01:26:21] for. The question left for you is, what\n[01:26:23] is the advice you got as an adult that\n[01:26:25] had the most significant impact on your\n[01:26:30] life?\n[01:26:31] >> I'm going to go to best the best piece\n[01:26:33] of advice came from Chris Rock where\n[01:26:34] Chris Rock told me early in my comedy\n[01:26:36] career. He says his exact word is you\n[01:26:40] don't just want to make [ __ ] laugh.\n[01:26:43] the world is so much bigger than your\n[01:26:45] block or your neighborhood. He said,\n[01:26:48] \"Get out the country. Get out the\n[01:26:50] country and figure out a way to make the\n[01:26:53] world laugh and comedy will be so much\n[01:26:55] better.\"\n[01:26:58] At that point, I was very like specific\n[01:27:01] in my material.\n[01:27:03] 15, you know, we got these\n[01:27:07] the this drugstore is crazy. YOU EVER\n[01:27:10] HAD A GUY IN THE DRUGSTORE IN YOUR\n[01:27:11] BLOCK? AND IT'S LIKE, WELL, everybody\n[01:27:13] doesn't relate or can't relate. How do\n[01:27:16] you broaden it? How do you how do you\n[01:27:18] open it up so that you're never changing\n[01:27:20] your material or who you are? Everywhere\n[01:27:22] you go in the world, people can laugh\n[01:27:25] and you never have to adjust. Get out\n[01:27:28] the country.\n[01:27:30] Get bigger in the way you're thinking\n[01:27:32] about\n[01:27:34] your craft.\n[01:27:35] >> I mean, you've done that across the\n[01:27:36] board and across industries now. you've\n[01:27:38] been willing to be the person, the\n[01:27:40] outsider in lots of rooms. That seems to\n[01:27:43] be really central to your success. And\n[01:27:44] what Chris Chris Rock said to you there\n[01:27:46] was get out into the unfamiliar. Go put\n[01:27:48] yourself in an unfamiliar place. And\n[01:27:49] when I look at your career and the\n[01:27:50] empire that you've been able to build\n[01:27:51] across business and investing, it's\n[01:27:53] exactly that. It's you were willing to\n[01:27:54] be in unfamiliar territories for some\n[01:27:57] reason.\n[01:27:58] >> Yeah. Yeah. You know what you just made\n[01:28:00] me think about too and and I I want to\n[01:28:01] backtrack before we leave. One thing\n[01:28:03] that's like\n[01:28:05] kind of crazy just when you were talking\n[01:28:07] about the conversation of men, like it's\n[01:28:09] a weird thing that's happening where you\n[01:28:12] do have men that are opening up more and\n[01:28:14] talking more about like the struggles\n[01:28:16] >> Mhm.\n[01:28:17] >> of a man,\n[01:28:19] but then those things are like\n[01:28:21] being used against them in the\n[01:28:25] conversation of a man. Like when you get\n[01:28:28] to talking about like the things that\n[01:28:29] you're dealing with and the emotion and\n[01:28:31] stuff like of\n[01:28:32] >> the mental health\n[01:28:32] >> the mental health and the weight like it\n[01:28:35] seems that in this time today more men\n[01:28:37] are being forward and wanting to express\n[01:28:42] and talk but the fear of being judged\n[01:28:45] after.\n[01:28:46] >> Do you have that fear?\n[01:28:48] >> No, I don't I don't get [ __ ] I don't\n[01:28:49] really I don't really care too much what\n[01:28:51] people think.\n[01:28:51] >> Have you struggled with your mental\n[01:28:52] health?\n[01:28:53] >> No.\n[01:28:54] >> No. I think I told you my [ __ ] is like\n[01:28:56] more more stress. It's not a struggle.\n[01:28:59] It's like\n[01:29:00] >> Is that anxiety or is it is it\n[01:29:01] >> No, just like I know I do too much.\n[01:29:04] >> Yeah.\n[01:29:04] >> Like I know I know I know for a fact.\n[01:29:07] >> What's the symptom of that? How do you\n[01:29:08] feel? Like\n[01:29:09] >> you have to like you have to shut down.\n[01:29:11] So like what I'm getting better at is in\n[01:29:13] a day there's time I just don't I'm off\n[01:29:16] the phone. I got it. I know I told him I\n[01:29:18] would do calls. Just tell them I'll\n[01:29:20] start that tomorrow or the day after.\n[01:29:22] But like there's a there's a time where\n[01:29:25] I get to a point in the day where I'm\n[01:29:26] like, \"Okay, that oh that's it for me.\n[01:29:28] >> You're done.\n[01:29:28] >> That's my Yeah. Like and I'm I'm\n[01:29:30] literally I'm done. I don't want to I\n[01:29:32] don't want to talk about anything else.\n[01:29:34] I don't want to I don't want to hear.\"\n[01:29:35] >> So you're pushing yourself right up to\n[01:29:37] the edge over and over and over and over\n[01:29:38] again.\n[01:29:39] >> I get to a a point in a day and that\n[01:29:41] timeline of when I'm shutting off has\n[01:29:44] gotten earlier and earlier, whereas\n[01:29:47] before it was, you know, we hours of the\n[01:29:48] night and I'm still on the phone\n[01:29:50] figuring it out. and all day you just\n[01:29:52] been racing and racing and racing. So I\n[01:29:54] think the older that I've gotten. I've\n[01:29:57] realized more and more that's not\n[01:29:59] healthy.\n[01:30:01] The healthy side comes with silence for\n[01:30:04] a sec. Like you need you need some you\n[01:30:06] need some silence. A ride in a car by\n[01:30:09] yourself, no music.\n[01:30:11] >> Sounds a bit like a disease.\n[01:30:13] >> No, you need silence.\n[01:30:14] >> Do you know what I mean by it sounds a\n[01:30:15] bit like a disease? Because this is\n[01:30:16] something that's taking you to a point\n[01:30:18] where it's like it's kind of hurting you\n[01:30:19] a little bit. and I can relate. So, it's\n[01:30:21] not like I'm like passing judgment\n[01:30:22] because you just described my entire\n[01:30:24] life.\n[01:30:24] >> Um, you're not going to be as present\n[01:30:26] with your loved ones. You're not going\n[01:30:27] to be as present in your relationship. I\n[01:30:28] know you're married. Um, you've got four\n[01:30:30] kids. How how are you ever going to be\n[01:30:32] like truly present when your brain is\n[01:30:34] like,\n[01:30:34] >> \"Yes,\n[01:30:36] but also, how do you how do you become\n[01:30:39] comfortable with being okay with people\n[01:30:42] not understanding?\"\n[01:30:44] That's the trick. Like, I I hate to say\n[01:30:47] it bluntly.\n[01:30:48] >> Yeah. I used to have such a high level\n[01:30:50] of give a [ __ ] attached to how you felt\n[01:30:51] about my decisions that were best for\n[01:30:53] me. Oh god, I don't want to say cuz\n[01:30:56] they're going to feel like I'm not doing\n[01:30:57] it's going to be crazy. I don't [sighs]\n[01:30:59] I'll just do it\n[01:31:02] because I'm thinking more about you than\n[01:31:04] I'm thinking about me, right? I'm\n[01:31:06] putting everybody before me. I'm putting\n[01:31:09] everybody's needs, everybody's wants,\n[01:31:11] everybody's reasons all before me.\n[01:31:14] Nobody is thinking about the volume of\n[01:31:17] dialogue\n[01:31:19] that I'm delivering on a day-to-day\n[01:31:21] basis\n[01:31:22] and how much of that like happens over\n[01:31:26] and over again. Nobody's thinking about\n[01:31:28] it. So the day that I became comfortable\n[01:31:31] with going I don't really give a [ __ ] if\n[01:31:34] like they understand or not. Like I'm\n[01:31:35] done. I know but they feel it's really\n[01:31:37] important. You got to do it today. I'll\n[01:31:39] talk to them tomorrow. Nothing's going\n[01:31:40] to happen. Nothing's going to change\n[01:31:42] from this time to that time. You have to\n[01:31:44] get to a point to where you actually get\n[01:31:46] that and are okay with that because if\n[01:31:50] not, you're constantly putting all of\n[01:31:53] the [ __ ] from outside there on your\n[01:31:56] table and like your plate's always full.\n[01:31:59] You're never finishing your [ __ ]\n[01:32:01] plate because you're just constantly\n[01:32:02] people just keep coming and dumping more\n[01:32:04] [ __ ] on it. So imagine that. Imagine\n[01:32:06] people just keep telling you keep\n[01:32:07] eating. You just keep getting full. like\n[01:32:09] eventually you can't [ __ ] breathe and\n[01:32:12] you bust. It's no different from your\n[01:32:14] from your mind. And and and more today\n[01:32:18] than ever, you're seeing more people pop\n[01:32:22] from mental overload, man. Like people\n[01:32:25] aren't crazy. I hate the like this whole\n[01:32:28] crazy. You crazy [ __ ] You\n[01:32:29] crazy. It's like [ __ ] are just\n[01:32:31] popping like it's too much and they\n[01:32:34] [ __ ] when they snack they snap.\n[01:32:36] That's it. That's not what I'M SAYING.\n[01:32:37] I'M [ __ ] I'M SICK a check like\n[01:32:40] goddamn man you crazy. No, you're not.\n[01:32:42] [ __ ] just popped.\n[01:32:43] >> But you could you got the money to go\n[01:32:45] chill in Bali.\n[01:32:46] >> I'm going I I\n[01:32:47] >> But but you don't\n[01:32:48] >> I have the money to not go chill in\n[01:32:50] body. I have the money to say I'm not\n[01:32:52] talking anymore today.\n[01:32:54] That's the That's the difference. It's\n[01:32:56] not about the vacation. It's not about\n[01:32:57] the trip. It's not about I'm not talking\n[01:33:00] anymore today. So the people and the\n[01:33:03] resources that I put around me to help\n[01:33:04] me do your job. What happens next for\n[01:33:07] you? We sit here in 10 years time, it\n[01:33:09] all went well. What happened?\n[01:33:10] >> I think in 10 years time, if I'm able to\n[01:33:15] sit on a stool\n[01:33:17] at a comedy club with 30 people and do\n[01:33:22] material and enjoy my craft,\n[01:33:26] and it's little small hole-in-the-wall\n[01:33:28] comedy clubs, wherever I'm living at the\n[01:33:30] time, and I do it maybe twice a week.\n[01:33:33] and I golf. Uh, and I spend time with my\n[01:33:37] kids and hopefully their kids and I'm a\n[01:33:40] grandpop and we're able to like look\n[01:33:43] through photo albums of remember when\n[01:33:45] and\n[01:33:47] mailbox money is attached to things that\n[01:33:49] I've built that are operating and\n[01:33:51] functioning on its own.\n[01:33:53] That's\n[01:33:55] that's my version [clears throat] of\n[01:33:58] success.\n[01:33:59] >> Kevin, thank you.\n[01:34:00] >> Thank you, man. Thank you so much for\n[01:34:01] all the um you talked about how you've\n[01:34:03] made people's lives happier and uh made\n[01:34:06] people more connected etc. And that's\n[01:34:07] exactly the impact you've had on me. I\n[01:34:09] remember the first time I I watched one\n[01:34:11] of your uh comedy specials and watched\n[01:34:13] you on stage was when I was going\n[01:34:14] through a very tough part of my life. I\n[01:34:16] was lonely. I was in this room in\n[01:34:17] Manchester. I'm probably 18 years old at\n[01:34:18] the time and I'm trying to figure out my\n[01:34:21] career and my future and things are hard\n[01:34:22] and I think like pirating your pirating\n[01:34:26] your comedy specials was that little\n[01:34:28] moment of escapism. It was that little\n[01:34:30] moment of joy in my day and so you're\n[01:34:32] that for so many many millions of people\n[01:34:33] that you'll never get to meet. You\n[01:34:35] brought so much joy to families. You\n[01:34:36] brought families together. You brought\n[01:34:37] me and my girlfriend out to come and see\n[01:34:39] you in the Royal Albert Hall and also\n[01:34:40] I've seen you in New York City when you\n[01:34:41] did I think it was Madison Square Garden\n[01:34:43] here as well on that square stage. It's\n[01:34:46] you're a source of joy and connectivity\n[01:34:48] and if the world ever needed that energy\n[01:34:51] right right now, um it needs it now more\n[01:34:53] than ever.\n[01:34:55] >> I humbly appreciate you and thank you.\n[01:34:58] Uh this was amazing, man. And I and I\n[01:35:00] think you're doing a service of good and\n[01:35:03] what you're providing for the masses is\n[01:35:06] is necessary. So don't stop. Keep going,\n[01:35:08] man.\n[01:35:09] >> Thank you so much. All right.\n[01:35:10] >> Thank you so much. Appreciate it,\n[01:35:11] brother.\n[01:35:12] >> [music]\n[01:35:14] >> Make sure you keep what I'm about to say\n[01:35:16] to yourself. I'm inviting 10,000 of you\n[01:35:19] to come even deeper into the diary of a\n[01:35:20] CEO. Welcome to my inner circle. This is\n[01:35:24] a brand new private community that I'm\n[01:35:26] launching to the world. We have so many\n[01:35:27] incredible things that happen that you\n[01:35:29] are never shown. We have the briefs that\n[01:35:32] are on my iPad when I'm recording the\n[01:35:33] conversation. We have clips we've never\n[01:35:35] released. We have behindthe-scenes\n[01:35:37] conversations with the guests and also\n[01:35:38] the episodes that we've never ever\n[01:35:40] released. and so much more. In the\n[01:35:44] circle, you'll have direct access to me.\n[01:35:46] You can tell us what you want this show\n[01:35:47] to be, who you want us to interview, and\n[01:35:49] the types of conversations you would\n[01:35:50] love us to have. But remember, for now,\n[01:35:53] we're only inviting the first 10,000\n[01:35:55] people that join before it closes. So,\n[01:35:57] if you want to join our private closed\n[01:35:59] community, head to the link in the\n[01:36:00] description below or go to\n[01:36:01] daccircle.com.\n[01:36:04] I will speak to you then.\n[01:36:08] Heat. Heat. [music]\n[01:36:17] [music]\n[01:36:23] [music]\n[01:36:25] [singing]\n[01:36:28] >> [music]",
  "transcript_source": "youtube_captions",
  "has_timestamps": true
}