{
  "video_id": "xDQyLnNAXr4",
  "channel": "The Diary Of A CEO",
  "channel_slug": "the-diary-of-a-ceo",
  "title": "Secret Service Agent: How To Stay In Control When Someone Is Trying To Manipulate You!",
  "date": "2025-12-01",
  "upload_date": "20251201",
  "duration": 4884,
  "url": "https://www.youtube.com/watch?v=xDQyLnNAXr4",
  "chapters": [],
  "transcript": "[00:00] I've got a difficult conversation I want\n[00:01] to have with someone and they might be a\n[00:03] narcissist.\n[00:03] >> So, let's stop there because if you just\n[00:05] blatantly label somebody as being a\n[00:07] narcissist, you're not going to be able\n[00:09] to really understand who this person is\n[00:11] and and why they are the way they are.\n[00:13] But when you need to go into a dark\n[00:14] conversation to [music] make things\n[00:15] simple, there are four things that you\n[00:17] can do because we all have those\n[00:18] conversations. We have a supervisor who\n[00:20] we feel is overlooking us in a\n[00:21] promotion, maybe our spouse we got in a\n[00:23] fight with, a friend who's betrayed us,\n[00:25] and they're cloaked in so much emotion\n[00:26] or so much tension that you don't know\n[00:28] how to handle that. But there's also\n[00:30] three things that you should stop doing,\n[00:32] such as stop telling people you\n[00:33] understand.\n[00:34] >> Telling them you understand.\n[00:35] >> Yep. Why?\n[00:35] >> This is what we're going to talk about.\n[00:37] >> For over 30 years, former Secret Service\n[00:39] agent Desmond O'Neal has used\n[00:40] sciencebacked interrogation techniques\n[00:42] against some of the world's biggest\n[00:44] liars.\n[00:44] >> He's trained elite teams from the FBI to\n[00:46] the CIA. And now, in his first public\n[00:49] conversation, he's [music] laying out\n[00:50] the frameworks you need to communicate\n[00:51] effectively, how to lead,\n[00:52] >> and how to get anyone to open up. When\n[00:54] it comes to being able to communicate\n[00:56] with somebody, the victory lies in the\n[00:58] little things that you do. So, you need\n[00:59] to have a plan. P is for purpose. So,\n[01:02] why are you there? What is the goal of\n[01:04] the conversation? Because especially in\n[01:05] emotional conversations, it becomes\n[01:07] really easy to get distracted. And if\n[01:09] you lose your cool, you lose control.\n[01:12] And then there's the A is to ask.\n[01:13] Because most of us think we know what\n[01:14] our partner is thinking, right? But the\n[01:16] research shows we're only accurate about\n[01:17] 40% of the time. And if that\n[01:19] conversation gets emotional, that 40%\n[01:21] can go down as low as 15. It's called\n[01:23] empathy accuracy. And so the power of\n[01:25] asking questions is important, but when\n[01:28] you fail to do that, you are going to\n[01:29] have a really hard time having a deep,\n[01:31] honest relationship with somebody. And\n[01:33] then there's the L and the N, which most\n[01:34] people do wrong, and we'll go into that.\n[01:36] >> And then what about body language? Can\n[01:37] you tell if I'm being deceptive by how\n[01:39] much I look at someone?\n[01:40] >> So there's a few indicators of somebody\n[01:42] telling the truth, and we'll talk about\n[01:43] them.\n[01:43] >> And what about leadership principles?\n[01:45] >> So I learned the true essence of\n[01:47] leadership when I was on a SWAT team\n[01:49] from situations like when you're hunting\n[01:50] someone and they're hunting you as well.\n[01:52] So, let's get into the details.\n[01:55] >> I see messages all the time in the\n[01:56] comments section that some of you didn't\n[01:58] realize you didn't subscribe. So, if you\n[02:00] could do me a favor and double check if\n[02:01] you're a subscriber to this channel,\n[02:03] that would be tremendously appreciated.\n[02:04] It's the simple, it's the free thing\n[02:06] that anybody that watches this show\n[02:07] frequently can do to help us here to\n[02:09] keep everything going in this show in\n[02:11] the trajectory it's on. So, please do\n[02:13] double check if you've subscribed and uh\n[02:15] thank you so much because in a strange\n[02:16] way, you are you're part of our history\n[02:18] and you're on this journey with us and I\n[02:20] appreciate you for that. So yeah, thank\n[02:22] you [music]\n[02:26] >> Desmond O'Neal. For those people that\n[02:29] have just clicked onto this\n[02:30] conversation,\n[02:31] what are they going to walk away from\n[02:33] our discussion with? So I've been in law\n[02:37] enforcement for 30 years and I've served\n[02:40] a lot of different roles in that. And\n[02:43] above everything else, the one thing\n[02:45] that I've learned is when stress is\n[02:49] high, when emotions are strong, when it\n[02:53] matters, how do you authentically\n[02:54] connect and communicate with somebody\n[02:56] else? There's something to be said about\n[03:00] when a conversation is easy, right? When\n[03:02] it's fun, when everybody wants to be\n[03:05] there, you can focus on your handshake.\n[03:07] You can focus on the eye contact, how\n[03:09] great your posture is. What about the\n[03:12] dark conversations? What about those\n[03:14] conversations that kind of they live in\n[03:16] the shadows of your mind because you\n[03:17] don't want to face them. You don't want\n[03:18] to have those, right? They're they're\n[03:20] cloaked in so much emotion or so much\n[03:22] tension that you just you don't know how\n[03:25] to handle that. We all have that, right?\n[03:26] We have a supervisor who we feel is\n[03:29] overlooking us in a promotion. We have,\n[03:31] you know, a family member who we feel\n[03:33] that we're just no longer getting along\n[03:34] with. Maybe our spouse we got in a fight\n[03:36] with. Maybe a friend who's betrayed us.\n[03:39] So, how do you have that conversation?\n[03:42] Like, what does that look like? Because\n[03:44] it comes from,\n[03:46] you know, for the 30 years that I've\n[03:48] been doing this, most of the people that\n[03:50] I talked to didn't want to talk to me.\n[03:52] And my job was to connect with them, to\n[03:56] find a way to get them to open up, to\n[03:59] find a way to have some type of\n[04:00] understanding and get the information\n[04:02] that I needed. So, this is not about\n[04:04] interview or interrogation. This is this\n[04:07] is human connection. If your audience\n[04:09] cares to understand how to have a dark\n[04:13] conversation where you can deepen that\n[04:17] relationship or at least come to some\n[04:19] type of understanding or at the very\n[04:22] least not walk away ruminating on\n[04:26] everything you said trying to figure out\n[04:28] what went wrong, what could you have\n[04:30] done different? If you've had that and\n[04:32] you're interested in knowing, then this\n[04:33] is this is where we're going to talk\n[04:34] about that. And to summarize in I guess\n[04:37] 30 seconds why you're the guy that is\n[04:40] best placed to deliver this information,\n[04:42] what is what are the reference points,\n[04:43] the experiences, the the variety of\n[04:45] experience you've had that feeds into\n[04:48] the answers and the actionable advice\n[04:50] you want to give my audience?\n[04:51] >> My initial career started as a\n[04:53] corrections officer, became a police\n[04:55] officer and I was a SWAT officer as\n[04:57] well. From there I went to the federal\n[04:58] government. So I went to the secret\n[05:00] service. Uh with the secret service I\n[05:01] also started a polygraph career. So now\n[05:04] I have people that are giving me their\n[05:06] deepest, darkest secrets.\n[05:08] >> And just for context, polygraphing is a\n[05:11] lie detection test.\n[05:12] >> Polygraph is a lie detection test. So it\n[05:14] gives you a psychological or a\n[05:16] physiological response in terms of how\n[05:18] somebody answers a particular question.\n[05:20] >> Where else did your career take you\n[05:22] after that point?\n[05:23] >> I went into internal affairs and so that\n[05:27] is now policing the people within our\n[05:30] organization. So now I'm talking to men\n[05:32] and women who have had some of my\n[05:34] interrogation training. They kind of\n[05:35] know the questioning going on. They know\n[05:37] the interaction. They've done themselves\n[05:39] interviews and interrogations.\n[05:41] >> Oh, okay. So this is law enforcement\n[05:44] officers who have committed a crime or\n[05:47] some kind of mis issue or been reported\n[05:49] for something and your job is to\n[05:51] investigate them.\n[05:52] >> Yes. But think about that for a minute.\n[05:55] like you're now talking to somebody else\n[05:56] who, you know, maybe a year ago you were\n[05:59] out in the street doing work with and\n[06:01] now you're asking them these questions\n[06:04] or these for clarification on some type\n[06:06] of allegation.\n[06:08] You got to be you got to be mindful with\n[06:09] that. Like that's a big deal.\n[06:11] >> And the the interview methods that were\n[06:14] prevalent at that time you felt were\n[06:16] outdated.\n[06:18] >> They were. So there is in the US there's\n[06:20] a very historical evolution of interview\n[06:23] and interrogation. You know, it started\n[06:25] in the 1900s when policing came in. In\n[06:27] that circumstance, it was physical\n[06:29] abuse. They called it the third degree\n[06:31] where you would go in and, you know,\n[06:33] people would grind down your teeth or\n[06:34] they would cause pain for you to talk to\n[06:36] them.\n[06:36] >> As we've evolved as a society, that\n[06:40] started to go away in lie of\n[06:43] psychological manipulation. So, it was\n[06:44] less about hands-on and more about\n[06:47] trying to get people to talk to you from\n[06:49] a psychological perspective. And right\n[06:52] about 2014 when I went into\n[06:56] internal affairs, I was like, Stephen, I\n[06:58] was like, I just there's got to be\n[07:00] something different. Like, we've had to\n[07:02] evolved in some way in terms of what\n[07:04] that is. And so, you know, you have my\n[07:06] thesis there, right? Right about that\n[07:08] time, I was accepted into the Naval\n[07:12] Postgraduate School to pursue a masters.\n[07:14] And because I was looking for a better\n[07:17] way to interview, one of my thesis\n[07:20] advisors said, \"Hey, have you ever heard\n[07:21] of the highvalue detainee interrogation\n[07:24] group, which the acronym is HIG?\" Had\n[07:26] never heard of it, but the HIG when it\n[07:28] was created\n[07:30] was was three-prong, meaning that it had\n[07:33] a a research department, right? And it\n[07:36] had a practitioner department, so the\n[07:38] people that would do the the the\n[07:40] interrogations. And then it had a\n[07:41] trainer department. Now the trainer\n[07:43] department, we would do interviews,\n[07:45] interrogations, but we also understood\n[07:46] the science behind that. The reason\n[07:49] that's important is because you could be\n[07:51] a really good practitioner\n[07:53] and not understand why something is or\n[07:55] isn't working. And so being able to\n[07:58] cross the bridge between the the science\n[08:01] and understanding that and being able to\n[08:03] apply it in the room, that hybrid, that\n[08:06] connection, that sweet spot, that is\n[08:08] what I did. So, you did research and you\n[08:11] continue to do research on how to get\n[08:13] people to give information, how to get\n[08:16] information from people, how to get them\n[08:18] to offer up information. Is that the\n[08:20] crux of it?\n[08:20] >> Yeah.\n[08:21] >> So, if I'm, you know, I've got a\n[08:23] difficult conversation I want to have\n[08:24] with someone, this person is\n[08:26] antagonistic, they often gaslight me,\n[08:29] they might be a narcissist, and I'm\n[08:31] walking into that conversation or, you\n[08:32] know, I'm overthinking it. I'm thinking,\n[08:33] \"God, I need to have this conversation.\"\n[08:36] Where's the first place to start? So the\n[08:38] first place that I would start is don't\n[08:40] label the people how you just label\n[08:41] them.\n[08:42] >> Okay.\n[08:42] >> And that's a problem. So you just\n[08:44] labeled somebody a narcissist. Why does\n[08:45] that matter to you?\n[08:47] >> I think it allows me to blame them. I\n[08:48] guess\n[08:49] >> allows you to blame but but tell me tell\n[08:51] me in your perspective what's a\n[08:52] narcissist?\n[08:53] >> That they are they are low empathy. They\n[08:56] are self-centered. They are a little bit\n[08:58] aggressive maybe.\n[08:59] >> Okay. So let's stop there. Do you think\n[09:02] personally that there are times in your\n[09:04] life where you lack empathy?\n[09:06] >> Yeah.\n[09:06] >> Okay. So empathy is very situationally\n[09:09] based. So meaning that it's also\n[09:12] subjective. Meaning if you feel this\n[09:13] person is not giving you certain\n[09:14] empathy, okay, maybe um a bit\n[09:18] self-centered, a bit aggressive, you the\n[09:20] reason I ask you these things is because\n[09:22] if you just blatantly label somebody as\n[09:24] being like this person's a narcissist,\n[09:26] you've just you've just made it easy for\n[09:28] yourself. You've just put blame on them\n[09:30] and you're not going to be able to\n[09:32] really understand who this person is and\n[09:34] and why they are the way they are. So\n[09:36] the first thing that I would do is I\n[09:37] would take away the labels as how you\n[09:40] define them as you're going into that.\n[09:42] What was the other thing you said in\n[09:43] terms of what they were? They were\n[09:44] narcissists. They were something else.\n[09:45] >> Um they gaslight.\n[09:48] >> So second thing uh which is interesting\n[09:50] because we actually within our training\n[09:52] uh program we just did a big class on\n[09:54] gaslighting because it's important to\n[09:56] understand\n[09:57] what is gaslighting and what when is it\n[10:00] not gaslighting. So for you cuz you said\n[10:03] this person gaslights you. What is What\n[10:04] are they gaslighting you about?\n[10:07] >> Um, when I bring something up, they make\n[10:10] me feel like\n[10:12] I'm to blame. When I when I bring up how\n[10:14] I feel, maybe they make me feel like I'm\n[10:16] to blame, like I did something wrong.\n[10:18] >> Okay. Does that always happen?\n[10:21] >> More often than not.\n[10:22] >> Okay. More often than not. So, it's\n[10:23] something that it sounds like that when\n[10:25] you go in and you're talking to this\n[10:27] different person, whatever the\n[10:28] circumstances is, they are they're\n[10:30] trying to discredit you or make you feel\n[10:32] like maybe you don't know really what\n[10:33] happened.\n[10:34] >> They're not listening. They're just\n[10:35] always throwing it back on me, saying\n[10:36] that I did something to deserve it.\n[10:38] >> And what was the third thing you said?\n[10:40] >> A little bit like aggressive,\n[10:41] antagonistic. So,\n[10:42] >> okay.\n[10:43] >> Their their emotions go up and it kind\n[10:45] of makes me shut down.\n[10:46] >> Okay.\n[10:47] >> They kind of flood the zone. So, when\n[10:48] you need to go into a dark conversation,\n[10:50] here are the four things that you can do\n[10:53] to stay engaged and involved in in in\n[10:56] what's about to happen, right? And in\n[10:58] how this is going to hopefully go\n[11:00] through. And what we say is you need to\n[11:03] have a plan. And there's the acronym\n[11:05] about that, P, right? L A N. So, the P\n[11:09] is for purpose.\n[11:11] And the purpose is why are you there?\n[11:14] What's the reason? What's the mission?\n[11:17] You have to understand your mission\n[11:19] because your mission is going to drive\n[11:20] your tactics. Your mission is going to\n[11:21] determine if things get off track. If\n[11:25] this person becomes aggressive, this\n[11:26] person starts to be insulting. If my\n[11:28] mission at that moment is to deepen my\n[11:30] conversation with them and deepen my\n[11:32] relationship in some way, and this\n[11:34] starts to get ugly in the middle, your\n[11:36] mission should keep you on track because\n[11:37] you can get pulled from that very\n[11:39] quickly. There's something called\n[11:40] multiple goals theory. And multiple\n[11:43] goals theory is the understanding that\n[11:45] at any given time we will pursue\n[11:48] simultaneous goals. And typically those\n[11:51] goals would be something task oriented.\n[11:53] You know I want to I want to finish a\n[11:55] tasking. I want to get something done.\n[11:57] There's going to be a component of\n[11:58] identity in there meaning that how do I\n[12:00] feel? What are my emotions going on\n[12:02] during the course of this? And then\n[12:04] there's going to be relational. So it's\n[12:05] going to be my relationship with this\n[12:07] person at the time. Now, a lot of times\n[12:10] within multiple goals theory, those\n[12:12] things can align. So, and I'll give you\n[12:15] example like if you're playing a sport,\n[12:16] you're on a team. Uh the team goal, your\n[12:19] goal within that team, the task is to\n[12:21] win, to put on more points than the\n[12:23] other person. That's the task. The\n[12:26] identity aspect of that is am I a good\n[12:28] player? Do do I want the ball? Do I get\n[12:30] the ball? Am I contributing? Am I the\n[12:32] superstar? Is there some type of\n[12:34] identity and how this makes me feel\n[12:36] about myself being being a sports star\n[12:39] in some capacity? And the relationship\n[12:41] part of that is\n[12:43] how do my teammates feel about me? Am I\n[12:45] inter am I a good teammate in terms of\n[12:47] what that was? Those things can align.\n[12:49] You can see when that is misaligned when\n[12:51] all of a sudden somebody what they would\n[12:52] call a ball hog, somebody takes the shot\n[12:54] all the time or they won't pass it\n[12:55] around and you're like\n[12:56] >> Ronaldo,\n[12:57] >> what are you doing? Right? And it's one\n[12:58] of these things where like you are more\n[13:00] concerned about your identity than you\n[13:02] are about the team winning. That's a\n[13:03] problem. That's when you can see there's\n[13:05] a misalignment of goals. Or something\n[13:07] that's even more simple would be let's\n[13:10] say you're in a meeting with uh a boss\n[13:13] or a colleague and it's a pretty\n[13:14] important meeting. You're you're trying\n[13:15] to close a deal and your boss says\n[13:19] something that's wrong. Now\n[13:22] you have to make a decision. You could\n[13:24] either correct your boss in front of\n[13:27] everybody or you could preserve his or\n[13:30] her dignity and address them at a later\n[13:33] time. You have to decide which one of\n[13:34] those is most important. You have to\n[13:36] understand your purpose of being in that\n[13:38] meeting because maybe I could let this\n[13:40] go. It's not that big of a deal because\n[13:42] if I correct my boss, this may affect my\n[13:44] relationship with them at a later time.\n[13:46] This could ruin my career in terms of\n[13:48] being transferred or or not being on a\n[13:50] project. So when you're looking at\n[13:52] goals, you have to understand what the\n[13:55] overall objective is. It becomes\n[13:57] Stephen, it becomes, especially in\n[13:58] emotional conversations, it becomes\n[14:00] really easy to to get distracted. Really\n[14:03] easy.\n[14:04] >> So I go into that conversation with my\n[14:05] colleague who is problematic. My goal\n[14:08] with them, let's say, is to get them to\n[14:09] stop. I'm actually thinking about\n[14:11] earlier in my career when I used to work\n[14:13] in call centers on the phone and um\n[14:16] [clears throat] there was one particular\n[14:17] lady that sat next to me that was always\n[14:19] a little bit rude and always put me down\n[14:20] a little bit bit patronizing. So I I in\n[14:24] hindsight wish I could have you know\n[14:26] taken her aside and had a conversation\n[14:28] with her and said listen the way you're\n[14:29] speaking to me is very disrespectful or\n[14:31] you're putting me down or patronizing\n[14:32] me. Please can you stop doing that? My\n[14:34] goal would have been to to get her to\n[14:35] stop.\n[14:36] >> It is to get her to do that, but the\n[14:38] crux of that is to understand why she's\n[14:39] doing it because that's going to allow\n[14:41] me to fix this in some way if it if it's\n[14:44] fixable. I I'll share the story with\n[14:46] you. In 1991,\n[14:49] an 11-year-old girl named JC Duggard was\n[14:52] kidnapped by a man named Philip Gerrio\n[14:54] and his wife Nancy. And Philip and Nancy\n[14:57] kept JC Duggard for 18 years. He\n[15:01] fathered two children with her. One when\n[15:03] she was 14 and one when she was 17. And\n[15:06] in 2009,\n[15:08] they found her and him at Berkeley. They\n[15:10] arrested him, arrested his wife. 2011,\n[15:14] he was, you know, tried, convicted.\n[15:16] Three years prior to that,\n[15:19] there was a young girl named Michaela\n[15:21] Garrett who had gone missing, never been\n[15:24] found in a county over west of Elorado\n[15:27] in a county named Alama County. There\n[15:30] was a lot of suspicion that Philillip\n[15:32] was the one who did this as well. And\n[15:34] one of my one of my colleagues was the\n[15:37] prosecuting attorney for Elorado County,\n[15:39] California. His name is Vern Pearson.\n[15:41] And Vern said, I'd like to close this or\n[15:44] get some type of understanding. Can you\n[15:46] go and interview Philip? So I looked at\n[15:50] all the information on Philip. He had\n[15:51] written a manifesto in terms of how to\n[15:53] cure pedophilia. And I went to Vern. I\n[15:56] said, \"All right, I'm let's go do this\n[15:57] and he goes, \"What do you need like a\n[15:59] day, a couple of hours?\" And I said, \"I\n[16:01] need four days.\" And my goal was to do a\n[16:04] deep dive into the things that he had\n[16:06] done. He was a a serial rapist, uh, a\n[16:09] serial kidnapper, and to understand his\n[16:12] life in the time frame by which Michaela\n[16:15] Garrett went missing. And so this was\n[16:16] the evolution of what I was trying to\n[16:18] do. So I show up, he walks in, says,\n[16:20] \"Who are you?\" I said, \"Well, I'm\n[16:22] special agent O'Neal. I'd like to talk\n[16:24] to you about um your history. I read\n[16:27] your manifesto and I had some questions.\n[16:29] And he said,\n[16:31] you know, uh, when they told me I had a\n[16:33] visitor, he goes, I wasn't going to come\n[16:34] in. He goes, but the angels on my\n[16:36] shoulder tell me that this would be a\n[16:37] good good talk. So he said, let's do it.\n[16:40] We talked in detail every day for\n[16:42] probably 8 to nine hours. They brought\n[16:43] him food. And the end of each day, I\n[16:46] would say, Phillip, um, I will be here\n[16:48] tomorrow. If the if the angels on your\n[16:51] shoulder tell you to show up, please do.\n[16:52] If not, then it was nice to meet you.\n[16:54] And every day he showed up. Why did you\n[16:56] say that?\n[16:57] >> There there's a there's a depth of\n[16:59] understanding in terms of the headsp\n[17:00] space that he is in. And so when you can\n[17:02] connect like genuinely connect with that\n[17:05] you you truly try to understand another\n[17:06] person and [snorts]\n[17:09] there's power with that in the course of\n[17:11] those 36 hours. Multiple times he was\n[17:15] very aggressive. He was very\n[17:18] condescending. He called me a liar.\n[17:20] Things he accused me of you. I don't\n[17:22] believe you are who you say you are. I\n[17:24] don't believe you're here for the things\n[17:25] you're saying you're here for. Um I\n[17:27] don't even know if he worked for the\n[17:28] federal government. And he's essentially\n[17:30] questioned my integrity. Now, my purpose\n[17:35] is not to make him feel that I'm smarter\n[17:37] than him. Is not to\n[17:41] belittle or berate him or or have a a\n[17:44] question of, you know, integrity. Cuz I\n[17:45] could have said, \"You kidnapped an\n[17:48] 11-year-old girl and kept her captive\n[17:49] for 18 years, fathered two children with\n[17:51] her, the first one at the age of 14.\"\n[17:53] and your question of my integrity. I\n[17:55] didn't do that because that's not why I\n[17:58] was there. And so despite the fact that\n[18:00] he got upset, despite the fact that he\n[18:02] called me and accused me of all these\n[18:03] different things, I stayed on my\n[18:05] purpose. I stayed on my mission. And\n[18:08] when we were done, when we finished, I\n[18:10] went back to the prosecuting attorney\n[18:11] and said, \"He's not your guy.\" And he\n[18:13] said, \"Are you sure?\" And I said, \"I bet\n[18:15] my career on it.\"\n[18:16] >> How did you know? There's a lot of\n[18:18] things in regards to when you're looking\n[18:20] at people from the perspective of\n[18:23] telling the truth in terms of the way\n[18:25] that they they talk and engage with you.\n[18:28] Our conversation on Tuesday and our\n[18:30] conversation on Wednesday and our\n[18:31] conversation on Thursday and our\n[18:33] conversation on Friday all stayed very\n[18:35] consistent. If I'm asking him for\n[18:36] further clarification, he's providing\n[18:38] for further clarification. If I'm\n[18:41] talking to him about, you know,\n[18:42] something and there's some type of\n[18:43] spontaneous correction where he's like,\n[18:45] \"Wait a minute. This happened uh before\n[18:48] this, those are those are indicators of\n[18:50] of truth. And if there are things that\n[18:54] you know, he he talks about in terms of\n[18:56] like things that are of complication.\n[18:58] Nobody's day goes perfect.\" And you know\n[19:02] there were many times when he was\n[19:04] telling me about the things he had done\n[19:05] because you know he was a serial rapist\n[19:09] you know and a serial you know kidnapper\n[19:11] and he would drive around and pick up\n[19:13] women and hitchhiking and he would you\n[19:15] know rape them and let them go. Often\n[19:17] times we would get into the details of\n[19:18] like when those didn't go well right and\n[19:20] when all of a sudden the the girl would\n[19:22] would fight him off and run away and so\n[19:24] there was all these different\n[19:25] complications and different things that\n[19:26] he would talk about. He handled the\n[19:28] complications consistently is what\n[19:29] you're saying.\n[19:31] >> When complications are introduced to a\n[19:33] story, right, people who lie don't do\n[19:35] that, right? It's truth tellers will\n[19:37] often do that because it's just like\n[19:38] this is just what happened. Like these\n[19:39] are the things that happened. This is my\n[19:41] life in terms of where things were going\n[19:42] to go. Overall, in terms of how that\n[19:45] conversation went, there were those type\n[19:47] of indicators that just made it trend\n[19:50] more truthful than not. like there\n[19:51] wasn't this big gap or this big weird\n[19:53] moment when we're talking about Michaela\n[19:55] Garrett to where all of a sudden it's\n[19:57] like missing pieces that I have to put\n[19:58] in there. There are no cues to\n[20:00] deception. There are things that all of\n[20:02] a sudden seem different and require you\n[20:04] to do more\n[20:06] questions, more asking, but that didn't\n[20:08] occur around the time that we were\n[20:10] looking for with that.\n[20:11] >> Okay. So, we finally when we finished\n[20:14] and then they went back and they looked\n[20:15] at the evidence, they found a new\n[20:17] fingerprint and were able to um charge\n[20:21] and convict uh the person who did that.\n[20:23] The reason I bring all of that up is\n[20:25] because for the purpose aspects of what\n[20:28] we're talking about,\n[20:30] not losing sight of what your mission\n[20:32] is, being focused in terms of what that\n[20:34] is. The power of communication and\n[20:36] staying online as it relates to what you\n[20:40] want to accomplish is really powerful\n[20:43] because it keeps you on track and it\n[20:45] keeps you engaged and reminds you of why\n[20:47] you're there. Not every relationship\n[20:49] deserves that. Like there's just some\n[20:51] relationships you're like, \"This just\n[20:52] isn't worth it for me.\" If it matters to\n[20:54] you, that mattered to me. It mattered to\n[20:55] me not because for me, it mattered to me\n[20:58] for that family. And there is a\n[21:01] difference between having a profession\n[21:02] and being a professional. Having a\n[21:04] profession is what you do. Being a\n[21:06] professional is the culmination of\n[21:08] everything that you've done at that\n[21:09] moment, at that time for a specific\n[21:11] purpose. And that's what I had to bring\n[21:13] in with that because that was what was\n[21:15] at stake with this.\n[21:17] >> Um, so you have\n[21:19] >> this these four cards in front of you.\n[21:20] We've done the P which is staying\n[21:22] focused on your purpose when you go into\n[21:23] conversation to to fend off the emotion\n[21:25] which might distort you and take you\n[21:26] off. And I'm so guilty of that.\n[21:28] >> You know,\n[21:28] >> everybody is\n[21:29] >> so guilty of that with especially with\n[21:31] like you know\n[21:32] >> conversations with with my partner where\n[21:34] there's emotion involved and there's\n[21:36] some areas where you know blame might be\n[21:38] >> prevalent. So the L that you have there.\n[21:42] So the L\n[21:44] is listen this becomes the thing that\n[21:48] people are worst at because it's a lot\n[21:53] to do. Think about right now think about\n[21:56] my conversation with you at this moment.\n[21:58] I'm speaking so internally my internal\n[22:01] vocabulary and the conversation that I'm\n[22:03] having in my head is running about 800\n[22:05] to a,000 words a minute. I'm speaking to\n[22:08] you in about 120 to 150 words a minute.\n[22:11] There's a lot that's being edited.\n[22:13] There's a lot of things that I think\n[22:14] that I'm saying or I want to say. I'm\n[22:16] trying to engage with you. There's also\n[22:17] something called theory of mind, which\n[22:20] is me watching you and trying to\n[22:22] understand\n[22:24] is what I'm saying on point with what\n[22:27] Stephen wants to hear or wants to hear\n[22:28] for his audience. Do I need to change\n[22:30] anything? Does this landing on him? And\n[22:33] then if your non-verbals change or your\n[22:35] verbal changed, then I have to readjust\n[22:37] maybe what I'm editing and my theory of\n[22:39] mine will readjust too because I'm like,\n[22:40] \"Oh, I just lost him here. I have to I\n[22:43] have to readjust.\" Simultaneously,\n[22:46] you are listening to me and you're\n[22:48] listening to the 120 to 150 words I'm\n[22:51] giving you, but your brain can process\n[22:53] this at like 4 to 600 words per minute.\n[22:56] So, you have too much cognitive\n[22:57] bandwidth. you have the ability to\n[23:00] listen to me and then do multiple other\n[23:01] things which is oftentimes why people\n[23:03] will drift out or you'll start thinking\n[23:04] of something else or you'll think of\n[23:06] your your notepad because you got it you\n[23:08] got it figured out and this is when it\n[23:09] becomes really easy to be convinced and\n[23:12] not curious because you're like I kind\n[23:14] of know where this is going and so you\n[23:16] check out so you actually have to do\n[23:18] something called cognitive inhibition\n[23:19] you have to kind of narrow that\n[23:20] bandwidth to stay fully engaged with me\n[23:23] that's why when you hear people say like\n[23:25] active listening it's hard it's hard to\n[23:27] do because you have to be attentive to\n[23:30] the other person. You have to listen.\n[23:32] You have to look. You have to pick up\n[23:34] their verbal and their non-verbal\n[23:35] behavior. And you then you have to do\n[23:37] something with that. Steven CVY says\n[23:40] most people don't listen with the intent\n[23:44] to understand.\n[23:46] They listen with the intent to reply.\n[23:49] And if you are simply just waiting for\n[23:51] your turn to talk, then you and I are\n[23:54] not are not connecting.\n[23:56] Controlling conversation comes from\n[23:58] listening, not talking. So if I'm trying\n[24:00] to if I'm trying to get some information\n[24:02] out of someone, I should have a bias\n[24:05] towards just letting them speak at me.\n[24:07] >> You should, you know, you hear about\n[24:09] this like always let the other person\n[24:10] talk more. That's great. But if both\n[24:12] people are doing that, then the\n[24:13] conversation is not progressing. The\n[24:14] conversation is an extension of what you\n[24:18] and I are speaking with. And when we've\n[24:20] gone from listening in terms of what\n[24:21] that looks like, the next thing you have\n[24:23] to do which gets into this is the A\n[24:26] which is which is ask. Right? So the A\n[24:30] being this. If you are paying attention\n[24:32] to me and you're picking up on things\n[24:34] that I'm saying,\n[24:36] the changes in my body language, and\n[24:39] there's something you don't understand,\n[24:42] you need to ask. This is where you're\n[24:44] going to deepen the conversation. This\n[24:45] is where you show somebody that you're\n[24:47] active listening. you're curious and\n[24:49] you're open and you're trying to\n[24:51] understand them. If you look at empathy\n[24:53] research, we typically think that we can\n[24:57] understand our significant other or\n[24:59] different people at a much higher level\n[25:00] than we actually do. For a stranger,\n[25:03] it's called it's called empathy\n[25:04] accuracy. For a stranger, your ability\n[25:07] to understand their headsp space is like\n[25:09] 20%. For\n[25:12] a friend, somebody close to you, it's\n[25:14] like 30. For your significant other,\n[25:17] it's no higher than 40%. Which means\n[25:20] that despite you thinking that you know\n[25:22] what she's thinking, you got a four out\n[25:25] of 10 chance of being right. And if that\n[25:28] conversation gets emotional, that 40%\n[25:30] can go down as low as 15 because you\n[25:32] start to pull in to be like, I I'm I'm\n[25:35] guarding myself here. I'm guarding my\n[25:37] ego. When your ego is on the line, your\n[25:39] ears go offline because you stop hearing\n[25:41] what she's having to say and you start\n[25:43] protecting yourself in terms of what\n[25:45] you're trying to do. So your ability to\n[25:47] be empathetic when things are hard\n[25:50] becomes harder and you have to be very\n[25:52] mindful of that. Let's say you come home\n[25:54] from early morning workout and your\n[25:57] spouse says, \"Hey Stephen, uh, how was\n[25:59] it?\" And you say, \"That's pretty tough.\"\n[26:02] There's a lot that you can do with that.\n[26:04] This is what she could do. She could say\n[26:05] nothing. So now maybe you understand\n[26:07] that maybe she doesn't want to talk\n[26:08] about this or she's not interested in\n[26:09] it. That's one. The second thing she\n[26:11] could say to you would be like, \"Well,\n[26:13] sweetheart, that's why you look the way\n[26:15] you do.\" She has now made the\n[26:18] assumption, right, her her empathy\n[26:20] accuracy that she knows what you meant\n[26:22] by the word tough. And so if she says to\n[26:24] you, \"Well, that's how you look and\n[26:25] that's not what you meant.\" Now you feel\n[26:26] that there's a separation between what\n[26:28] you're hoping she would pick up on and\n[26:30] what you actually said. The third thing\n[26:31] she could say would be like, \"What do\n[26:34] you mean by tough?\" Because the\n[26:36] ambiguity of that is the word tough. Who\n[26:38] knows what that means? It could be a lot\n[26:39] of different things. She's now showing\n[26:41] you, \"I'm into you. I'm tuning in.\" In\n[26:43] the power of something like that, when\n[26:45] you talk about deepening relationships\n[26:47] and increasing that connection, that's\n[26:49] how it happens. The same thing with your\n[26:52] non-verbal behavior, right? You look at\n[26:54] non-verbal behavior, 66% of of what we\n[26:56] give is non-verbal. And so if I through\n[26:58] the course of my conversation with you,\n[27:00] if all of a sudden we're talking and\n[27:01] you're just like\n[27:03] >> folding my arms.\n[27:05] >> So folding your arms could be a sign of\n[27:07] just you're folding your arms. It could\n[27:08] be a sign of you not liking my question\n[27:11] if you roll your eyes. So if I see that\n[27:13] and it matters to me, then I need to say\n[27:16] something to the effect of it seems like\n[27:19] versus I think because I think is the\n[27:21] pronoun saying it's about me and it's\n[27:23] just like I don't care what you think.\n[27:24] It seems like what you just did maybe\n[27:27] was because you didn't like what I had\n[27:28] to say because I saw you cross your arms\n[27:30] and roll your eyes.\n[27:33] Do I have that right? So now you have a\n[27:35] choice where you can either say you yes\n[27:38] you got that right for these reasons or\n[27:39] no I just followed him because I was\n[27:41] comfortable and you know whatever the\n[27:43] case may be but it is a matter if I see\n[27:46] you and there and it's and it's in\n[27:48] harmony with the conversation that we\n[27:50] were having that seems like it's a you\n[27:52] know something that shows that it could\n[27:54] be\n[27:55] potentially a problem. I need to ask\n[27:57] about it. you and I having a\n[27:58] conversation right now and you folding\n[28:00] your arms isn't going to be like a red\n[28:02] flag that I'm like, \"Oh, I just saw you\n[28:03] folded your arms when I said that.\" But\n[28:05] if it's something that there's some\n[28:06] emotionate around that and it's\n[28:07] important and I'm trying to express\n[28:09] something to you and I see you roll your\n[28:11] eyes or cross your arms. Hey, hey,\n[28:13] Stephen, I noticed when I brought up\n[28:14] this thing about our family, um, you\n[28:17] kind of leaned back and crossed your\n[28:18] arms and rolled your eyes. It seems like\n[28:20] you didn't approve of that. Is is that\n[28:21] Do I have that right? So, now it's on\n[28:24] you to explain that or not. On this\n[28:25] point of body language, um, as someone\n[28:27] that sits here and I guess interviews\n[28:30] people for like, you know, four or five\n[28:32] hours at a time sometimes,\n[28:35] over the last 5 years, I have come to\n[28:37] learn certain body language um, patterns\n[28:39] in my guests.\n[28:40] >> Okay.\n[28:41] >> One of the most obvious ones is when I\n[28:43] ask the guest a question that is causing\n[28:46] them some potential discomfort in some\n[28:47] way. And when I say discomfort, I should\n[28:49] probably define that as\n[28:52] maybe it's a difficult question for\n[28:55] whatever reason.\n[28:56] >> Sure.\n[28:56] >> What I tend to see is I tend to see them\n[28:58] cross their arms.\n[28:59] >> Okay.\n[29:00] >> That's like a really consistent pattern.\n[29:01] It's almost like a it's almost as if\n[29:03] they're telling me that this is a little\n[29:04] bit difficult and it's it holds to be\n[29:06] true.\n[29:07] >> Do you ask them?\n[29:08] >> I noticed when you crossed your arms,\n[29:10] you know, when I asked you that\n[29:11] question, is it something with this\n[29:12] question that bothered you or do you\n[29:13] just let it go?\n[29:14] >> I let it go, but it but it's they've\n[29:16] already told me.\n[29:16] >> Okay. So, I've already I don't need to\n[29:18] ask them because I I know I now know\n[29:20] that there's something there where\n[29:22] there's emotion.\n[29:23] >> Sure.\n[29:23] >> It's kind of the way that I I see it.\n[29:25] >> It's what it is. More than likely, it's\n[29:26] what it is. And I think there's power to\n[29:28] that because your perception, right? So,\n[29:31] it's you bring this back like your\n[29:33] pattern recognition of all the guests\n[29:35] that you've done and the association or\n[29:37] the the connection of that in terms of\n[29:39] the question that you ask and they cross\n[29:41] their arms. Like, that's where that\n[29:42] comes from. That's where that all of a\n[29:43] sudden that thing where you're just\n[29:44] like, I feel it, but I don't really know\n[29:46] it. It's just like you don't know that\n[29:47] to be the case because it could be a\n[29:49] number of different things but because\n[29:50] of the pattern recognition you see it\n[29:52] all the time that gives you the chance\n[29:53] of saying this is there's some emotion\n[29:55] here. So either engage it or tread\n[29:57] lightly depending on which way you want\n[29:58] to go\n[29:59] >> both. Yeah.\n[29:59] >> And that's what happens. So instead of\n[30:00] saying like you know why why did you\n[30:02] cross your arms? I will ask them\n[30:04] potentially how how that memory makes\n[30:06] them feel or how they they feel about\n[30:07] that. And\n[30:08] >> and that tends to be it's just it's so\n[30:10] you know because people always talk you\n[30:11] know they say does body language matter\n[30:13] does it count for anything? Can you\n[30:15] interpret someone's body language to\n[30:16] understand if they're telling you the\n[30:17] truth? Is any of this stuff true in your\n[30:20] in your view?\n[30:21] >> No.\n[30:23] You should you should look at body\n[30:24] language because it it it it is a\n[30:26] language in terms of what somebody is is\n[30:28] showing you, you look at body language\n[30:31] and if you see something that is a\n[30:33] change, just like the cross in your\n[30:35] arms, then you need to be curious about\n[30:37] it.\n[30:37] >> So, it's really about a change in state.\n[30:39] >> It's a change of it's a change of what\n[30:41] somebody's doing and the timing of that.\n[30:43] So you just said like when I ask\n[30:44] something that is personal or emotional,\n[30:47] they'll talk about it. They'll cross\n[30:48] their arms because maybe it's just now\n[30:50] like the psychological thing where I\n[30:52] want to guard myself a little bit. Maybe\n[30:53] I want to kind of close up a little bit.\n[30:55] Who knows? But if it's something where\n[30:57] you're just like, I noticed it and you\n[30:59] don't need to use it. Like you could ask\n[31:01] them if you wanted to, but you're just\n[31:02] like, oh, they already they already told\n[31:04] me, so I don't need it. But for anybody\n[31:06] else, if you see that and you're talking\n[31:08] and somebody crosses their arms, don't\n[31:10] just assume that's what it is. Because\n[31:12] if you assume and you're wrong, you're\n[31:13] going down the wrong track.\n[31:15] [clears throat]\n[31:17] >> And so throughout this framework for\n[31:20] having hard conversations, we've covered\n[31:21] the P which is stick your purpose, the L\n[31:25] the which is listen, A which is to ask.\n[31:27] >> Ask.\n[31:28] >> Is there anything else in the framework?\n[31:31] >> The N\n[31:33] which is the next steps. So\n[31:37] to have a plan means to understand all\n[31:40] of these different things and the way\n[31:41] that you approach that. And the next\n[31:42] steps is how do you want to resolve\n[31:44] this? Like what's the end goal with\n[31:46] this? Is there anything that I can do\n[31:49] that we can you know further our\n[31:52] relationship where both you and I can\n[31:53] can be in alignment.\n[31:54] >> Do you ask them or do you propose?\n[31:56] >> I would always ask them if I'm engaged.\n[31:58] Right. So perhaps let's go back to the\n[32:00] the conversation that you may have with\n[32:03] you know this this individual. or you're\n[32:04] just like this person's a narcissist and\n[32:05] so forth. If you're engaging them and\n[32:08] you're the one who wants to really have\n[32:10] this conversation and you're hoping that\n[32:12] you can find some type of resolution,\n[32:14] you have to ask if there's resolution\n[32:16] with that. So something to the effect\n[32:18] of, do you think that you and I can find\n[32:19] an amicical way forward where when I\n[32:21] when you and I engage, you know, we can\n[32:23] really enjoy each other's time and and\n[32:25] this thing not go bad. Like do you see\n[32:26] that in our future at all? Yes or no?\n[32:29] And then it's either yes. Okay. What\n[32:31] does that look like for us? Like how do\n[32:32] we have that? because I am I'm having\n[32:34] this conversation with you because my\n[32:36] relationship with you matters, but there\n[32:38] are things that happen within that are\n[32:39] that are frustrating and that cause me\n[32:42] not to really want to engage. I do want\n[32:44] to find a way to do that because that is\n[32:45] most important to me. How best do we do\n[32:47] that? There is no magic bullet by which\n[32:50] makes everything every conversation go\n[32:52] perfect. There's none. You are you are\n[32:54] part of that conversation. The other\n[32:56] person is part of that conversation. You\n[32:58] have your perspective. They have their\n[33:00] perspective. You have what you think is\n[33:02] right or or or think is fair. Fairness\n[33:05] is subjective because what you think is\n[33:08] fair is just means what you think is\n[33:09] fair. And so\n[33:11] the hardest part is to walk away and\n[33:13] feeling like you should there should\n[33:15] have done more you can do. The power\n[33:17] becomes knowing how to address that. And\n[33:20] if it doesn't go right then you walk\n[33:21] away and be like you know what it just\n[33:22] didn't go right and I'm okay with that.\n[33:24] >> What if they start insulting you in the\n[33:26] conversation?\n[33:27] >> Okay. What's your purpose of being in\n[33:29] the conversation?\n[33:31] I'm trying to get them to stop being so\n[33:32] rude to me when we're on the same bank\n[33:34] of telephones at the call center.\n[33:37] >> So, it is a matter of if she's being\n[33:40] rude to you, it's it's addressing that\n[33:42] at the moment, right? You know, I I\n[33:44] noticed that we're having this\n[33:45] conversation that you're being really\n[33:47] aggressive, really rude, and really\n[33:49] condescending.\n[33:50] >> So, you cool it out.\n[33:51] >> Yeah. Be very specific in terms of what\n[33:53] it is. Like, you know, if she if she\n[33:55] calls you and she uses, you know, she\n[33:56] calls you a name or whatever the case\n[33:58] may be, like, you know what, you're\n[33:59] being rude. and she's just like, \"What\n[34:00] did I do?\" And you're like, \"You're just\n[34:01] being rude.\" That's unhelpful. Like,\n[34:03] give her the context by which you feel\n[34:04] that she's being rude. Because maybe she\n[34:07] does something outside of a name where\n[34:09] you're like, \"You're being rude.\" And\n[34:10] maybe to her that's not rudeness. Maybe\n[34:12] it's her directness, right? But if she's\n[34:14] like, \"You know what? You're Stephen,\n[34:16] you're just an asshole.\" Or whatever the\n[34:18] case may be. And I would say, \"Hey, it\n[34:20] seems like as of right now, like, you\n[34:21] know, you're very condescending. You've\n[34:22] called me a name to include an\n[34:24] Can you explain to me specifically right\n[34:26] now why that is?\" and make her back it\n[34:29] up. Make her explain to you what it is\n[34:31] that is there something about is there\n[34:33] something about me you don't like? Is\n[34:34] there something about my my work ethic\n[34:36] that you don't like or maybe the way\n[34:38] that I'm doing this? You've been here\n[34:39] longer than me. So is perhaps there's\n[34:41] something else that I'm doing or not\n[34:44] doing that you think is wrong because I\n[34:46] am not understanding your anger and your\n[34:49] venom and your need to insult me and I\n[34:52] would really try to understand what that\n[34:54] is. So, you're having a very direct\n[34:55] conversation with her, very specific to\n[34:57] what she's saying. It does not mean that\n[35:00] that's going to fix it. She could just\n[35:02] be an And it's one of those\n[35:04] things where you have to be like, I am\n[35:06] going to address this. I'm not going to\n[35:09] return in kind. I don't have to turn\n[35:11] into that person as well. I can walk\n[35:13] away from that conversation and be like,\n[35:15] you know what, I handled that the best I\n[35:16] could. Doesn't mean it's going to fix\n[35:18] it. Are there any tactics that\n[35:20] interrogators are taught or that you\n[35:22] teach interrogators for keeping your\n[35:24] emotions in check? Because, you know, we\n[35:27] we go into those conversations, someone\n[35:28] calls you an you your cortisol\n[35:31] starts spiking, you get into your\n[35:32] amydala, you get stressed, you get\n[35:34] emotional, you end up calling them an\n[35:35]  back. But is there I don't know,\n[35:36] is there breath work? What what do\n[35:38] interrogators get taught\n[35:39] >> in the heat of the moment? At the at\n[35:42] that time, you have no time to do breath\n[35:44] work. This is real time stuff in terms\n[35:46] of what you're trying to do. If you go\n[35:48] in and you understand your purpose and\n[35:49] again I don't mean to go back to the\n[35:51] plan but what happens is you become you\n[35:53] can be pulled out very quickly and all\n[35:55] of a sudden if you are trying to get\n[35:58] information from somebody and one of\n[36:00] their strategies because they maybe\n[36:02] don't want to give you information one\n[36:04] of their strategies is to insult you and\n[36:06] now you're insulting them back one\n[36:09] you're not going to get anything two you\n[36:10] fell under their strategy so what you\n[36:12] have to do is you have to address that I\n[36:14] am something to the effect of I see that\n[36:16] when I asked you matter and all of a\n[36:18] sudden like it seems like there's a\n[36:19] change in our relationship to where now\n[36:21] you're being really aggressive. Why is\n[36:22] that?\n[36:23] >> So, you're continually calling it out.\n[36:25] >> Yes. Because I am asking you to back up\n[36:28] your emotions. If if because if it's if\n[36:31] it's BS, if you're just doing that\n[36:34] because you're trying to hide the ball\n[36:35] someplace else, I'm going to call you\n[36:36] out on it. It's also showing me that I\n[36:38] am not afraid to confront this type of\n[36:41] behavior and I'm seeing it and I am I am\n[36:44] really trying to engage with you in a\n[36:46] very amicable genuine way and if you are\n[36:49] going to treat me a certain way I am\n[36:50] going to understand what that is. You're\n[36:52] also showing that you're not doing it in\n[36:53] kind\n[36:54] >> is part of this showing that you're\n[36:56] strong. It's less about being strong and\n[36:59] more about being competent and confident\n[37:02] in what you're doing. Because if you\n[37:04] allow\n[37:06] in anybody, not just an interrogation\n[37:08] room, in in any in any conversation, if\n[37:11] you lose your cool, you lose control.\n[37:15] You have to be mindful of that. I was\n[37:17] overseeing a an internal affairs\n[37:19] interview uh and I was going to go in\n[37:21] and talk to this person at the end. I\n[37:22] was thinking about doing a polygraph\n[37:23] with them, but before that was going to\n[37:26] happen, the the case agent, the person\n[37:28] who had the investigation was talking to\n[37:30] the subject. It was a road rage incident\n[37:33] where this uh agent uh had been accused\n[37:36] of road rage and pulling his gun out on\n[37:38] a civilian. So, this was the\n[37:40] conversation that they were that they\n[37:42] were having. And I'm listening to this\n[37:43] in an interview room, right? In in terms\n[37:46] of like a two-way two-way mirror. And\n[37:49] the subject is very aggressive. He's\n[37:52] very angry and he's very angry to the\n[37:54] point of like he's like, \"I don't know\n[37:56] why you don't believe me with this. I\n[37:58] keep telling you these things and you\n[38:00] keep asking me the same questions. I\n[38:02] think this is a bunch of BS.\" The\n[38:04] investigator comes back and he's just\n[38:05] like, \"Because I think you're a liar and\n[38:08] you're not telling me the truth in terms\n[38:10] of what it is and you're causing us to\n[38:12] be in this room a lot longer and this is\n[38:14] a problem.\" So now they are both yelling\n[38:17] at each other, like yelling at each\n[38:19] other. And it was one of these things\n[38:20] where I'm watching this unfold. And it\n[38:25] wasn't the subject's job to maintain his\n[38:27] composure. It was the investigators\n[38:29] because his goal is not to belittle this\n[38:32] other agent. His goal was to find out\n[38:35] did this or did this not happen. And he\n[38:37] lost sight of that. And he came out of\n[38:39] the room to me and he's like, \"What do\n[38:41] you think?\" And I'm like, \"Well, I'm not\n[38:42] going to polygraph him. I mean, this\n[38:43] guy's so emotional right now. Like\n[38:44] that's not going to happen.\" And he\n[38:46] goes, \"You know what? This guy's just an\n[38:47]  anyway.\" And I'm like, I don't\n[38:49] think he's the in the room. The\n[38:51] other guy was the in the room\n[38:52] because he allowed himself to get pulled\n[38:54] out of what he should have been doing\n[38:56] because now he wanted to have the game\n[38:58] of who's the bigger who's the bigger\n[39:00] jerk in the room, you can do it. And\n[39:03] again, if you want to burn that bridge,\n[39:05] burn it. But if if you want to maintain\n[39:08] a relationship or you want to maintain\n[39:10] your profession or you are trying to get\n[39:12] to some resolution, you cannot lose your\n[39:15] cool. I guess that's what it comes down\n[39:17] to is most of the time we're not clear\n[39:18] on the goal going into the conversation.\n[39:20] So we we have nothing to be anchored to.\n[39:23] So just it's we it's getting into the\n[39:26] washing machine.\n[39:27] >> Absolutely what it is.\n[39:27] >> We just spin around and around and\n[39:29] around and\n[39:29] >> absolutely\n[39:30] >> walk away with a nice relationship.\n[39:31] >> And the power really comes from if this\n[39:34] person is insulting you and they're\n[39:36] angry and they're doing these things and\n[39:37] you're sitting there and you're asking\n[39:38] good questions, you're keeping your\n[39:40] composure. There is a lot of power with\n[39:41] that. And I mean power in a in a way\n[39:44] that shows like I'm in I'm in control of\n[39:46] myself. I am well aware of what's going\n[39:50] on as this relationship and this\n[39:52] conversation is is happening. Uh I am\n[39:55] not going to fall into this because this\n[39:57] matters to me in terms of this other\n[39:58] thing.\n[39:59] >> I've [snorts] heard you say that you\n[40:00] think people suffer from me me syndrome.\n[40:04] What does that mean?\n[40:05] So the me me syndrome is everything\n[40:11] everything is about me right I mean it\n[40:13] seems obvious with that but like you can\n[40:15] even look at things from like a cultural\n[40:17] perspective you can look at like here\n[40:19] you know in in the US in western\n[40:21] civilizations like we are primarily like\n[40:23] a dignity culture where we are it's all\n[40:25] about us right it's all about that\n[40:26] internal that internal feeling that that\n[40:28] we have and so everything is predicated\n[40:31] on our job our success the things that\n[40:34] we do the external world doesn't really\n[40:36] matter in terms of our our success or\n[40:38] failure. So a lot of it is what is in\n[40:41] your headsp space and how do you manage\n[40:45] that because the problem that I see and\n[40:48] what I think comes with in communication\n[40:52] is\n[40:54] we do\n[40:56] a lot of self-reflection.\n[40:59] We rarely do a lot of outward reflection\n[41:01] on the other person. Some of the best\n[41:02] negotiators there will spend more than\n[41:04] half of their time thinking about\n[41:06] somebody else. So, a very personal\n[41:08] story. Um, when I was 21, my father\n[41:12] passed away and he had been battling\n[41:14] cancer for for three years. And so, when\n[41:17] he passed away, uh, I have four siblings\n[41:19] and my mom was there. So, when he passed\n[41:21] away, he passed away at home and all\n[41:22] five of us were there.\n[41:25] Several years later, uh, I'm having this\n[41:27] conversation on the day that my dad died\n[41:29] about the day that my dad died. I'm\n[41:31] having this with my my sister and my\n[41:34] three younger brothers and we're talking\n[41:35] about where we were and so forth. And my\n[41:37] sister says, \"Yeah, I I can't watch the\n[41:40] Simpsons without thinking of of dad.\"\n[41:42] And I said, \"What do you what do you\n[41:45] mean?\" She's like, \"Well, the the the TV\n[41:47] was there and the Simpsons were on.\" And\n[41:48] she's like, \"I always just remember\n[41:49] that.\" And I was like, \"There's a\n[41:52] there's a TV in the room?\" She's like,\n[41:53] \"You don't remember a TV being in the\n[41:55] room?\" And I'm like, \"I have absolutely\n[41:57] not. I have no idea that there's a TV in\n[41:59] the room. I didn't code it. that wasn't\n[42:00] the thing that was important. Her\n[42:02] perspective and the way that she saw\n[42:05] that moment affected her differently\n[42:07] than everybody else in that room. And so\n[42:09] to go back to the me me, when you fail\n[42:12] to take in consideration that other\n[42:14] people have other experiences based on\n[42:18] how they pick up the world, how they do\n[42:22] things in the world, and you think that\n[42:24] it's just about you, you're you are\n[42:27] going to have a really hard time having\n[42:28] a deep, honest, connective relationship\n[42:31] with somebody if it's just about you.\n[42:33] You can do it. And a lot of people do\n[42:35] it. you know, they're looking for that\n[42:37] that way to, you know, make people drawn\n[42:39] to them and make people connect to them\n[42:41] and and that's fine. But if you are\n[42:44] trying to\n[42:47] I guess Stephen, if you just want to be\n[42:49] like a genuine person and you want to\n[42:50] have a relationship, don't make it about\n[42:52] you. I've just finished writing my third\n[42:55] book. I haven't firmed up the title yet,\n[42:57] but I have started mocking up some\n[42:58] different designs. And I've been doing\n[43:00] this with Adobe Express, which is one of\n[43:02] our sponsors. What I love about Adobe\n[43:04] Express is that it makes it so easy for\n[43:06] me to obsess over the tiniest details.\n[43:08] The typography, the font, the color, the\n[43:10] text placement, the stuff that might\n[43:12] sound petty to most people, but actually\n[43:14] compounds to create something that\n[43:15] stands out, something that's one better\n[43:18] than the rest. And designing my cover\n[43:20] art has reminded me of how many creative\n[43:22] things I've learned over the year. But\n[43:23] it's also reminded me that there are so\n[43:25] many creative minds around me that are\n[43:26] also sitting on their own secrets. So,\n[43:29] I've created the one better guide in\n[43:31] Adobe Express to bring those tips to\n[43:33] you. And in it, you'll find principles\n[43:35] from the very, very best in their\n[43:36] industry turned into quick and easy\n[43:38] practices for you to apply so you can\n[43:40] train yourself to create exactly like\n[43:42] the best performing teams in the world\n[43:44] do. Just head over to adobe.bet\n[43:47] to download Adobe Express now and make\n[43:50] sure you visit the learn tab to discover\n[43:52] how you can become one better than the\n[43:55] rest. I was thinking this earlier. I was\n[43:57] thinking one of the things in the p this\n[43:58] podcast that I've learned is if I um if\n[44:01] I want to increase the probability that\n[44:02] someone opens up and tells me something,\n[44:04] one of the things I do is I share\n[44:06] myself.\n[44:07] >> Yeah.\n[44:07] >> So, you know, I might be asking someone\n[44:09] about their childhood and it's quite\n[44:10] clear to me now that one of the ways,\n[44:12] especially if they end up crossing their\n[44:14] arms and get uncomfortable.\n[44:15] >> Yeah.\n[44:15] >> Is just to pause for a second and share\n[44:16] my own childhood.\n[44:17] >> Yeah.\n[44:18] >> So, if I've identified that one of your\n[44:19] values is, I don't know, you want to be\n[44:20] a good family man. Might you mention\n[44:22] that you're a family man yourself as a\n[44:24] way to build a bridge? So if it's\n[44:27] honest, so so that's a great question,\n[44:29] but this becomes a thing where you have\n[44:31] to look at things if you were trying to\n[44:32] influence or manipulate somebody. If\n[44:34] it's honest and it fits within that\n[44:37] conversation at that moment because this\n[44:38] is what I based on our conversation I\n[44:40] think this person needs to hear, then\n[44:42] sure, if it's real. If it's not, if I'm\n[44:46] lying to him because I'm trying to say,\n[44:48] \"Well, I'm a family man. You're a family\n[44:49] man. Like we're we're good.\" Now you're\n[44:51] now you're manipulating the person and\n[44:54] that's a whole different conversation.\n[44:56] So to go back to what you said, if if I\n[44:58] understand this guy's values and I\n[45:00] understand that there is a sense of\n[45:05] let's say a sense of honesty, maybe\n[45:07] there's a part of this person that's\n[45:08] also honest or there's also a sense of\n[45:11] he wants to be\n[45:13] I don't know, he wants his kids to see\n[45:15] him as a as a as a man of integrity,\n[45:18] right? Let's just say that. So maybe\n[45:20] maybe that starts to become a\n[45:22] conversation that we have as it relates\n[45:23] to um you know I can only imagine you\n[45:26] know the difficulty that this has with\n[45:28] you as as you've told me you know you're\n[45:30] a family man. I'm not going to say\n[45:31] you're a family man. I'm going to say as\n[45:32] you told me you're a family man. And one\n[45:34] of the things that you said about being\n[45:36] a family man was how important is your\n[45:38] kids to to kind of like lead by your mo\n[45:40] your model like your role model aspects\n[45:42] of that by honesty and openness and and\n[45:46] and those type of things. So do you hear\n[45:48] where I'm going? So I'm trending in the\n[45:49] direction by which that I am trying to\n[45:52] bring online still his father but a\n[45:54] different value under what it means to\n[45:56] be a father because I don't want to talk\n[45:57] about being present because that's\n[45:59] probably going to go away. But if he is\n[46:01] trying to teach his kids to own your\n[46:04] mistakes then maybe that's the direction\n[46:06] I go. But how am I going to get that?\n[46:08] I'm gonna get that because I'm going to\n[46:10] start off my conversation with him in a\n[46:11] very honest, genuine way that I'm going\n[46:13] to try to understand who is this person\n[46:15] across from me.\n[46:17] >> And what's the difference between\n[46:18] manipulation and influence?\n[46:21] >> Influence is about nudging a person in a\n[46:25] certain direction at a certain time\n[46:27] that's beneficial for both you and them.\n[46:31] That's influence. Got it? Mhm.\n[46:33] [clears throat]\n[46:34] >> Manipulation is you nudging a person in\n[46:37] a specific direction\n[46:39] because it's good for you. It's not good\n[46:41] for them. And so you'll lie. You'll\n[46:43] you'll do whatever you need to do to to\n[46:45] close a deal to get them to do something\n[46:47] to give them to give you something.\n[46:49] That's manipulation because it's often\n[46:51] one of those things that it has negative\n[46:53] consequences to it in terms of the\n[46:55] person who did it. You know, maybe they\n[46:56] never know, but you manipulated them,\n[46:58] >> which is interrogations. No, because\n[47:00] this guy's going to go he's going to get\n[47:02] life in jail if he admits that he killed\n[47:04] this child. So, I'm that's not in his\n[47:07] interests, but it's in mine. So, I'm\n[47:08] going to manipulate him to give me the\n[47:10] secrets.\n[47:10] >> If that's what you want to do and that's\n[47:11] the direction you think you need to do,\n[47:14] then by all means, you can do it. And\n[47:15] here in the US, it is legal that you can\n[47:18] lie to\n[47:20] >> subjects. But,\n[47:21] >> so you're saying lying is the the the\n[47:22] moment where it becomes manipulation.\n[47:24] >> Yes. that becomes the shortcut and that\n[47:26] becomes a way not just within the\n[47:28] interrogation room like I think what\n[47:29] becomes important and I've seen this\n[47:30] come up a lot people are all about like\n[47:32] influence like you hear that come up\n[47:34] quite a bit if you want to influence\n[47:36] somebody this is how you do it you're\n[47:37] honest with them you're clear and you're\n[47:39] transparent because influence is about\n[47:42] how do I feel about you not about all\n[47:44] the things that you're doing at that\n[47:45] moment because if I don't if trusted is\n[47:47] isn't even on the table if I don't trust\n[47:49] you to begin with or I think that to go\n[47:51] back to what you had said there's this\n[47:52] pattern recognition where I'm like I\n[47:54] just think there's something wrong with\n[47:55] this. You're not going to be able to\n[47:56] influence me if I am honest with you in\n[48:00] everything that I do because that's how\n[48:01] I carry myself. Not only does it lower\n[48:04] your cognitive load because you're not\n[48:05] lying to somebody else, but it\n[48:07] underscores who you stand for and who\n[48:09] you are as a person. And with that,\n[48:11] people are going to see that and say,\n[48:13] you know what, Stephen's very\n[48:14] transparent. He said this was a good\n[48:16] deal and I believe that for these\n[48:18] reasons. It's a matter of you being\n[48:20] honest with that. I I always question\n[48:22] now like because I see it a lot and it\n[48:24] came up in the in the questions that\n[48:25] that I was talking to your team about.\n[48:26] It's like why does everybody want to\n[48:29] influence somebody? Like why why do they\n[48:32] what what is that? Do you know like why\n[48:34] does it come up all the time?\n[48:36] >> Because\n[48:37] what are people trying to accomplish?\n[48:39] >> They want to accomplish something. They\n[48:41] have a goal\n[48:41] >> for who?\n[48:42] >> For themselves,\n[48:43] >> right? So is that is that influence?\n[48:48] But it gets the job done for some for\n[48:51] some people.\n[48:51] >> Sure it does.\n[48:52] >> I'm thinking about that. Is it Cariegi?\n[48:54] What's that book? It's probably behind\n[48:56] me somewhere called influence and it\n[48:58] talks about the this five pillars of\n[49:00] influence things like scarity.\n[49:02] >> So it's uh Robert Chaldini.\n[49:03] >> Oh yeah.\n[49:03] >> We teach that, right? It's one of those\n[49:05] where you can understand why influence\n[49:08] works, the different strategies of\n[49:10] influence, like what they all stand for\n[49:11] and when they fit within the within the\n[49:14] conversation. You can do it. I do it.\n[49:17] But I can I can tell you, Stephen, being\n[49:19] a being a communication specialist, I\n[49:22] don't spend my day walking around trying\n[49:24] to influence people. I will be honest\n[49:26] with people. I will be transparent. I\n[49:29] will answer their questions with the\n[49:30] best information that I have. And if\n[49:32] people are inspired by that and and and\n[49:35] that causes somebody to be influenced by\n[49:37] the things that I said, that's that's\n[49:40] what I want, right? And I brought this\n[49:42] up earlier, but the the training academy\n[49:44] that that you know that I instruct with,\n[49:46] it is all about openness. It's all about\n[49:48] honesty. It's all about trying to help\n[49:51] people based on why they've come to us.\n[49:53] And it's not about manipulating people\n[49:56] to to come in and be a member. It's\n[49:58] about why are you here and how can we\n[50:01] help you? And this is the best way we\n[50:03] can do that. And that influences people\n[50:04] and that inspires people to to listen to\n[50:08] what you have to say. Why why is your\n[50:10] podcast this successful? The first time\n[50:12] you and I met, you said something that I\n[50:15] disagreed with.\n[50:15] >> What was that?\n[50:16] >> And it was you were talking about Flight\n[50:18] Story and you were talking about the\n[50:19] different things you you you know with\n[50:20] Flight Story and the success of the\n[50:21] podcast and you said it's not because\n[50:24] I'm a good interviewer. It's because\n[50:25] they're really good at marketing. You're\n[50:27] a good interviewer because of the\n[50:29] vulnerabilities that you do. Every time\n[50:31] I've been surprised on how vulnerable\n[50:34] and open you are in terms of sharing\n[50:36] with yourself like there's that story\n[50:37] arc in terms of how that connection is\n[50:40] because of that you influence me not\n[50:43] because you're trying to not because\n[50:44] your team reached out but because of the\n[50:46] way you carried yourself in your podcast\n[50:49] and the questions that you ask and the\n[50:51] vulnerability that you're showing. There\n[50:52] is a level of trust that comes with\n[50:55] that. And so you in you weren't trying\n[50:57] to influence you were being you. And\n[50:59] there's a part of your self- congruence,\n[51:02] who you are, your ideal self, which is\n[51:04] just like, this is just what I do, and\n[51:06] my life's not perfect, and I'll share\n[51:07] the parts that are messy, and I'm trying\n[51:10] to use this as a platform to help\n[51:12] millions of people. That's a big deal.\n[51:15] >> And is this how you build trust with\n[51:17] people\n[51:18] or is trust a different or adjacent\n[51:20] point?\n[51:21] >> So trust is about being vulnerable.\n[51:25] Trust is about being open\n[51:28] and sharing a little bit about yourself.\n[51:32] So truly, Stephen, the question becomes,\n[51:34] is what I've shared with you in good\n[51:36] hands? Because if it's not, that's a\n[51:39] problem,\n[51:40] >> right?\n[51:41] >> Mhm.\n[51:41] >> Let me ask you a question. Do you have a\n[51:43] secret that maybe you've never told\n[51:45] anybody or you've told just one or two\n[51:47] people?\n[51:47] >> Yeah,\n[51:48] >> you do. You got one in mind?\n[51:49] >> Yeah.\n[51:49] >> What is it? [laughter]\n[51:52] >> I can't. There's millions of people\n[51:53] listening.\n[51:54] >> Okay. But but if these millions of\n[51:56] people weren't watching, would you tell\n[51:57] me?\n[51:59] >> Yeah.\n[52:00] >> Okay. So, the reason that you're not\n[52:03] telling me or in front of these millions\n[52:05] of people is why why are you not why are\n[52:08] you not telling us your secret?\n[52:09] >> Um because of consequence.\n[52:12] >> Okay.\n[52:13] >> Some someone's going to clip it.\n[52:14] Someone's going to put it on the\n[52:15] internet. Someone's me up.\n[52:16] >> There's a reason for it, right? There's\n[52:18] a reason that you're not trusting in\n[52:20] terms of what it was. Maybe you trust me\n[52:22] just because of the the relationship\n[52:23] that we've built to this point. Um, but\n[52:26] there's probably other things that you\n[52:27] wouldn't trust me with. When you talk\n[52:29] about trust, I if you look at concentric\n[52:31] rings, you know, in terms of the the\n[52:33] trust around you, the the center ring\n[52:36] should be selfrust. It should be you.\n[52:39] You should be able to trust yourself\n[52:40] more than you trust anybody else. If you\n[52:42] don't, you probably need to do a little\n[52:43] bit of work, right?\n[52:45] >> What does that mean in reality of me\n[52:46] trusting myself? Do you trust that you\n[52:49] will do the things that you want to do\n[52:52] or you ought to do or do do you keep\n[52:53] yourself in that direction? Do you keep\n[52:55] yourself accountable?\n[52:56] >> Right? That becomes this thing where can\n[52:58] you make decisions? Are you a person\n[52:59] like I don't make any decisions. I let\n[53:01] somebody else make decisions or I run\n[53:02] everything by everybody else because I\n[53:04] don't trust myself to make the right\n[53:05] decision. Then you have to work on your\n[53:07] decision-m because you have to find a\n[53:09] way to build your trust up. Mhm.\n[53:11] >> Outside of that initial ring, it's it\n[53:14] should be a ring of\n[53:16] a handful of people that have\n[53:18] unconditional trust, right? And these\n[53:20] are the people that no matter what, like\n[53:22] you've given them that trust. You you\n[53:24] believe in them. And it should be a\n[53:27] small circle. And this is where I think\n[53:29] people go wrong. They're like, \"Ah, you\n[53:30] know, I I I share everything with\n[53:32] people.\" Then they then they're crushed\n[53:35] when one of those people that they've\n[53:37] given unconditional trust with break it.\n[53:40] That's a problem. I have probably,\n[53:43] you know, my siblings are all really\n[53:44] close to me, so I have them. There's\n[53:45] four of them. Um, outside of that, I\n[53:47] have my, you know, I have my wife and a\n[53:50] select few friends, you know, that I\n[53:52] know that if I call, they're like,\n[53:53] \"Let's we're good.\" Um, outside of that,\n[53:57] you should, everybody else should be\n[54:00] conditional trust. People should earn\n[54:02] your trust, right? They should be\n[54:03] honored to have it. Like, don't give it\n[54:05] away for free. And if you have\n[54:07] somebody's trust, you should respect\n[54:08] that. if they've given that to you be\n[54:10] but I think and I've seen it I people\n[54:13] give away trust way too much because the\n[54:15] person will be amazing in this one spot\n[54:17] and all of a sudden they get the halo\n[54:19] effect and they're like well they're\n[54:20] great here they must be great here it's\n[54:22] this it's this arc of they're awesome\n[54:24] everywhere and so I'm going to trust\n[54:27] them with these other things then when\n[54:30] again they break it they violate it\n[54:36] the way you feel is just the this this\n[54:39] violation of you know somebody took what\n[54:41] you gave them and just destroyed it.\n[54:43] It's hard to come back from that. It's\n[54:44] hard to once you re once you lose trust\n[54:48] like if you lose somebody's trust it's\n[54:49] really really hard to get back. Is there\n[54:51] anything you can do to get back, do you\n[54:52] think?\n[54:53] >> What I know that you can do, it doesn't\n[54:55] always work. You have to be accountable\n[54:58] for why you lost it. Whatever that is,\n[55:01] very specific.\n[55:02] It's going to take time and a lot of\n[55:06] consistency to consistency meaning that\n[55:08] you show them consistently time and time\n[55:10] again that you are a person that you\n[55:13] know can be trusted.\n[55:15] >> On um on leadership principles,\n[55:18] something I've heard you talk about as\n[55:19] well. Um what what do you think are the\n[55:22] most important principles as it relates\n[55:23] to leadership? Because we talked about\n[55:24] trust there and other things around\n[55:26] communication and all these things. Is\n[55:28] there is there anything we haven't\n[55:29] covered as it relates to being a great\n[55:31] leader in your perspective?\n[55:33] >> Somebody who's calm under chaos.\n[55:35] >> That would be my definition of a leader.\n[55:38] However, and I say that because\n[55:40] leadership is a feeling, Stephen, how do\n[55:43] you make these people feel as it relates\n[55:45] to my qualities as a leader? Do I do the\n[55:48] things that register with you as\n[55:51] leadership? As I can tell you when I was\n[55:52] on a a SWAT team, which is the special\n[55:54] weapons and tactics, this is where I\n[55:57] learned the true essence of leadership\n[55:59] because I had some amazing commanders\n[56:03] and and team leaders on that team were\n[56:05] under high stress, under a stress like\n[56:08] that. If you have people around you that\n[56:11] are keeping their composure, that's\n[56:12] leadership.\n[56:14] One of the elements there, I guess, as\n[56:16] when you're in the SWAT as well, is\n[56:17] dealing with huge amounts of uncertainty\n[56:19] when pressure is on. Sure. When your\n[56:21] life's at risk. I was reading about a\n[56:24] study, which I think you mentioned some\n[56:26] time ago, where they look at three\n[56:28] groups of people doing the same exam and\n[56:30] would were sort of trying to ascertain\n[56:32] how people make decisions with different\n[56:34] degrees of certainty and information.\n[56:36] >> Yeah. What the the study showed was\n[56:40] there were a group of students that you\n[56:42] know were taking a test in college and\n[56:45] they were told that you know they had\n[56:47] either passed or failed or they had no\n[56:49] idea whether they passed or failed. But\n[56:51] prior to that they were asked if they\n[56:52] would you know take a vacation and the\n[56:55] people who passed and the people who\n[56:56] failed there was a higher percentage of\n[56:59] them who chose to take a vacation after\n[57:01] getting news that they had either passed\n[57:04] college or failed college. the group\n[57:06] that didn't know, there was a third\n[57:07] group that was just like,\n[57:10] I'm un I'm unsure. Weren't able to\n[57:12] really make a decision and and so what\n[57:13] the what\n[57:14] >> So, just to be clear then on that third\n[57:15] group, they didn't have their exam\n[57:17] results back. So, they didn't take the\n[57:19] action to book.\n[57:20] >> They were told they were told that there\n[57:22] was some malfunction in ability to score\n[57:25] their test and they would get their\n[57:26] results at a later time.\n[57:27] >> Okay. And so then they were asked to,\n[57:30] you know, if they would also via a\n[57:32] vacation. And a farther fewer\n[57:34] percentage, I don't remember what it\n[57:35] was, but a farther uh a much less\n[57:37] percentage of them would take it than\n[57:39] the people who both passed because I\n[57:41] think there's like half the people who\n[57:43] passed or or were told they passed like\n[57:45] took the bought the vacation package. It\n[57:47] was like a vacation trip to Hawaii.\n[57:49] Around the same percentage, I believe,\n[57:51] who failed the exam bought the vacation\n[57:53] trip. But the people who couldn't decide\n[57:56] just they didn't have the cognitive\n[57:58] bandwidth to to really make a decision.\n[57:59] So the ambiguity of not knowing really\n[58:04] lessens our cognitive ability to to go\n[58:06] in a certain direction. And so when we\n[58:08] don't know where to go, we often don't\n[58:10] go anywhere.\n[58:12] >> That is a hallmark of great leaders that\n[58:13] they're able to decide even when there's\n[58:16] very low certainty.\n[58:17] >> Sure. I would think that would come\n[58:18] with, you know, the territory. I think\n[58:21] if you're if you're only a leader when\n[58:23] it's calm, then you're not really a\n[58:26] leader. You're somebody with a higher\n[58:27] salary and a title. Like leadership\n[58:29] really shows up in those type of\n[58:31] circumstances when when things are\n[58:32] uncertain. And so, you know, having the\n[58:36] ability to\n[58:39] manage things when not all the\n[58:41] information is there and doing the best\n[58:43] you can with it because, you know, often\n[58:45] times the the best decision to make is\n[58:47] the right one and the worst one is to\n[58:49] not make a decision at all. And so, if\n[58:51] you have those type of leaders who just\n[58:53] can't think through that problem, then\n[58:54] that's not a leader. I remember when I\n[58:56] spoke in Sa Paulo many years ago, Barack\n[58:58] Obama was on stage and he said that as\n[59:00] president like when he went and got bin\n[59:02] Laden in that compound in Pakistan that\n[59:05] they didn't know if Bin Laden was there,\n[59:06] they'd never visually properly ided him.\n[59:08] So he had to make that decision to risk\n[59:09] American lives with, as he said, 51%\n[59:12] certainty. Yeah.\n[59:13] >> Or very low certainty. And he says\n[59:14] that's the the thing about being\n[59:16] >> the president of the United States. You\n[59:18] make huge calls with very little\n[59:20] certainty. Yeah.\n[59:20] >> And I've always thought about that in in\n[59:22] terms of my day-to-day life. And it al\n[59:25] has made me conclude that the most\n[59:27] successful people that I've met do have\n[59:29] that ability to be low certainty and\n[59:31] make big calls.\n[59:32] >> Yeah.\n[59:32] >> Um with the peace of mind that they've\n[59:34] made that call with the best available\n[59:35] information. And then the sort of\n[59:37] inverse of that is some people listening\n[59:40] right now\n[59:41] >> with even small decisions are trying to\n[59:43] get to 100% certainty when obviously\n[59:46] 100% certainty only exists in hindsight,\n[59:48] >> you know. And that that's that's a\n[59:50] really good that's a really good point.\n[59:51] I think that's a lot of people struggle\n[59:52] with that when it comes to just just to\n[59:54] own your decision like like own it like\n[59:57] whatever you choose to do.\n[01:00:00] >> If you if you make it not under high\n[01:00:02] emotion and you do the best you can with\n[01:00:04] the information that you have at that\n[01:00:06] time make a decision like you know as\n[01:00:08] they say it's you know if you make the\n[01:00:10] wrong decision then it's experience if\n[01:00:11] you make the right decision then it's\n[01:00:12] confirmation.\n[01:00:14] >> I think about this a lot. I think about\n[01:00:15] um how maybe everyone listening could\n[01:00:18] have a conversation with themselves\n[01:00:19] about their own relationship with\n[01:00:21] uncertainty. Like how good are you\n[01:00:22] dealing with situations where you don't\n[01:00:24] have much information? Yeah.\n[01:00:25] >> Um are you the type of person that's\n[01:00:27] able to make a decision and not like sit\n[01:00:29] sit in paralysis? And many people that\n[01:00:32] come up to me in the street and say they\n[01:00:33] want a new life or a new this or a new\n[01:00:34] that are um are choosing like the\n[01:00:37] certain misery of their current life\n[01:00:40] versus the uncertainty they see as they\n[01:00:42] look out into the void of like quitting\n[01:00:44] the job and going and playing violin in\n[01:00:46] Peru or something.\n[01:00:47] >> And um you know you you you bring up you\n[01:00:51] bring up something that um so in one of\n[01:00:54] our one of our recent classes that we\n[01:00:56] taught this month, we talked about\n[01:00:57] owning decision, right? And I shared the\n[01:01:00] story with the community and it it had a\n[01:01:02] pretty profound effect. And so I was uh\n[01:01:05] as a police officer, I was on patrol. It\n[01:01:07] was late at night. I'm driving down just\n[01:01:10] this two-lane road kind of in the middle\n[01:01:12] of nowhere. And I pull over to the side\n[01:01:15] and I'm just kind of like watching from\n[01:01:17] a from an angle, just people driving up\n[01:01:19] and down this road. This car flies by,\n[01:01:22] goes through a stop sign, doesn't stop.\n[01:01:24] It's a very nice luxury sedan. So, I\n[01:01:26] turn on my lights, pull him over, and I\n[01:01:29] said, \"How you doing?\" And he's like,\n[01:01:31] \"I'm all right.\" I could tell this guy's\n[01:01:32] just like, he's flat drunk. And I shine\n[01:01:35] my light into his passenger. Uh, and\n[01:01:37] he's just like, he's passed out. Like,\n[01:01:39] he has he has he's not even coherent\n[01:01:41] that I'm probably standing there. So, I\n[01:01:43] get his driver's license and I'm like,\n[01:01:44] \"Look, you're pretty bad off.\" And he's\n[01:01:46] like, \"Are you going to call my dad?\"\n[01:01:48] And I said, \"Why would I do that?\" He\n[01:01:50] goes, \"Man,\" he goes, \"This is car.\"\n[01:01:51] He's like, \"He's going to be upset.\"\n[01:01:53] I said, \"All right.\" So, I go back to my\n[01:01:56] patrol car and I I I look at this kid in\n[01:01:58] terms of he's had no priors. He's 16. He\n[01:02:01] has no prior driving record. So, I'm\n[01:02:03] making So, what's my decision now? I can\n[01:02:05] call for a DWI unit to come and and give\n[01:02:09] this guy a fuel sobriety test and he's\n[01:02:11] going to fail just because I could tell\n[01:02:13] how drunk he was. Or I could call his\n[01:02:15] dad. Now, I have to make a decision\n[01:02:18] because I have that type of discretion.\n[01:02:20] So, I have to think, do I take this kid\n[01:02:21] to do I have this kid go to jail and tow\n[01:02:23] his dad's car,\n[01:02:25] >> or do I call his dad and hope that's the\n[01:02:28] right decision because his dad will find\n[01:02:30] a way to make sure this doesn't happen\n[01:02:32] again. So, I had our dispatch give me\n[01:02:34] his phone, his parents' phone number,\n[01:02:35] and I called his dad. It's 11:00 at\n[01:02:37] night, and his mom answers, and I'm\n[01:02:40] like, you know, um, you know, Mrs.\n[01:02:42] Smith, this is, you know, Deputy O'Neal.\n[01:02:45] Um, I'm out here with your son, Jacob.\n[01:02:49] Oh my god, how is he? I'm like, he's\n[01:02:50] fine. And I'm like, I think he's been\n[01:02:52] drinking too much and I want to know if\n[01:02:54] you want to come get him. She's like,\n[01:02:56] can you talk to my husband? I said,\n[01:02:57] sure. He gets on the phone. Same thing.\n[01:02:59] And he's like, thank you. I will make\n[01:03:01] sure this doesn't happen again. I will\n[01:03:02] be there in 5 minutes. I have no idea\n[01:03:05] what happens at the end of this. But I\n[01:03:06] made that decision at that time. The\n[01:03:09] reason I'm sharing this is because when\n[01:03:10] I told that story in our community, I\n[01:03:13] asked everybody on the platform because\n[01:03:14] it's very engaging. And I said, and Evie\n[01:03:17] asked this question actually, and she\n[01:03:18] said, \"How many of you would do the same\n[01:03:19] thing Desmond did?\"\n[01:03:20] >> Probably should give context there that\n[01:03:22] Evie is your wife.\n[01:03:23] >> Evie is my wife. I'm sorry.\n[01:03:24] >> Pumporus.\n[01:03:24] >> Yes. A lot of people put in the comments\n[01:03:26] like, \"I would do the same thing. Good\n[01:03:27] for him. The kids shouldn't go to jail.\"\n[01:03:29] And Evie was just like, \"I would do the\n[01:03:31] exact opposite thing. I would have taken\n[01:03:33] him to jail. I would have towed the car\n[01:03:36] because I don't know if the consequences\n[01:03:39] of what his dad would do is is going to\n[01:03:41] outweigh the fact that he's going to go\n[01:03:42] to jail.\" And she's like, \"What if I let\n[01:03:44] him go and he does the same thing next\n[01:03:46] week because he's not, you know, he\n[01:03:49] doesn't care what his father thinks?\"\n[01:03:51] And she's like, \"That to me was a\n[01:03:53] decision that I would have made.\" So I\n[01:03:54] bring that up for this purpose. We both\n[01:03:57] made a completely different decision. I\n[01:03:59] made it for the reasons I did. She made\n[01:04:01] it for the reasons that she did\n[01:04:03] metaphorically. Mine was true. This is\n[01:04:05] just what she said she would have done.\n[01:04:07] The point was is that we both owned it.\n[01:04:11] And a lot of times I think what happens\n[01:04:13] going back to what you just said is\n[01:04:15] people are so afraid to make a decision\n[01:04:18] for a number of different reasons and so\n[01:04:20] they just choose not to. Now again\n[01:04:22] people could look at this you know your\n[01:04:24] audience could look at this and be like\n[01:04:25] he should have taken him to jail. I\n[01:04:26] understand all of that. I had the\n[01:04:28] discretion and that's the decision I\n[01:04:30] made and I would make that decision\n[01:04:31] every time. But it's it's it's less\n[01:04:33] about that story and more about when you\n[01:04:36] decide on something with the information\n[01:04:38] you have at the moment. Do you own it or\n[01:04:40] do you as you said do you look back\n[01:04:42] later and have hindsight bias and be\n[01:04:44] like ah I should have known you can't do\n[01:04:46] that so many people try to live their\n[01:04:48] life in reverse like that and looking\n[01:04:49] back it's impossible it's impossible to\n[01:04:52] know so I do think and kind of to expand\n[01:04:55] on what you said I do think when it\n[01:04:57] talks about owning your decisions and\n[01:04:59] and being being thoughtful as it relates\n[01:05:02] to\n[01:05:04] why you're doing and what you're doing\n[01:05:06] and taking command of yourself and being\n[01:05:10] being a self leader decisions is making\n[01:05:12] that is is what it is. To go back to the\n[01:05:14] uncertainty aspects,\n[01:05:16] >> protecting your business's data is a lot\n[01:05:18] scarier than people admit. You've got\n[01:05:19] the usual protections, backup, security,\n[01:05:22] but underneath there's this\n[01:05:23] uncomfortable truth that your entire\n[01:05:25] operation depends on systems that are\n[01:05:27] updating, syncing, and changing data\n[01:05:28] every second. Someone doesn't have to\n[01:05:30] hack you to bring everything crashing\n[01:05:32] down. All it takes is one corrupted\n[01:05:33] file, one workflow that fires in the\n[01:05:36] wrong direction, one automation that\n[01:05:37] overwrites the wrong thing, or an AI\n[01:05:39] agent drifting off course, and suddenly\n[01:05:41] your business is offline, your team is\n[01:05:43] stuck, and you're in damage control\n[01:05:45] mode. That's why so many organizations\n[01:05:47] use our sponsor, Rubric. It doesn't just\n[01:05:49] protect your data. It lets you rewind\n[01:05:51] your entire system back to the moment\n[01:05:53] before anything went wrong. Wherever\n[01:05:55] that data lives, cloud, SAS, or onrem,\n[01:05:58] whether you have ransomware, an internal\n[01:06:00] mistake, or an outage, with Rubric, you\n[01:06:02] can bring your business straight back.\n[01:06:04] And with the newly launched Rubric Agent\n[01:06:06] Cloud, companies get visibility into\n[01:06:08] what their AI agents are actually doing,\n[01:06:10] so they can set guard rails and reverse\n[01:06:13] them if they go off track. Rubric lets\n[01:06:15] you move fast without putting your\n[01:06:16] business at risk. To learn more, head to\n[01:06:18] rubric.com.\n[01:06:20] Last month, I told you about our\n[01:06:22] sponsor, Function Health, and their team\n[01:06:23] who've developed a way of giving you a\n[01:06:24] full 360 view of what's going on inside\n[01:06:26] your body. They offer over 100 advanced\n[01:06:29] lab tests covering everything from\n[01:06:31] hormones, toxins, inflammation, heart\n[01:06:34] health, stress, and so much more. So,\n[01:06:36] Jack, who started this show with me, got\n[01:06:38] his first blood draw done a couple of\n[01:06:39] weeks ago. So, I thought I'd let him\n[01:06:40] tell you a little bit more about his\n[01:06:42] experience.\n[01:06:42] >> This test really opened my eyes to\n[01:06:44] personally what I should be doing with\n[01:06:45] my health. I hear a lot of information\n[01:06:47] in this podcast. I sit in every single\n[01:06:48] recording. So to know how I can relate\n[01:06:51] each one to me personally is super\n[01:06:52] valuable. You sign up and you schedule\n[01:06:54] your tests and once you're done you get\n[01:06:56] a little report like the one I have\n[01:06:57] here. I can see my inrange results, my\n[01:06:59] out of range results. And there's a\n[01:07:01] little AI function, too. So if I have\n[01:07:03] any questions about my out of range\n[01:07:04] results, I can just go in there and ask\n[01:07:07] it any question I want. And these tests\n[01:07:08] are backed by doctors and thousands of\n[01:07:10] hours of research.\n[01:07:11] >> You get an annual draw done and a\n[01:07:13] mid-year follow-up. So, if you want to\n[01:07:14] learn more, head over to\n[01:07:15] functionhealth.com/doac\n[01:07:17] where you can sign up for $365 a year.\n[01:07:20] I'll put the link in the description\n[01:07:21] below. It is just $1 a day for your\n[01:07:24] health\n[01:07:26] of that research you've done on\n[01:07:28] communication.\n[01:07:31] Is there anything we haven't talked\n[01:07:32] about today that really surprised you in\n[01:07:34] the research that really caused a\n[01:07:37] paradigm shift in what you thought\n[01:07:38] communication was and now what you think\n[01:07:40] it is? Yeah, the research showed that\n[01:07:43] your ability to build rapport with a\n[01:07:46] person\n[01:07:48] is what gives you the most power in\n[01:07:51] terms of that connection. And different\n[01:07:52] people, you know,\n[01:07:53] >> and how do you build rapport?\n[01:07:55] >> Most people think that this is one of\n[01:07:57] those things where you're just you're\n[01:08:00] just you're overly kind, you're very\n[01:08:02] complimentary,\n[01:08:03] uh you're talking about the weather, and\n[01:08:05] now we've built rapport and then we're\n[01:08:06] good. It's not how you build rapport. re\n[01:08:09] building rapport is understanding values\n[01:08:10] in terms of a person. Rapport is\n[01:08:12] understanding, you know, a person's\n[01:08:14] presence and what they're needing from\n[01:08:16] you. If I'm paying attention to you and\n[01:08:19] I'm engaged with you and I'm making you\n[01:08:21] feel seen and heard and understood and\n[01:08:24] by proxy, by the reciprocity of doing\n[01:08:27] that, you do the same thing for me.\n[01:08:30] That's rapport. When it comes into\n[01:08:34] building rapport with somebody, read the\n[01:08:37] room. If I came in and I have a list of\n[01:08:40] questions and I see you that you're\n[01:08:44] there's some emotional state that you're\n[01:08:45] showing. If I want to connect with you,\n[01:08:48] I ask about that. I need to put my stuff\n[01:08:50] aside before I can have the conversation\n[01:08:52] I want to have. I probably have to have\n[01:08:54] the conversation you want to have. And\n[01:08:56] at that moment, it may be understanding\n[01:08:58] what is going on in your headsp space. I\n[01:09:00] can say, \"Hey, Stephen, you know, I'm\n[01:09:02] Desmond O'Neal. You know, I know you\n[01:09:03] were brought in this morning for for\n[01:09:05] these reasons. It's obvious to me right\n[01:09:07] now that you seem really upset. Can you\n[01:09:09] tell me what's going on right now?\" And\n[01:09:12] you could say, you know, I don't know\n[01:09:14] what's going on. I'm super scared. I've\n[01:09:16] never been in jail before. My mom's sick\n[01:09:18] at home and I don't know if there's\n[01:09:19] anybody to take her to her. Now, how\n[01:09:20] much information now do I have, by the\n[01:09:22] way, that I can connect with you?\n[01:09:23] Because if you tell me, I am freaked\n[01:09:25] out. I don't know what's going on. What\n[01:09:27] do I now do? Do I go back to be like,\n[01:09:29] \"Well, that sucks.\" And go back to my\n[01:09:30] list of questions. Or do I say, \"How\n[01:09:33] best can I help you with that?\"\n[01:09:35] >> And this builds rapport.\n[01:09:36] >> Yes. Because what I'm doing is I'm\n[01:09:38] showing empathy. I'm listening to you.\n[01:09:40] I'm I'm giving you what you want. I'm\n[01:09:42] lessening your ambiguity. I'm orienting\n[01:09:44] you in terms of the direction that\n[01:09:46] you're asking me to take you. You're\n[01:09:48] asking me for clarity in terms of what's\n[01:09:49] going to happen. I'm going to answer\n[01:09:51] that. I'm showing them that I am paying\n[01:09:53] attention to them. I'm being authentic.\n[01:09:54] I'm going to follow up with the things\n[01:09:56] that I do cuz I'm going to come back\n[01:09:57] later and be like, \"Hey, we checked on\n[01:09:59] your mom. She was good. We pulled your\n[01:10:00] aunt in. Your aunt came and took care of\n[01:10:02] her. If anything else comes up, let me\n[01:10:04] know. I do have some questions that I\n[01:10:05] need to get to. This is important part\n[01:10:06] of the investigation, but I I can only\n[01:10:08] imagine that there's a lot on your mind\n[01:10:10] and if things come up through our\n[01:10:11] conversation, please please ask me.\"\n[01:10:14] >> That's rapport.\n[01:10:15] >> In those situations, I'm hearing many of\n[01:10:17] the things that I read in that book,\n[01:10:18] Influence by Robert Caldini,\n[01:10:19] >> Chaldini,\n[01:10:20] >> Chaldini, I'm hearing reciprocity. Yep.\n[01:10:22] >> You've done them a favor. So now they're\n[01:10:24] more likely to answer your questions.\n[01:10:26] >> Reciprocity is\n[01:10:30] giving somebody something with with the\n[01:10:33] the expectation that somewhere in the\n[01:10:35] future they will give you something\n[01:10:36] else. It's not a transactional thing.\n[01:10:38] It's not like the only reason I'm doing\n[01:10:40] this is because I want something from\n[01:10:43] you in exchange. That's transaction.\n[01:10:47] >> So So when you checked on that person's\n[01:10:49] mom, that was reciprocity.\n[01:10:52] That was me following up with a\n[01:10:53] commitment of saying that this is what\n[01:10:55] I'm going to do for you. You can do with\n[01:10:56] it what you want.\n[01:10:57] >> But you know that doing that is going to\n[01:10:59] increase the probability that they\n[01:11:01] answer your questions.\n[01:11:02] >> Knowing I do that regardless. I could\n[01:11:04] have he could have said, \"You know what?\n[01:11:06] I I appreciate you. Thank you for\n[01:11:08] checking on my mom. Um I I want a\n[01:11:11] lawyer. I don't want to talk to you.\"\n[01:11:12] You know what I'm going to do? I'm going\n[01:11:13] to check on his mom. You know why?\n[01:11:15] Because that's what I said I was going\n[01:11:16] to do. You know why? Because that's my\n[01:11:18] self- congruence. That's what I do as a\n[01:11:20] person. When I give somebody my word,\n[01:11:21] I'm going to follow up with it. So, in a\n[01:11:23] situation like that, I will do those\n[01:11:25] things because that's what he he's\n[01:11:26] that's what I've told him I'm going to\n[01:11:28] do.\n[01:11:29] >> Is there anything else on um on the\n[01:11:30] point of having difficult conversations\n[01:11:32] that we haven't covered in your mind?\n[01:11:34] Cuz I know there's loads of people that\n[01:11:36] they want to get better at having those\n[01:11:38] tricky conversations and also just\n[01:11:39] dealing with a theme we see a lot is\n[01:11:41] like people very keen to deal with\n[01:11:43] difficult people. Is there anything\n[01:11:45] there that we haven't touched on? We've\n[01:11:46] got the plan framework, but just just\n[01:11:49] want to check there's nothing we've\n[01:11:50] missed.\n[01:11:50] >> No, I just think it was I just think it\n[01:11:52] was a plan framework. And it's not about\n[01:11:54] making things complicated. It's actually\n[01:11:55] about, you know, there's there's things\n[01:11:57] that you should take out, you know, when\n[01:11:59] it comes to communication as opposed to\n[01:12:02] always adding things in. You know, it\n[01:12:05] really becomes like extinction before\n[01:12:07] acquisition. So, I can I can tell you\n[01:12:09] when it comes to better communication,\n[01:12:11] there are three things that you should\n[01:12:12] stop doing right now. One of them is to\n[01:12:15] stop trying to be right.\n[01:12:18] One of them is to stop telling people\n[01:12:19] you understand. And the third one is\n[01:12:22] stop giving people your unsolicited\n[01:12:24] opinion. Now to break those down, stop\n[01:12:27] stop trying to be right. And we talked\n[01:12:29] about that one a little bit. The the\n[01:12:30] second one is stop telling people that\n[01:12:33] you understand. This is what I mean by\n[01:12:35] that. You can understand you can\n[01:12:36] understand a person's words. You will\n[01:12:39] never understand their headsp space in\n[01:12:40] terms of the the specificity of that.\n[01:12:43] And so what you will see is I if if\n[01:12:46] you're sharing a story like if you\n[01:12:47] shared a personal story with me let's\n[01:12:49] say you let's say your father had passed\n[01:12:51] away and I'm like you know what Stephen\n[01:12:52] I completely understand um my dad passed\n[01:12:55] away too when I was young so now we're\n[01:12:57] connected I have just\n[01:13:01] I've just taken away\n[01:13:04] that moment for you because I made it\n[01:13:05] about me because I I thought that I\n[01:13:08] understood something that you had\n[01:13:09] experienced in fact your experience of a\n[01:13:12] death or your experience of your father\n[01:13:13] at the moment is going to be completely\n[01:13:15] different than mine. But for me to tell\n[01:13:17] you that I understand is is\n[01:13:19] shortsighted. My girlfriend tells me\n[01:13:22] sometimes that she wants me to say that\n[01:13:23] I understand.\n[01:13:25] And I think what she's saying is that\n[01:13:27] maybe she wants to feel understood\n[01:13:31] and so she might be explaining how she\n[01:13:32] feels and then if I say do you know I\n[01:13:35] yeah know I do understand but do you?\n[01:13:39] Sometimes I get to the point where I I\n[01:13:40] do understand what she's saying.\n[01:13:42] >> You [clears throat] understand what\n[01:13:43] she's saying, but do you understand how\n[01:13:44] she truly feels?\n[01:13:45] >> No.\n[01:13:45] >> Okay. But that becomes\n[01:13:46] >> because I don't feel that.\n[01:13:47] >> You don't feel it.\n[01:13:48] >> But she just wants me to acknowledge.\n[01:13:49] >> She wants you to acknowledge it. So the\n[01:13:50] difference is in terms of it was being\n[01:13:52] genuine where you're like, look, I I\n[01:13:53] really understand how you feel. You\n[01:13:55] probably don't.\n[01:13:56] >> How do I make her feel understood in\n[01:13:57] that regard then without telling her I\n[01:13:59] understand?\n[01:14:01] >> To feel understood is to is to listen to\n[01:14:04] her to be like look, you know, I it\n[01:14:06] sounds it sounds tough. sounds, you\n[01:14:08] know, like this is something really on\n[01:14:10] your mind. Like, and it kind of goes\n[01:14:11] into our other thing. We're like, \"Stop\n[01:14:12] giving people your opinion.\" You know,\n[01:14:14] if she's if she's expressing things to\n[01:14:15] you and she's sharing how she wants to\n[01:14:17] feel, she's probably not looking for you\n[01:14:19] to tell her what to do unless she's\n[01:14:20] asked you for that. The first thing that\n[01:14:22] we always do, and it happens all the\n[01:14:23] time, is like, \"Let me tell you what I\n[01:14:25] think.\n[01:14:26] >> Try to fix it without having all of the\n[01:14:28] the emotions and the complexities of of\n[01:14:31] why it's not being done.\" And so to go\n[01:14:34] back to with your girlfriend, it really\n[01:14:35] is just a matter of trying to\n[01:14:36] understand, seeing where she's going\n[01:14:38] with it, asking her, you know, if there\n[01:14:40] ways that that, you know, we can we can\n[01:14:42] work to make it better or help you with\n[01:14:44] this. But as Stephen, she's just like, I\n[01:14:45] I want you to understand. I would just\n[01:14:47] tell her, I understand, just because\n[01:14:49] that's what she's looking for. You're\n[01:14:50] not going to have it in there. But if\n[01:14:52] you generally went to somebody and\n[01:14:54] you're like, oh, I understand. That's\n[01:14:55] what I'm asking you not to do. That's\n[01:14:57] what you shouldn't do. You shouldn't\n[01:14:59] generally think that you truly\n[01:15:00] understand another person because then\n[01:15:01] you're going like you're convinced that\n[01:15:02] you know and you're no longer curious in\n[01:15:04] terms of how they actually feel.\n[01:15:08] >> And on that last point about giving\n[01:15:09] giving the opinion, a lot of time\n[01:15:11] people, you know, when they're sharing\n[01:15:14] something, they just want you to create\n[01:15:16] the space. Simon Synynic said to me, he\n[01:15:18] goes, \"Most of the time people just want\n[01:15:20] you to sit in the mud with them.\"\n[01:15:21] >> [clears throat]\n[01:15:21] >> And like I I naturally show up with like\n[01:15:23] my toolbox to try and fix the situation.\n[01:15:25] But a lot of the time, especially with\n[01:15:26] my my girlfriend, maybe she just wants\n[01:15:27] me to listen. Most people do, right? It\n[01:15:31] becomes like this identity headsp space\n[01:15:32] where people just are looking for the\n[01:15:34] sounding board for you, for your\n[01:15:36] girlfriend. Like you're the you're the\n[01:15:37] guy, you're the person, and that's what\n[01:15:39] she comes to you for. That's your job in\n[01:15:40] a lot of ways. And I don't mean that in\n[01:15:42] a negative thing, but it's just one of\n[01:15:43] those things where if that's what she\n[01:15:44] needs from you, then that's what you\n[01:15:46] give her. And a lot of people just want\n[01:15:47] as as as Simon Senk said where you said\n[01:15:49] it like just sit in the mud with them\n[01:15:50] and that's what they're asking you. If\n[01:15:51] she turns to you and say Stephen what\n[01:15:53] would you do here then she's asking you\n[01:15:56] but if not then don't give it\n[01:15:59] >> something I need to work on.\n[01:16:01] >> Yeah we all do.\n[01:16:02] >> Yeah cuz you cuz you I don't know\n[01:16:04] something about maybe the male brain but\n[01:16:06] it's probably not just men.\n[01:16:08] >> Can I talk real quick just about our\n[01:16:09] training community before we go? Is that\n[01:16:11] okay with you?\n[01:16:11] >> Yeah. because it is one of those where\n[01:16:14] like now uh what I spend all my time\n[01:16:16] with is is I'm an instructor for Beyond\n[01:16:19] Bulletproof which is a training platform\n[01:16:21] that that Evie and I that E and I host\n[01:16:23] and it really comes down to three prongs\n[01:16:27] of how do people helping people think,\n[01:16:30] helping people act, and helping people\n[01:16:32] leave with purpose. And I know we talked\n[01:16:33] about those things, but the reason I\n[01:16:35] bring that up is because there are so\n[01:16:37] many people, Stephen, that just as you\n[01:16:38] had talked about, they're they're\n[01:16:40] looking for they're looking for some\n[01:16:42] help. They're looking for some clarity.\n[01:16:43] They're looking for somebody to\n[01:16:45] influence them in some way because they\n[01:16:47] don't have good emotional regulation and\n[01:16:49] they're trying to get better in their\n[01:16:50] relationships. We've been fortunate to\n[01:16:52] to have that and that's kind of where,\n[01:16:54] you know, I don't I don't do a lot of\n[01:16:56] social media, you know, I don't do uh a\n[01:16:58] lot of other other things because I\n[01:17:00] spend my time here. As you know, we have\n[01:17:02] a closing tradition on the podcast, but\n[01:17:04] the last guest leaves a question for the\n[01:17:05] next. And the question that's been left\n[01:17:06] for you is,\n[01:17:09] what decision do you most regret? And\n[01:17:12] would things have turned out better if\n[01:17:15] you had made it differently?\n[01:17:18] Ouch, that's a spicy one. So\n[01:17:22] I\n[01:17:26] as much as this wants to be a spicy one,\n[01:17:28] I can I can categorically tell you that\n[01:17:30] there's not a decision that I've made\n[01:17:32] that I wish I would have made different.\n[01:17:34] And I say that because it kind of goes\n[01:17:35] back to I own my decisions in terms of\n[01:17:39] the things that I have done. I even when\n[01:17:40] the story that I shared about, you know,\n[01:17:41] when I was a police officer with the kid\n[01:17:43] who was drinking, like I own those\n[01:17:44] decisions. And in truth, like all of\n[01:17:48] those decisions have manifested itself\n[01:17:50] for me to sit down here with you today\n[01:17:52] and have this conversation. And so I\n[01:17:54] can't tell you that there's something\n[01:17:55] that I look back that I regret because I\n[01:17:57] think that there's things we learn from.\n[01:17:58] But I think for the most part, I don't\n[01:18:00] use hindsight bias. I don't look back to\n[01:18:02] say I wish there was something else. I\n[01:18:03] use those things to uh to grow and to\n[01:18:06] learn and be better. And you know, had I\n[01:18:08] made a difference decision, maybe you\n[01:18:09] and I wouldn't be sitting here. So none.\n[01:18:11] >> But you still I mean, if someone asked\n[01:18:13] me that, I'd have loads of answers. Like\n[01:18:15] what?\n[01:18:16] >> Just like the ways that I handled\n[01:18:17] situations in my life as an employee.\n[01:18:19] You know, I shouldn't shouldn't have\n[01:18:20] said that. I shouldn't have done that. I\n[01:18:22] you know, when my girlfriend said that,\n[01:18:23] do you know, I should have just listened\n[01:18:25] and I wish I had because I think our\n[01:18:27] relationship would be better or\n[01:18:29] you know, some grudge I held or\n[01:18:31] whatever, you know, like the the\n[01:18:33] messiness of being a emotional human. So\n[01:18:36] let me let me ask this and I think you\n[01:18:39] know I I do question at times that that\n[01:18:43] type of I wish and I regret I think that\n[01:18:45] also changes\n[01:18:47] who you are as a person if you're like I\n[01:18:49] would have gone back and done we we can\n[01:18:51] all do that in some and I don't mean\n[01:18:53] that's petty but in all some petty way\n[01:18:55] when I was writing my my thesis I would\n[01:18:57] always come to my thesis adviser and\n[01:18:58] she'd be like nope this isn't good this\n[01:19:00] isn't good this isn't good and so when I\n[01:19:02] was done there was like I had like 30 p\n[01:19:04] she's like just put this in the parking\n[01:19:06] lot. Like maybe we'll look at this,\n[01:19:07] maybe we won't. So when I was done with\n[01:19:08] my thesis, I had 30 pages that were in\n[01:19:11] the parking lot. And I went to her and I\n[01:19:12] I feel like this is a lot of mistakes.\n[01:19:14] And she goes, you had to have this to\n[01:19:17] have this. And so when when I hear that\n[01:19:20] when it's just like, oh, I wish I would\n[01:19:22] have done these things different. You\n[01:19:23] would be a different person, right? It's\n[01:19:25] all those perspectives. It's all those\n[01:19:26] little things that you code and become a\n[01:19:28] different person. You would be a\n[01:19:29] different person if you had done those\n[01:19:30] things differently. I'm not saying\n[01:19:31] better or worse, but I'm saying I don't\n[01:19:33] I don't think that's a reason to look\n[01:19:35] back and regret things.\n[01:19:36] >> Yeah, I probably would still have those\n[01:19:38] mistakes in my future if I hadn't made\n[01:19:39] them in the past as well. So maybe maybe\n[01:19:41] the very fact that I can identify them\n[01:19:43] means that my self-awareness grew based\n[01:19:46] on them. I like I'm never going to treat\n[01:19:48] someone like that again or I'm never\n[01:19:49] going to say that thing again because I\n[01:19:51] learned the lesson. So I'm a better\n[01:19:52] person\n[01:19:53] >> today because of that.\n[01:19:55] >> Yeah.\n[01:19:56] >> Desmond, thank you.\n[01:19:57] >> Thank you. Thank you so much for doing\n[01:19:58] what you do and uh this is your you said\n[01:20:00] this is your first podcast which is\n[01:20:02] exciting.\n[01:20:02] >> It's my first podcast.\n[01:20:03] >> Thank you so much.\n[01:20:04] >> Thank you. [music]\n[01:20:08] >> If there's anything we need, it is\n[01:20:10] connection, especially in the world\n[01:20:12] we're living in today. And that is\n[01:20:14] exactly why we created these\n[01:20:15] conversation cards. Because on this\n[01:20:17] show, when I sit here with my guests and\n[01:20:19] have those deep, intimate conversations,\n[01:20:21] this remarkable thing happens time and\n[01:20:23] time again. We feel deeply connected to\n[01:20:26] each other. At the end of every episode,\n[01:20:28] the guest I'm interviewing leaves a\n[01:20:30] question for the next guest and we've\n[01:20:31] turned them into these conversation\n[01:20:33] cards. And we've added these twist cards\n[01:20:35] to make your conversations even more\n[01:20:37] interesting. And there are so many more\n[01:20:39] twists along the way with the\n[01:20:41] conversation cards. This is the brand\n[01:20:42] new edition. And for the first time\n[01:20:43] ever, I've added to the pack this gold\n[01:20:45] card, which is an exclusive question\n[01:20:48] from me. But I'm only putting the gold\n[01:20:50] cards in the first run of conversation\n[01:20:53] cards. So get yours now before the\n[01:20:55] limited edition gold cards are all gone.\n[01:20:57] Head to the link in the description\n[01:20:58] below. [music]\n[01:21:06] [music]\n[01:21:15] >> [singing]\n[01:21:17] [music]",
  "transcript_source": "youtube_captions",
  "has_timestamps": true
}