{
  "video_id": "Oipkl53n938",
  "channel": "The Diary Of A CEO",
  "channel_slug": "the-diary-of-a-ceo",
  "title": "THIS Is The Fastest Way To Get Dementia...The 6 Science-Backed Brain Fixes!",
  "date": "2025-12-26",
  "upload_date": "20251226",
  "duration": 3916,
  "url": "https://www.youtube.com/watch?v=Oipkl53n938",
  "chapters": [
    {
      "title": "Intro",
      "start_time": 0.0,
      "end_time": 63.0
    },
    {
      "title": "Effects of Exercise on the Brain",
      "start_time": 63.0,
      "end_time": 368.0
    },
    {
      "title": "How to Improve Speaking Skills and Memory",
      "start_time": 368.0,
      "end_time": 466.0
    },
    {
      "title": "Effects of Coffee on the Brain",
      "start_time": 466.0,
      "end_time": 560.0
    },
    {
      "title": "What Destroys Your Brain?",
      "start_time": 560.0,
      "end_time": 711.0
    },
    {
      "title": "Impact of Social Relationships on the Brain",
      "start_time": 711.0,
      "end_time": 804.0
    },
    {
      "title": "Effects of Creatine on the Brain",
      "start_time": 804.0,
      "end_time": 1173.0
    },
    {
      "title": "Creatine for Sleep",
      "start_time": 1173.0,
      "end_time": 1351.0
    },
    {
      "title": "Creatine Loading Myths",
      "start_time": 1351.0,
      "end_time": 1520.0
    },
    {
      "title": "Creatine for Depression",
      "start_time": 1520.0,
      "end_time": 1627.0
    },
    {
      "title": "Neuroplasticity Explained",
      "start_time": 1627.0,
      "end_time": 2163.0
    },
    {
      "title": "The Role of Nitric Oxide in the Brain",
      "start_time": 2163.0,
      "end_time": 2672.0
    },
    {
      "title": "Habits That Are Good for the Brain",
      "start_time": 2672.0,
      "end_time": 2922.0
    },
    {
      "title": "Is Loving Your Job Good or Bad for Your Brain?",
      "start_time": 2922.0,
      "end_time": 3030.0
    },
    {
      "title": "Bad Things for Brain Health",
      "start_time": 3030.0,
      "end_time": 3109.0
    },
    {
      "title": "Does Hearing Loss Lead to Alzheimer’s?",
      "start_time": 3109.0,
      "end_time": 3192.0
    },
    {
      "title": "Effects of AI on the Brain",
      "start_time": 3192.0,
      "end_time": 3258.0
    },
    {
      "title": "Natural Remedies for Brain Health",
      "start_time": 3258.0,
      "end_time": 3476.0
    },
    {
      "title": "Rosemary Effects on Brain Health",
      "start_time": 3476.0,
      "end_time": 3629.0
    },
    {
      "title": "Benefits of Dark Chocolate",
      "start_time": 3629.0,
      "end_time": 3916
    }
  ],
  "transcript": "[00:00] I think everybody needs to listen to\n[00:01] this episode if they want to start 2026\n[00:04] properly. If there's one thing I've\n[00:06] learned that's really stayed with me\n[00:07] this year, it's from speaking to some of\n[00:09] the world's leading minds about our\n[00:11] brain, which might just be the most\n[00:13] powerful asset that we all have. You\n[00:15] know, if you listen to the Diary of a\n[00:16] SEO, you're probably listening because\n[00:17] you're trying to get something, whether\n[00:19] it's information, inspiration, maybe\n[00:20] entertainment, all of which because\n[00:22] you're striving towards some kind of\n[00:23] goal. And it's dawned on me this year\n[00:25] because I've interviewed so many\n[00:26] incredible neuroscientists that this all\n[00:28] starts with having a healthy brain.\n[00:29] Because all of our thoughts, our\n[00:30] feelings, our relationships, our\n[00:32] memories, our chance of having a future\n[00:34] start in the brain. So, in this special\n[00:37] Christmas episode, we're going to focus\n[00:39] on the brain. How you can have the most\n[00:42] fundamentally healthy brain so you can\n[00:45] live the most fundamentally meaningful\n[00:46] life. I've been through all the episodes\n[00:48] where we've talked about the brain and\n[00:49] I've looked at the moments that you\n[00:51] shared and replayed the most. and the\n[00:53] moments that added the most value to\n[00:54] your life. And I've put all of them into\n[00:57] this episode today.\n[01:03] >> Do you remember the first time you saw a\n[01:05] human brain?\n[01:06] >> I do.\n[01:07] >> Did it change how you think about your\n[01:08] own brain?\n[01:10] >> It changed my life because I was like, I\n[01:15] want to study that. That is the coolest\n[01:17] thing that I've ever seen in my whole\n[01:20] life. It was life-changing.\n[01:23] >> I say that because we, you know, at the\n[01:24] start of this conversation, we said that\n[01:26] most of us don't appreciate our brain. A\n[01:27] lot of people don't even realize it's\n[01:29] there. But the minute I had a brain scan\n[01:31] one day, and that brain scan\n[01:33] >> really changed my life because seeing my\n[01:35] own brain for the first time,\n[01:37] >> it was the push that I needed\n[01:39] >> to start caring more about how my\n[01:41] decisions and behaviors are impacting\n[01:42] it. So, let's talk about how I can make\n[01:44] that ball of tofu in my head, super\n[01:46] healthy, big, fat, and fluffy. You you\n[01:48] talked about exercise earlier on, but we\n[01:50] didn't really dig dig into exactly what\n[01:52] you mean by exercise cuz exercise, I\n[01:54] think, is multifaceted in its\n[01:56] definition. What kind of exercise should\n[01:58] I be doing to make my ball of tofu in my\n[02:01] head great?\n[02:03] >> Yeah.\n[02:04] >> Optimal.\n[02:04] >> Mhm. Well, all the research shows that\n[02:08] the best kind of exercise that you can\n[02:10] do is anything that gives you aerobic\n[02:13] activity that is getting your heart rate\n[02:16] up. So that that goes for, you know,\n[02:18] power walking will get your heart rate\n[02:20] up. So soccer, so many different things.\n[02:23] Name your activity. So many people want\n[02:25] to say, \"Oh, my favorite activity, will\n[02:27] that work?\" And I always just say, \"Is\n[02:29] it is your heart rate up when you're\n[02:30] doing it?\" If the answer is yes, then\n[02:32] yeah, that that works great. We know\n[02:34] that that level of aerobic activity is\n[02:37] critical because that's going to release\n[02:39] that growth factor maximally to get into\n[02:42] your hippocampus. Uh that will grow\n[02:44] those new brain cells. how much?\n[02:47] >> So, um I have an answer to that. So, um\n[02:50] we did two different experiments in my\n[02:52] lab. One in um low fit people, people\n[02:55] that are really not exercising very much\n[02:57] at all, less than 30 minutes um um in\n[03:00] the last three three weeks you you've uh\n[03:03] moved your body. And um we asked what\n[03:07] could we see any behavioral improvement\n[03:10] in your memory function from your\n[03:12] hippocampus or your uh ability to shift\n[03:14] and focus attention if we ask you to\n[03:17] move your body in an aerobic way for two\n[03:20] to three times a week and we\n[03:22] collaborated with a spin class. So\n[03:24] clearly very aerobic. And what we found\n[03:26] was in those people that did\n[03:29] successfully do two to three times a\n[03:32] week of 45minute aerobic activity, their\n[03:35] mood got significantly better, their\n[03:38] memory function got better, and their\n[03:41] ability to shift and focus attention got\n[03:43] significantly better. So that gives a\n[03:45] little bit of a guideline for low fit\n[03:47] people. Two to three times a week can\n[03:50] start to give you some of those some of\n[03:52] those cognitive changes. But you don't\n[03:55] look low fit. So let me let me answer\n[03:57] the question you're about to ask me with\n[03:58] like what about me? I I exercise pretty\n[04:00] regularly and um how much how much do I\n[04:04] need? So to answer that question, we\n[04:06] went to another spin studio and we said\n[04:09] look, we're going to give you free\n[04:10] classes. You could exercise as much as\n[04:12] you want in this in this um at this\n[04:15] studio and uh um go up to seven times a\n[04:19] week. And the control was just stay the\n[04:22] same. You know, you they were they were\n[04:23] working out twice a week at at the\n[04:25] studio\n[04:25] >> and Troll was the other group that what\n[04:27] you were testing them against.\n[04:28] >> Yes. Exactly.\n[04:29] >> And so what we found was\n[04:32] basically every drop of sweat counted.\n[04:35] The more you exercise, the more change\n[04:38] in your brain. We noted both your\n[04:40] hippocample function, prefrontal\n[04:42] function, and mood. if you you were\n[04:45] already getting benefit, you know,\n[04:47] you're already going twice a week, but\n[04:49] the more you did, the more brain changes\n[04:51] you got. So that that doesn't give the\n[04:55] formula that I would like, but we were\n[04:57] heading in that direction, which is part\n[04:59] of one of the questions that I want to\n[05:01] answer. But I love to leave people with\n[05:03] the idea that every drop of sweat counts\n[05:07] for building your brain into the big fat\n[05:09] fluffy brain that you really want.\n[05:12] And then in the real world, again,\n[05:15] making it super um real for people.\n[05:18] >> Yeah.\n[05:18] >> How how does that change how I show up?\n[05:21] >> Yeah. if you allow it to should have a\n[05:24] beautiful effect on your mindset. Um\n[05:27] that your mindset around um\n[05:31] how often should I take wake up and 30\n[05:35] minutes early and do that walk before I\n[05:38] start my day or uh accept the the\n[05:40] invitation to go uh walk the dog with\n[05:43] with a neighbor. Um it's not an\n[05:45] obligation. It is something that you're\n[05:47] doing for yourself. It is going to have\n[05:50] direct benefits on that ball of tofu, as\n[05:53] you call it, in your head. It's going to\n[05:55] make it work better. And and I mean, I\n[05:58] think the most immediate thing that I\n[06:00] benefit from every single day is the\n[06:02] mood boost that you get from that\n[06:05] serotonin, dopamine, nor adrenaline that\n[06:07] gets released every time you move your\n[06:08] body.\n[06:08] >> I always think that because obviously I\n[06:10] do a lot of podcasting and it's I'm\n[06:12] super reliant on my brain being attached\n[06:14] to my mouth and sometimes I notice that\n[06:15] it's not. You know what I mean? like\n[06:17] sometimes I'm notic\n[06:26] from from your and also I speak on stage\n[06:28] sometimes. So I've often asked myself\n[06:30] cuz I saw Tony Robbins\n[06:31] >> the speaker one day on a trampoline\n[06:34] before he goes up on stage.\n[06:35] >> I ask myself okay should I be doing a\n[06:38] workout in my green room before I go up\n[06:40] on stage for a big talk or presentation?\n[06:42] >> You think I should?\n[06:43] >> Oh yeah absolutely. What's the basis of\n[06:45] that in science and neuroscience?\n[06:46] >> Uh it's the basis is that immediate\n[06:49] effect. So there's three key effects\n[06:51] that we know happen every time you move\n[06:53] your body. First one is mood. You're\n[06:55] going to get your dopamine, your\n[06:56] serotonin up. Um second is focus and\n[06:59] attention. So so a single workout isn't\n[07:02] going to make more synapses in your\n[07:04] prefrontal cortex, but the prefrontal\n[07:06] cortex uses dopamine. And so um it's\n[07:09] clear that even a single workout can\n[07:12] make your prefrontal cortex work better\n[07:14] in terms of focus and attention. Also\n[07:16] very important anytime you're speaking.\n[07:17] And the third is reaction time. Your\n[07:19] reaction time, you know, motor your your\n[07:22] your working your motor cortex when you\n[07:24] move your body. And your response and\n[07:27] reaction time is significantly shorter\n[07:30] after a even a single workout compared\n[07:33] to if you just don't work out and sit\n[07:35] sit um alone. So great great things to\n[07:39] do. A great thing to do before you you\n[07:40] stand up and speak.\n[07:41] >> What about coffee?\n[07:46] >> I I I'm trying to figure out if coffee\n[07:48] is good for my brain, bad for my brain.\n[07:51] I've had a couple of mixed messages\n[07:53] around the impact it might be having.\n[07:55] >> Yeah. You know, caffeine is a stimulant\n[07:58] and uh people respond to that kind of\n[08:01] stimulant uh in different ways. Over\n[08:03] stimulation with caffeine is is not good\n[08:06] for your be able your ability to put\n[08:08] words together. You know, this is where\n[08:10] I turn to a a main theme in in my book\n[08:15] healthy brain happy life with this which\n[08:16] is self-experimentation\n[08:18] for you. How what can you titrate your\n[08:22] coffee to see what level of coffee is\n[08:26] best for whatever your podcast or you're\n[08:29] giving a talk? The other thing that can\n[08:31] work similarly to coffee that that I've\n[08:34] started uh and that I do every morning\n[08:37] is um hot cold contrast showers because\n[08:40] that cold that you shower on yourself\n[08:43] after the heat um stimulates adrenaline\n[08:47] in you. a natural adrenaline. It wakes\n[08:51] you up and okay, it was painful the\n[08:53] first kind of few times I tried it, but\n[08:56] then you get addicted to it and I have\n[08:58] forgotten to do it and gotten back in\n[09:01] the shower just to douse myself with\n[09:03] cold water because I feel better when I\n[09:06] do that for for you know first thing in\n[09:08] the morning. So, lots of different\n[09:11] things that one can explore with. Okay,\n[09:14] on the other side of the coin then, what\n[09:15] are some of the central behaviors that\n[09:18] people do that destroy their brain?\n[09:22] >> Well, sedentary behavior is one of them.\n[09:25] Um, not getting enough sleep is\n[09:28] critical. We haven't talked about sleep\n[09:30] yet. Sleep is so important for normal\n[09:33] functioning of the brain. I like to\n[09:36] scare my students by saying that um you\n[09:39] know in torture situations if you\n[09:41] deprive a person of sleep for too long\n[09:43] they literally die. They they they die.\n[09:46] You cannot function if you are deprived\n[09:48] of sleep for too many hours in a row.\n[09:51] It's that critical. Yet we don't we we\n[09:53] happily, you know, watch too much\n[09:55] Netflix at night and and and and get\n[09:57] only 5 hours of sleep when we could have\n[09:59] had eight. So um what's happening\n[10:02] exactly? Why is it so important? Well,\n[10:04] there's um there's so many different\n[10:06] things. I'm gonna I'm gonna say two. One\n[10:08] is that we know that in regular um um\n[10:13] healthy sleep, there is activity in the\n[10:15] hippocampus that helps you strengthen\n[10:18] the memories that you have formed in\n[10:20] that previous day. It's called\n[10:22] consolidation and it's so important. If\n[10:24] you shorten that, if you don't get\n[10:26] enough, you are not consolidating your\n[10:29] normal everyday memories. And second, it\n[10:32] is uh the time during sleep when all the\n[10:35] metabolites, all that garbage that your\n[10:38] brain is producing because all\n[10:39] biological cells produce garbage, it\n[10:42] gets kind of um cleaned up um through\n[10:45] the cerebral spinal fluid that that is\n[10:47] flowing through your brain. And if you\n[10:49] do not get enough sleep, you build up\n[10:52] garbage metabolites in your brain. It's\n[10:54] like you have a gunky brain. And do you\n[10:56] feel like I feel like I have gunk in my\n[10:58] brain when I don't sleep enough. That is\n[11:00] exactly what is what is happening.\n[11:02] >> Well, when you think about um things\n[11:03] that we consume, you know, like food and\n[11:06] drink and alcohol and all these kinds of\n[11:09] things, is there is there anything that\n[11:10] if I'm trying to have an optimal brain,\n[11:12] I should be\n[11:12] >> Yeah.\n[11:13] >> having or not having?\n[11:14] >> Yeah. Well, so um I think the most\n[11:18] evidence is around the benefit of the\n[11:22] Mediterranean diet which is basically\n[11:25] all healthy uh um kind of organic not\n[11:28] organic but nonprocessed is the word I\n[11:31] was trying to think of things to eat\n[11:33] that are very very colorful. There is so\n[11:36] much evidence about how good that is\n[11:39] generally for the brain that that is my\n[11:42] go-to. Like what should I eat? Well, is\n[11:45] it on the Mediterranean diet? If it is,\n[11:47] then go ahead. If it's too processed,\n[11:50] >> only do it just a little bit.\n[11:52] >> Is it true that if we have less friends,\n[11:54] if we have less strong relationships, if\n[11:56] we're lonely,\n[11:57] >> then our brain will shrink and is more\n[12:00] prone to dementia and Alzheimer's and\n[12:03] things like that. Yes, we are social\n[12:05] creatures and um there are uh really\n[12:09] powerful studies that have shown the\n[12:11] correlation between the number of social\n[12:14] connections that we have including just\n[12:16] saying hello to the barista at\n[12:18] Starbucks. It's not a close friendship\n[12:20] that you develop over 30 years. It's\n[12:23] it's just how many people you interact\n[12:25] with and greet and longevity. The more\n[12:29] people you are regularly interacting\n[12:31] with, the longer you are living overall\n[12:34] longevity. But if you go into brain\n[12:37] health, absolutely it's also very very\n[12:39] healthy for you. It also brings\n[12:42] happiness. So uh friend and colleague of\n[12:45] mine um Robert Wallinger uh studied um\n[12:48] what makes people happy. The study\n[12:50] started in the 20s, the 1920s and in\n[12:53] Harvard. And after all of those many\n[12:55] many many decades, the answer is what\n[12:59] brings happiness is the strength of your\n[13:02] social connections. So it makes you\n[13:03] happier. It makes you live longer and\n[13:05] and uh yes, loneliness on the on the um\n[13:09] flip side causes stress uh long-term\n[13:12] stress that that damages the brain and\n[13:14] uh yeah, in the long term can can make\n[13:17] it smaller and uh less healthy.\n[13:19] >> Here's the fifth most replayed moment.\n[13:21] When I asked you before this\n[13:23] conversation started rolling what you're\n[13:25] really excited about at the moment, your\n[13:27] response to me was there was a few\n[13:28] things, but one of them which lit up\n[13:30] your face was creatine.\n[13:32] >> Yes. And it's funny because\n[13:34] >> it lit up your face again.\n[13:36] >> Yeah. It's it's funny because creatine\n[13:38] has been around for I mean ever for\n[13:41] decades and it's always been in my mind\n[13:43] it was like one of those gym bro things.\n[13:45] I'm like I don't need to be swole.\n[13:47] >> Yeah.\n[13:48] >> I don't need creatine get get swole. And\n[13:50] you know this is this was the thought\n[13:52] for for many many years. And then over\n[13:55] the last five years or so,\n[13:59] the effects of creatine on the brain\n[14:01] started to really get my interest.\n[14:03] Anything that affects the brain, I\n[14:04] really become interested in. And so\n[14:07] that's kind of what did get me the most\n[14:09] excited about about creatine. But also,\n[14:13] I started doing a lot of resistance\n[14:14] training. And so I was like, \"Okay, here\n[14:16] I am now. I'm like one of those gym\n[14:18] guys. I'm doing I'm doing the barbells.\n[14:21] I'm doing the, you know, the squats and\n[14:22] the deadlifts and all that and so, so\n[14:25] why not give myself some of the\n[14:26] creatine? Well, what is creatine, right?\n[14:29] Why is it important? You talked about\n[14:32] earlier, you know, why doesn't our body\n[14:35] just make more of these things that are\n[14:36] so beneficial? We do make creatine. We\n[14:39] make about, I don't know, our liver\n[14:41] makes about 1 to three grams a day of\n[14:43] creatine. And our brain also makes\n[14:46] creatine and those are the two organs\n[14:47] that make it. Creatine gets consumed by\n[14:52] other tissues like the muscle is\n[14:53] probably the one that's the greediest\n[14:55] because creatine is stored as\n[14:58] phosphocreatine but it's used to make\n[15:00] energy essentially. So it can increase\n[15:03] muscle mass, it can increase muscle\n[15:05] strength in combination with resistance\n[15:07] training because you're able to\n[15:09] regenerate and make energy faster. So,\n[15:13] for example, I became interested in it\n[15:15] after reading studies where people that\n[15:18] supplemented with creatine that were\n[15:20] engaged in resistance training were able\n[15:23] to gain more lean body mass. They were\n[15:25] able to gain more strength. It was\n[15:27] increasing their training volume. So,\n[15:29] you can do one to two more reps, right,\n[15:32] of of whatever exercise you're doing.\n[15:34] And it seems to decrease the recovery\n[15:36] time between those those sets as well.\n[15:39] So, you're able to increase your\n[15:40] training volume. Well, anything that's\n[15:42] going to in increase your training\n[15:43] volume is going to then have the\n[15:45] downstream effect of, you know,\n[15:47] increasing the adaptations like\n[15:48] increased muscle mass or increased\n[15:50] muscle strength. I started supplementing\n[15:53] with creatine about a year ago and I\n[15:56] started supplementing with it for that\n[15:57] reason, for the my training and I was\n[16:00] doing about five grams a day because\n[16:02] that was really what was shown to to be\n[16:04] beneficial for muscle health in\n[16:07] combination with resistance training.\n[16:08] And it's important for people to realize\n[16:10] that supplementing with creatine by\n[16:13] itself, without any type of resistance\n[16:15] training, isn't going to grow your\n[16:16] muscle. It's not going to make you\n[16:18] stronger. You have to put in the effort\n[16:20] because what creatine is doing, it's\n[16:23] helping you make the energy quicker,\n[16:25] right? And that and then being able to\n[16:28] make that energy quicker means that\n[16:29] you're able to then do that exercise\n[16:31] better, um, harder, more of it, right?\n[16:34] So, um, it's sort of sup supercharging\n[16:36] your exercise routine.\n[16:38] I had already been aware of the effects\n[16:40] on the brain. I thought maybe the five\n[16:42] grams a day would do that. So what are\n[16:44] the effects on the brain? Well, your\n[16:45] brain also consumes a lot of energy, you\n[16:48] know, needs a lot of energy. So it does\n[16:50] make its own creatine. But it turns out\n[16:53] if you can if you can give your brain\n[16:56] more of that creatine particularly under\n[16:59] a period of anything that's causing\n[17:01] stress. So let's say lack of sleep or\n[17:06] let's say emotional psychological stress\n[17:10] or in my case high cognitive load where\n[17:16] you're just every day learning concepts,\n[17:19] complex things. you're trying to\n[17:21] remember them. You're putting ideas\n[17:22] together and coming up with new\n[17:24] hypotheses and you know, you're just\n[17:26] you're just you're studying a lot and\n[17:28] it's very cognitively demanding and it's\n[17:31] it's a type of stress on your brain.\n[17:33] That's like my life, right? Um under\n[17:35] this condition of stress, depression is\n[17:38] another one that's a stress on your\n[17:39] brain or neurodeenerative disease,\n[17:42] that's a stress on your brain. So any\n[17:44] kind of stressful condition,\n[17:46] that's where creatine shines in the\n[17:49] brain. I would argue that um all of us\n[17:52] who who has the perfect amount of sleep\n[17:54] never has stress nobody, right? There's\n[17:56] always some sort of stress in the\n[17:58] background. So, um that's when I was\n[18:00] like, okay, so if you're the perfect\n[18:03] person, you have no stress, you get the\n[18:05] perfect amount of sleep every night,\n[18:07] your brain makes enough creatine to kind\n[18:09] of do what it needs to do. I know that\n[18:12] I'm constantly under stress. So, um I'm\n[18:15] like, okay, well, I think I need a\n[18:16] boost. And this is where a lot of very\n[18:18] interesting studies have come out of\n[18:20] many different labs. Um, some out of\n[18:22] Germany that looked at the dose of\n[18:24] creatine and how it increases creatine\n[18:27] levels in the brain. And this is why I\n[18:29] now supplement with 10 grams a day. So\n[18:32] the study out of Germany\n[18:34] found that five grams a day of creatine,\n[18:36] if you're supplementing with five grams\n[18:38] a day, your muscles are greedily\n[18:39] consuming it. Particularly if you're\n[18:41] working out, they want it. They want it.\n[18:43] after about five grams a day, especially\n[18:45] over a few months, like you're you're\n[18:47] saturating your muscle and that's\n[18:49] enough, right? Anything above that kind\n[18:52] of spills over to the brain. And so they\n[18:54] what this German study found was that 10\n[18:57] grams of creatine increased creatine\n[18:59] levels in several different regions of\n[19:01] the brain. And that was probably the\n[19:02] most exciting, you know, I would say\n[19:04] evidence that supplementing higher than\n[19:06] five grams a day was actually doing\n[19:08] something in terms of getting creatine\n[19:09] into the brain.\n[19:11] There have now been a variety of studies\n[19:13] that have looked at different outcomes,\n[19:15] right? So, if you supplement with 10\n[19:18] grams of creatine or even go higher than\n[19:20] that, like 20 grams of creatine, how\n[19:22] does that affect cognitive function,\n[19:23] right? And so, um some of these studies\n[19:26] have been been done by uh Dr. Darren\n[19:28] Kandow. He's um at the University of\n[19:30] Regina in Canada and it's looked they've\n[19:33] looked at things like sleep deprivation\n[19:36] and it's been found that if you take\n[19:38] someone and you sleep deprive them for\n[19:41] 21 hours and give them about 25 to 30\n[19:45] grams of creatine, it completely negates\n[19:49] the cognitive deficits of sleep\n[19:51] deprivation. Actually, not only does it\n[19:54] negate the cognitive deficits of sleep\n[19:56] deprivation, it makes people function\n[19:59] better than if they were well-rested.\n[20:03] That's where I was like, wait a minute,\n[20:06] there's many times when I'm traveling,\n[20:07] I'm jet-lagged. Uh lots of times when\n[20:10] I'm sleepd deprived and I have to be\n[20:11] doing a podcast or a presentation,\n[20:13] whatever. And in those situations, I go\n[20:17] up from my 10 grams to more like 20\n[20:20] grams. Today, for example, I wasn't\n[20:23] really sleepdeprived, but you know,\n[20:26] there's a lot of high cognitive demand.\n[20:28] This is a long podcast. There's all that\n[20:30] stuff. And so, I went up to 20 grams\n[20:32] today on my creatine. And I well, I will\n[20:35] say even at the 10 gram for me, we were\n[20:38] talking about this with respect to being\n[20:40] in ketosis.\n[20:42] I don't feel that mid-after afternoon\n[20:44] crash when I have the creatine, not\n[20:47] being on a ketogenic diet, not being in\n[20:48] ketosis. It's very clear for me and I've\n[20:51] done this where sometimes I only do five\n[20:53] grams and then if I do that I'll notice\n[20:56] I'm like why am I tired right now? So\n[20:58] there's something interesting and maybe\n[20:59] it's placebo. I'm going to throw that\n[21:02] out there. Very possible. But I don't\n[21:04] know maybe the creatine is again it's\n[21:06] able to regenerate that energy quicker\n[21:09] and so that's also beneficial for the\n[21:10] brain. And now I I would say all these\n[21:13] creatine researchers a lot of them are\n[21:15] shifting to the brain. It used to be all\n[21:16] muscle focused and now people are super\n[21:19] interested in what creatine is doing to\n[21:22] the brain, especially if you're\n[21:23] supplementing with more of it. And you\n[21:26] know, this is important for people that\n[21:27] are under a stressful situation, but\n[21:30] also for vegans because creatine is\n[21:32] found in food, mostly in animal products\n[21:35] like meat and poultry and fish, dairy. A\n[21:37] lot of vegans don't eat that. And I've\n[21:39] had so many of my vegan friends,\n[21:42] I've got them on the creatine, and it's\n[21:44] changed their lives. I mean, they're\n[21:46] like, \"This is like incredible.\" You\n[21:48] know, can you imagine someone who's not\n[21:49] getting any creatine from their diet cuz\n[21:51] they eat no meat and all of a sudden\n[21:53] they start supplementing with 5 10 grams\n[21:55] of creatine and it's like they have\n[21:57] energy. Some people say they they\n[21:59] require less sleep, which is kind of\n[22:01] interesting. That's kind of a comment\n[22:03] I've heard many many times from people\n[22:04] is that it's like their brain doesn't\n[22:06] need as much sleep. They have more\n[22:08] energy. So, um, I've been a big fan of\n[22:11] the creatine, um, not only for the\n[22:13] muscle especially because, you know,\n[22:14] working out is something that's very\n[22:16] important, but for the brain as well.\n[22:19] I always thought of creatine as\n[22:21] something that you you took and you kind\n[22:22] of had to load up on and then over a\n[22:24] couple of weeks or months, the effects\n[22:25] would kick in. But you're telling me\n[22:27] that if I had creatine in the morning,\n[22:29] that same day, I would experience\n[22:31] potentially improved cognition if I have\n[22:34] a big enough dose.\n[22:35] >> Yes. So, um, great question. A lot of\n[22:38] studies that have been done that you're\n[22:40] referring to have been done in the\n[22:42] context of exercise and muscular\n[22:45] performance. And the reason why people\n[22:49] have to load up on like they do a\n[22:51] loading phase, let's say 20 grams and\n[22:53] then they go down to this sort of\n[22:54] maintenance phase of 5 g is because it\n[22:58] takes I don't know, I think it's about a\n[23:00] month or so before you can saturate your\n[23:03] muscular stores of creatine. And then\n[23:06] >> what does that mean? It means that um\n[23:08] the creatine which is actually stored in\n[23:10] your muscle as phosphocreatine is there\n[23:12] and ready to be used to make energy. So\n[23:16] so it takes again it takes about a month\n[23:20] or so to do that unless you are really\n[23:22] giving your muscles a high dose, right?\n[23:24] So the five grams a day it only it can\n[23:26] only do it for so many days and then\n[23:29] finally you get saturated. When you do\n[23:30] this loading phase you kind of just\n[23:32] accelerate that whole process. And so\n[23:34] that's why when people are doing these\n[23:36] experiments where they want to test the\n[23:37] effects of creatine, they want they want\n[23:39] the participants to have really high\n[23:41] levels of creatine in their muscles\n[23:42] quick because they don't want to do a\n[23:44] month-long experiment, right? They want\n[23:45] the experiment to be like a couple of\n[23:47] weeks or a week. So that was kind of the\n[23:49] whole concept behind this loading phase.\n[23:51] If you're not someone who's going to\n[23:54] some kind of competition, you know, like\n[23:56] your CrossFit games or something, you\n[23:58] don't really need to do that loading\n[23:59] phase if you've already been\n[24:00] supplementing with five grams a day for\n[24:02] like a month. When it comes to the\n[24:04] brain, what's happening if you get above\n[24:07] that 5 g, that's pretty much all\n[24:09] consumed by the muscle. You're having\n[24:12] some leftover in circulation and the\n[24:14] brain takes it up and it takes it up,\n[24:16] right? When it re what it really shines\n[24:19] is under that stressful condition, which\n[24:21] again for me, I feel like every day is\n[24:23] this is is like cognitively demanding\n[24:26] for me because I'm constantly, you know,\n[24:28] learning new material or learning new\n[24:30] information or working on things, right?\n[24:31] And so there's a lot of cognitive stress\n[24:33] on my brain. And so I feel like I'm\n[24:35] constantly under that stress. And that's\n[24:37] where getting the creatine in your brain\n[24:39] helps you make that energy quicker. And\n[24:41] so that's why like I've done I've had,\n[24:43] you know, been jetlagged and have have\n[24:45] to give a talk at you, you know, like\n[24:47] 5:00 a.m. in the morning, my my\n[24:48] biological time after not getting sleep.\n[24:50] And I've done like 25 grams of creatine.\n[24:53] And it it's insane how much it helps me.\n[24:56] Again, it could be placebo because I'm\n[24:57] anticipating that effect, which is fine.\n[24:59] Placebo is a real thing. It's great. I'm\n[25:01] all about it. But there's some evidence\n[25:04] also that this works, right? That the\n[25:07] creatine is helping with under that\n[25:08] sleep deprivation and that stressful\n[25:10] condition.\n[25:11] >> I was reading about a study in 2025\n[25:13] where they\n[25:15] gave creatine to people that had\n[25:17] depressive symptoms alongside CBT\n[25:19] training. And the people that had\n[25:21] creatine and the cognitive behavioral\n[25:23] therapy training experienced a greater\n[25:25] improvement in their depression symptoms\n[25:27] than those who just received the\n[25:29] cognitive behavioral therapy, which is\n[25:32] which is incredible.\n[25:34] >> It's fascinating. I mean, depression is\n[25:36] a type of brain stress, right? I mean,\n[25:38] we know inflammation plays a role in in\n[25:41] depression. We know oxidative stress\n[25:43] plays a role in depression. And there\n[25:46] have now been some animal studies that\n[25:48] have shown creatine is somehow having an\n[25:50] anti-inflammatory effect. I that hasn't\n[25:52] all been worked out. So I don't know if\n[25:54] it's all just the energy component of\n[25:57] it. It could also be this other sort of\n[25:59] newly identified role that creatine is\n[26:02] playing in sort of having an\n[26:04] anti-inflammatory effect. And I don't\n[26:06] know much enough about that. I don't\n[26:07] know that there's enough even known\n[26:09] about that. But I do know that it\n[26:10] exists. And it's fascinating because\n[26:12] again I think where creatine really\n[26:15] shines in the brain and it's been shown\n[26:17] study after study is under some kind of\n[26:19] stressful condition depression or sleep\n[26:21] deprivation or there's a new study that\n[26:24] came out it was published I don't know a\n[26:26] month ago or so showing that it was a\n[26:29] very small pilot study and I want to\n[26:30] caveat this there was no placebo control\n[26:34] but it did show that giving people with\n[26:37] Alzheimer's disease creatine I believe\n[26:39] it was 20 grams a day did improve their\n[26:42] cognition. And so again, this is a whole\n[26:45] new field where now we're looking at\n[26:47] creatine in the brain, not just the gym\n[26:50] bro Bros and not just the muscular\n[26:51] effects, but in the brain and how it's\n[26:54] affecting the brain and being beneficial\n[26:56] for cognition, for brain aging, for\n[27:00] depression.\n[27:01] >> Here's the fourth most replayed moment.\n[27:04] One of the most inspiring and I think\n[27:06] liberating things that I've heard in\n[27:07] your work is this idea of\n[27:09] neuroplasticity. Because if you're if\n[27:12] the brain can physiologically change\n[27:14] based on what I'm doing, then it means\n[27:16] that who I am now, my identity, that 16\n[27:18] that 19-year-old who's sleeping in the\n[27:19] mummy thing with the ferret isn't who I\n[27:21] always have to be. I can literally\n[27:23] change. Um, we've spoken a little bit\n[27:26] around like what causes the motivation\n[27:28] to actually change, but knowing that\n[27:29] there's a my brain will actually change.\n[27:31] Those two things are really inspiring\n[27:34] for me because it means that whatever\n[27:35] rut I'm stuck in isn't necessarily a\n[27:37] permanent one. Now, you said that the\n[27:39] motivation to change comes from fear.\n[27:41] >> Well, in my case, it took a a fear\n[27:44] circumstance, fear of becoming a\n[27:47] permanent failure.\n[27:48] >> Yeah.\n[27:48] >> To motivate immense change. And um uh\n[27:52] that was that circumstance. I I do\n[27:54] believe however that the best work, our\n[27:57] most creative and best work comes from a\n[28:00] love of craft. But sometimes in order to\n[28:03] find what you truly love, you have to be\n[28:06] scared into setting off on a path to\n[28:08] find it. So neuroplasticity\n[28:11] is absolutely real. But if the question\n[28:14] is can a person change, can you learn\n[28:17] new things? Can you unlearn certain\n[28:19] patterns? Can you overcome traumas at\n[28:22] any age? The answer is absolutely\n[28:25] categorically yes. How? Well, it's very\n[28:29] clear that as a child until about age\n[28:32] 25, more or less just passive experience\n[28:35] will shape the brain for better or\n[28:37] worse. After about age 25, and again\n[28:40] these are not strict cut offs,\n[28:43] we can change our brain. But what's\n[28:45] required is a marketked shift in the\n[28:47] neurochemical environment under which\n[28:50] something happens. So one of the reasons\n[28:52] why any traumatic event will forever be\n[28:55] remembered although by the way you can\n[28:57] remove some of the emotional load of\n[28:58] that trauma does not have to be\n[29:00] traumatic forever\n[29:02] is because when we see or experience\n[29:05] something very intense of a fearful\n[29:07] nature there is the release of certain\n[29:10] what we call neurom modulators things\n[29:12] like epinephrine adrenaline and other\n[29:15] neurom modulators that cause a state\n[29:18] shift in our broad body and brain And\n[29:21] the nervous system recognizes this as\n[29:23] unusual and as a consequence in the\n[29:25] subsequent days there's reordering of\n[29:27] the connections so that the brain can\n[29:30] prepare for that event should it happen\n[29:32] again. This is why we have what's called\n[29:34] one trial learning. You go to a certain\n[29:36] location, something terrible happens\n[29:38] there, you will forever associate that\n[29:40] location with something terrible. But\n[29:42] there are tools, therapy and other tools\n[29:45] that can allow the emotional load to be\n[29:48] removed from that so that you could go\n[29:49] to that location and feel calm, no fear\n[29:52] whatsoever. The good news is you can\n[29:54] also learn anything you want to learn\n[29:56] provided there's a shift in this\n[29:58] neurochemical environment. This is why\n[30:00] when we are very interested and focused\n[30:02] on something, two of the main\n[30:04] requirements for neuroplasticity, we\n[30:06] have to be alert and we have to be\n[30:07] focused. We can't learn passively as\n[30:09] adults. We can't just play um you know a\n[30:13] a lecture about AI and large language\n[30:16] models or neuroscience in the room and\n[30:18] then it just the knowledge doesn't just\n[30:20] sink in by osmosis.\n[30:22] But if we pay attention and we're alert\n[30:24] when we pay attention\n[30:26] there's a shift in the neurochemicals\n[30:28] associated with that attention. What we\n[30:30] call the catacolamines. It's three\n[30:32] molecules dopamine, epinephrine and\n[30:34] norepinephrine. All which cause an\n[30:36] increase in alertness. all which cause\n[30:38] an increase in focus, a tightening of\n[30:40] our visual field and our auditory field.\n[30:42] So like cones of attention is one way to\n[30:44] think about it. And then it sets in\n[30:46] motion a bunch of biological processes\n[30:48] such that if we get adequate sleep that\n[30:50] night, maybe the next night as well,\n[30:53] there's reordering of neural connection\n[30:54] so that that knowledge, that new\n[30:56] experience is consolidated in your\n[30:59] brain. You are forever changed as a\n[31:01] consequence of that experience. So when\n[31:04] we hear that the brain is constantly\n[31:06] changing, everything that we encounter\n[31:08] changes our brain, that's not true. Why\n[31:11] would the brain change unless it needed\n[31:12] to, right? As a child, the brain is\n[31:14] basically a template for change. It's\n[31:16] it's trying to understand the\n[31:17] environment and make predictions. And so\n[31:19] that's true. Neuroplasticity is is a\n[31:23] cardinal feature of of childhood and\n[31:25] adolescence and the teen years. Just\n[31:27] think about the music you listen to when\n[31:28] you were a teen. No other music will\n[31:30] ever have as much significance. And\n[31:32] that's because as a teen your body is\n[31:33] flooded with hormones and neurom\n[31:35] modulators that the amount of meaning\n[31:37] that comes from now seemingly trivial\n[31:40] events when you're a teenager or\n[31:41] adolescent is immense. That song meant\n[31:44] so much and it's because of the\n[31:45] neurochemical meu it creates in you. But\n[31:48] as an adult it takes a stronger stimulus\n[31:50] as we say. The nervous system is very um\n[31:53] efficient in that way. It doesn't change\n[31:56] unless it has to and it always changes\n[31:59] if it needs to in order to keep you\n[32:01] safe. This is why there's an asymmetric\n[32:03] influence of fear as opposed to um just\n[32:06] interest in terms of what will shift our\n[32:08] brain. But it's nice to know that love\n[32:13] and excitement and appreciation are very\n[32:16] strong stimula for changing the brain.\n[32:19] From everything we know about\n[32:20] neuroscience, it's clear that doesn't\n[32:23] matter if you're 90 years old, 70 years\n[32:26] old, 50 years old, if you want to learn,\n[32:28] you can learn. And that learning occurs\n[32:30] through neuroplasticity, which is the\n[32:32] reordering of neural connections,\n[32:34] strengthening of certain connections,\n[32:35] weakening of others, and in some rare\n[32:37] cases, the addition of new neurons. But\n[32:40] you absolutely can change your brain,\n[32:41] but you have to pay attention to the\n[32:44] thing you want to incorporate into your\n[32:46] brain. You have to be alert while you do\n[32:48] that. And then you absolutely have to go\n[32:50] get some rest because it's during sleep\n[32:52] and during meditative states and during\n[32:55] rest that the actual rewiring of the\n[32:57] brain occurs.\n[32:59] >> You know, every once in a while you come\n[33:00] across a product that has such a huge\n[33:02] impact on your life that you'd probably\n[33:04] describe as a gamecher. And I would say\n[33:09] for about 35 to 40% of my team, they\n[33:12] would currently describe this product\n[33:14] that I have in front of me called Ketone\n[33:16] IQ, which you can get at ketone.com,\n[33:19] as a game changer. But the reason I\n[33:21] became a co-owner of this company and\n[33:22] the reason why they they now are a\n[33:23] sponsor of this podcast is because one\n[33:26] day when I came to work, there was a box\n[33:27] of this stuff sat on my desk. I had no\n[33:29] idea what it was. Lily in my team says\n[33:31] that this company have been in touch. So\n[33:33] I went upstairs, tried it, and quite\n[33:35] frankly, the rest is history. in terms\n[33:37] of my focus, my energy levels, how I\n[33:40] feel, how I work, how productive I am.\n[33:42] Game changer. So, if you want to give it\n[33:44] a try, visit ketone.com/stephven\n[33:46] for 30% off. You'll also get a free gift\n[33:48] with your second shipment. And now you\n[33:51] can find Keton IQ at Target stores\n[33:53] across the United States, where your\n[33:55] first shot is completely free of charge.\n[33:58] All I had to do was brain dump. Imagine\n[34:00] if you had someone with you at all times\n[34:02] that could take the ideas you have in\n[34:04] your head, synthesize them with AI to\n[34:07] make them sound better and more\n[34:08] grammatically correct and write them\n[34:10] down for you. This is exactly what\n[34:12] Whisper Flow is in my life. It is this\n[34:14] thought partner that helps me explain\n[34:16] what I want to say. And it now means\n[34:18] that on the go, when I'm alone in my\n[34:20] office, when I'm out and about, I can\n[34:22] respond to emails and Slack messages and\n[34:24] WhatsApps and everything across all of\n[34:26] my devices just by speaking. I love this\n[34:28] tool. And I started talking about this\n[34:29] on my behindthescenes channel a couple\n[34:30] of months back. And then the founder\n[34:32] reached out to me and said, \"We're\n[34:33] seeing a lot of people come to our tour\n[34:34] because of you.\" So, we'd love to be a\n[34:36] sponsor. We'd love you to be an investor\n[34:37] in the company. And so, I signed up for\n[34:39] both of those offers. And I'm now an\n[34:40] investor and a huge partner in a company\n[34:42] called Whisper Flow. You have to check\n[34:44] it out. Whisper Flow is four times\n[34:46] faster than typing. So, if you want to\n[34:48] give it a try, head over to\n[34:49] whisperflow.ai/doac\n[34:52] to get started for free. And you can\n[34:54] find that link to Whisper Flow in the\n[34:56] description below. There are a few\n[34:58] sports that I make time for, no matter\n[35:00] where I am in the world. And one of them\n[35:02] is, of course, football. The other is\n[35:03] MMA, but watching that abroad usually\n[35:05] requires a VPN. I spend so much time\n[35:08] traveling. I've just spent the last 2\n[35:10] and 1/2 months traveling through Asia\n[35:12] and Europe and now back here in the\n[35:13] United States. And as I'm traveling,\n[35:15] there are so many different shows that I\n[35:16] want to watch on TV or on some streaming\n[35:18] websites. So when I was traveling\n[35:19] through Asia and I was in Koala Lumpur\n[35:21] one day, then the next day I was in Hong\n[35:22] Kong and the next day I was in\n[35:23] Indonesia, all of those countries had a\n[35:25] different streaming provider, a\n[35:26] different broadcaster. And so in most of\n[35:29] those countries I had to rely on\n[35:30] ExpressVPN who are sponsor of this\n[35:32] podcast. Their tool is private and\n[35:34] secure and it's very very simple how it\n[35:36] works. When you're in that country and\n[35:38] you want to watch a show that you love\n[35:39] in the UK, all you do is you go on there\n[35:41] and you click the button UK and it means\n[35:43] that you can gain access to content in\n[35:45] the UK. If you're after a similar\n[35:46] solution in your life and you've\n[35:47] experienced that problem too, visit\n[35:49] expressvpn.com/duac\n[35:51] to find out how you can access\n[35:52] ExpressVPN for an extra 4 months at no\n[35:56] cost.\n[35:58] Here is the third most replayed moment.\n[36:00] For those people who have just clicked\n[36:01] to listen to this conversation, can you\n[36:04] tell them the mission you're on and why\n[36:07] it's so important?\n[36:09] >> Yeah. Well, thanks so much for having\n[36:10] this conversation with me. I think that\n[36:12] illustrates the problem, right? someone\n[36:14] as informed as you don't know anything\n[36:15] or never heard of nitric oxide. So,\n[36:17] >> it's important for us to just make a\n[36:18] distinction between um like nitric gas\n[36:22] that people, you know, inhale and that\n[36:25] used if you played like uh some of those\n[36:27] racing car games, you press a button and\n[36:28] the car goes really fast. If you\n[36:29] >> That's nitrous nitrous.\n[36:32] >> These are two separate things.\n[36:33] >> No, very Yeah, very good point. So, this\n[36:34] is not nitrous oxide. Nitrous oxide is I\n[36:39] mean a medicine is a dental anesthetic,\n[36:41] right? It's a gas. It's called laughing\n[36:42] gas. That's N2O. That's the chemical\n[36:45] formula. What we're talking about is\n[36:47] nitric oxide or NO. One nitrogen, one\n[36:50] oxygen. This molecule is is foundational\n[36:53] for human health and longevity. So\n[36:56] nitric oxide is a gas. It's a naturally\n[36:57] produced molecule. It's a signaling\n[36:59] molecule in the human body. And so it's\n[37:01] it regulates things like blood flow and\n[37:04] oxygen delivery. And it mobilizes our\n[37:05] own stem cells to help us recover and\n[37:07] repair and replace dysfunctional cells.\n[37:10] it uh improves energy production inside\n[37:12] the cell and it regulates blood flow. So\n[37:15] nitric oxide is a gas. It's produced in\n[37:17] the endthelium. So the endothelium is\n[37:18] the single layer of cells that line\n[37:20] every blood vessel throughout the body.\n[37:23] So the function of these endothelial\n[37:25] cells is to regulate vascular tone and\n[37:28] to regulate you know solute exchange and\n[37:31] extravisation or transport of molecules\n[37:34] across that endothelial layer. And so\n[37:36] when your endthelial cells can no longer\n[37:38] make nitric oxide gas, they no longer\n[37:40] dilate. So the blood vessels become\n[37:43] constricted. You start to get\n[37:45] inflammation. You get stiff arteries,\n[37:47] plaque deposition, and that's what\n[37:49] starts cardiovascular disease\n[37:51] orthoscerosis.\n[37:52] >> So let me get this straight. I'll repeat\n[37:54] back to you what I think I understand\n[37:55] about nitric oxide. And you tell me if\n[37:57] it's accurate. So this nitric oxide is a\n[38:00] chemical that is in all the blood cells\n[38:03] of my body and it allows my blood cells\n[38:06] to basically expand open up so blood can\n[38:09] flow through there. So if I\n[38:11] >> it dilates it dilates the smooth muscle.\n[38:14] So it's not affecting\n[38:15] >> the cells per se but it's dilating the\n[38:17] smooth muscle that surrounds the blood\n[38:19] vessels which leads to re relaxation and\n[38:21] dilation.\n[38:22] >> Fine. So my blood cells would then\n[38:23] expand\n[38:24] >> your blood vessels\n[38:24] >> and more blood would go through there.\n[38:26] But if I'm deficient, that mechanism\n[38:28] doesn't work and my blood cells wouldn't\n[38:31] expand ultimately expand through the\n[38:33] relaxation of the muscles.\n[38:34] >> That's right.\n[38:35] >> And therefore, I would have higher blood\n[38:37] pressure, which can lead to a series of\n[38:40] downstream diseases and consequences.\n[38:42] And so when we look at the graph that I\n[38:44] showed a second ago where we're seeing\n[38:46] for anyone that can't see this graph\n[38:47] because you're listening on audio, we're\n[38:49] seeing\n[38:52] nitric oxide levels in young people up\n[38:54] to the age of roughly around 20 are\n[38:57] optimal. And then from about 30 to 70,\n[39:00] there's this tremendous sort of 80 90%\n[39:02] drop. in terms of chronic disease that\n[39:05] is downstream from me losing nitric\n[39:07] oxide level. Can you give me a bit of a\n[39:09] menu of chronic disease that is\n[39:11] associated with this nitric oxide\n[39:14] deficiency?\n[39:15] >> Yep.\n[39:17] We've touched on them. So erectile\n[39:18] dysfunction. So in erections in both men\n[39:21] and women are dependent upon dilation of\n[39:23] the blood vessels to get engorgment to\n[39:25] get increase in blood flow. And that's\n[39:27] what an erection is. And we call that\n[39:29] the canary in the coal mine because for\n[39:31] years people thought it was a lifestyle\n[39:33] disorder. Right.\n[39:34] >> Well, erectile dysfunction.\n[39:36] >> Yeah. But now it's recognized that it's\n[39:37] a symptom of loss of nitric oxide and\n[39:41] really an accelerated form of\n[39:42] cardiovascular disease,\n[39:44] >> high blood pressure, metabolic disease,\n[39:46] and diabetes. And then the other one is\n[39:48] uh obviously Alzheimer's because\n[39:50] Alzheimer's is a vascular disease. And\n[39:52] nitric oxide corrects every single thing\n[39:54] we know about Alzheimer's. It improves\n[39:57] blood flow to the brain. It improves\n[39:59] glucose uptake. So, it overcomes the\n[40:01] metabolic aspect of Alzheimer's. It\n[40:03] reduces inflammation. In fact, a number\n[40:05] of my patents on a method of reducing\n[40:07] inflammation. It inhibits the oxidative\n[40:10] stress we see in in Alzheimer's and\n[40:11] neurological disease. And it prevents\n[40:13] the immune dysfunction. And when you do\n[40:15] that, when you restore blood flow and\n[40:17] you get nutrients and oxygen in and you\n[40:19] take out the metabolic waste products,\n[40:20] there's no misfolding of protein. So,\n[40:22] you don't get the amaloid plaque, you\n[40:24] don't get the tangles. So this simple\n[40:26] molecule nitric oxide gas I'm absolutely\n[40:30] convinced will eradicate and cure\n[40:32] Alzheimer's\n[40:33] >> really\n[40:33] >> because it it addresses every\n[40:35] physiological root cause of Alzheimer's\n[40:38] >> if you can get it administered\n[40:39] therapeutically to patients early enough\n[40:43] or\n[40:44] >> no I think that's a very key because the\n[40:46] success or failure of any clinical trial\n[40:49] any drug in any clinical trial is\n[40:51] dependent upon the design of the\n[40:52] clinical trial and what patients at what\n[40:54] stage of disease that you enroll these\n[40:56] patients. So what are the inclusion\n[40:58] criteria and what are the exclusion\n[40:59] criteria\n[41:01] and there's a stage in every disease\n[41:04] whether it's heart disease, kidney\n[41:06] disease, Alzheimer's where you've\n[41:08] reached a point of no return. There's\n[41:10] really no medical therapy that's going\n[41:11] to reverse that disease because it's\n[41:13] progressed to a state that's\n[41:14] irreversible. So I think what we try to\n[41:17] do is take\n[41:19] take patients early in the process what\n[41:21] we call vascular dementia mild cognitive\n[41:23] impairment early Alzheimer's because\n[41:25] what I want to be able to demonstrate is\n[41:27] two things number one can we stop the\n[41:30] progression of disease once it's started\n[41:33] can we stop the progression and then\n[41:35] number two is we want to enroll patients\n[41:38] far enough along to where we can show\n[41:41] regression so can you move can you move\n[41:43] the needle back and so That's a very\n[41:46] kind of a specific and finite patient\n[41:48] population. When you design a clinical\n[41:51] study, number one, at the at the\n[41:53] absolute worst, we want to stop\n[41:54] progression. At the absolute best, we\n[41:56] want to show that we can regress\n[41:58] disease. And that's the goal of therapy\n[42:01] is that you understand the mechanism of\n[42:02] disease to the extent that you can treat\n[42:05] it, you can prevent it, you can reverse\n[42:07] it, and you can cure it. When I think\n[42:09] about the role that food plays in my\n[42:11] nitric oxide production, what should I\n[42:15] be eating to increase um my nitric oxide\n[42:19] levels or to keep them at a healthy\n[42:20] level?\n[42:22] >> I think it the same answer is for that\n[42:25] too. It's it's not so much what we\n[42:27] should be eating, it's what we should\n[42:28] not be eating.\n[42:29] >> Okay,\n[42:30] >> so we we'll we'll cover those step by\n[42:32] step. Number one, you have to avoid\n[42:33] sugar and high glycemic index foods\n[42:38] because sugar is a toxin. It's a poison.\n[42:40] And let's think about what sugar is. So\n[42:43] when we eat sugar or drink sugar\n[42:46] beverages, right? Whether it's sucrose,\n[42:48] whether it's fructose, whether it's high\n[42:50] fructose corn syrup, the end result\n[42:52] inside the human is we see an increase\n[42:54] in glucose. So elevation in blood sugar\n[42:58] or blood glucose is diabetes, right? And\n[43:02] now there's continuous glucose monitors\n[43:04] that you can get anywhere and everybody\n[43:06] does this. So if you eat something and\n[43:08] it causes an increase in your blood\n[43:10] sugar, blood glucose, then you should\n[43:12] avoid that because glucose as the name\n[43:14] implies is glue, right? It's sticky. And\n[43:17] if we if you have a soda and you spill\n[43:19] it on your countertop, you come back the\n[43:21] next day, it's sticky, right? Well,\n[43:23] that's what happens inside the body.\n[43:25] That sugar sticks to everything. It\n[43:26] sticks to proteins. It sticks to\n[43:28] enzymes.\n[43:29] >> And it lowers nitric oxide production.\n[43:31] >> Absolutely. That's why diabetics have a\n[43:34] 10 times higher incidence of heart\n[43:36] attack, stroke, all cause mortality\n[43:37] mortality. That's why they develop neur\n[43:40] neurological or peripheral neuropathy.\n[43:42] That's why they have non-healing wounds.\n[43:44] There's no nitric oxide. That's why\n[43:46] they're developing diabetic retinopathy,\n[43:48] macular degeneration, pancreatitis. I\n[43:51] mean, all of that can be traced back to\n[43:53] a lack of nitric oxide production\n[43:55] because the sugar is stuck to the\n[43:57] enzyme. The sugar destroys the oral\n[43:59] microbiome and completely changes the\n[44:02] the ecology of the bacteria and\n[44:04] completely shuts down nitric oxide\n[44:05] production. Right? But I think to answer\n[44:08] your question, what should we be eating?\n[44:10] I think you've got to eat a balanced\n[44:12] diet in moderation. You know, Americans\n[44:14] are overfed. All you got to do is walk\n[44:15] around and see the the epidemic of\n[44:18] obesity. good high quality protein, good\n[44:21] quality fats, and little or no carbs.\n[44:24] And it's really that simple.\n[44:27] >> Here's the second most replayed moment.\n[44:29] When you think about behaviors and\n[44:31] habits that are popular and trendy at\n[44:33] the moment, are there any that stand out\n[44:35] to you as being particularly good for\n[44:37] the brain or particularly bad for the\n[44:39] brain? Cuz I had a couple come to mind\n[44:42] that I wanted to throw at you. I mean,\n[44:43] one of them that's exploding in the UK\n[44:45] at the moment is paddle, which is kind\n[44:49] of I think you call it pickle ball here.\n[44:52] Good for my brain, bad for my brain.\n[44:54] It's so good for your brain because\n[44:58] it's working your cerebellum. And I told\n[45:02] you that because yours was sleepy\n[45:05] and as you activate this and you do that\n[45:08] with coordination exercises, it then\n[45:10] activates your frontal loes. Does that\n[45:12] mean that people that are uncoordinated\n[45:14] have a cerebellum issue?\n[45:16] >> Yes.\n[45:16] >> Oh, really?\n[45:19] >> Okay.\n[45:19] >> And the more you do it, the better\n[45:21] coordination you develop.\n[45:25] >> And that's why coordination exercises\n[45:28] for kids. So, we talked about kids is\n[45:32] you want to do that with them early.\n[45:35] Play sports, but not sports where\n[45:37] they're going to get a head injury,\n[45:39] right? I mean, we have to be smarter\n[45:41] than we are. Um, but when I was young,\n[45:46] my mother, who's now 93, was the\n[45:52] pingpong champion in the neighborhood,\n[45:55] and she was really good, and she never\n[45:57] let us beat her until we could\n[46:00] >> and but she was always encouraging.\n[46:05] I've got um I was looking then as you\n[46:08] were speaking about different trends at\n[46:10] the moment that are either good or bad\n[46:11] for the brain and one big trend at the\n[46:13] moment is neuroplasticity training. Lots\n[46:16] of people are doing games and using\n[46:18] other things to like there's apps you\n[46:20] can get that are neuroplasticity\n[46:22] training apps. Does any of that stuff\n[46:23] work?\n[46:24] >> Some of it\n[46:25] >> some of it works. And if you're so for\n[46:28] example, if you're doing memorization\n[46:30] games, do them while you're on the bike.\n[46:36] Now, not in the street, but if you're on\n[46:38] a stationary bike and\n[46:41] you're doing those games, it's been\n[46:45] found that exercise\n[46:48] increases blood flow to the hippocampus,\n[46:53] meaning you're more likely to remember\n[46:55] it and you're strengthening your brain\n[46:58] in the process. So, exercise with new\n[47:01] learning,\n[47:03] stunning. So if I want to learn\n[47:05] something, I should do it while walking\n[47:08] or moving in motion,\n[47:10] >> right? So if you're listening to a\n[47:12] language app, for example, do it while\n[47:14] you're walking.\n[47:15] >> Mindfulness and meditation, good or bad\n[47:17] for the brain.\n[47:18] >> Great. I published three studies on a\n[47:21] condundolini yoga form of meditation\n[47:23] called kin crea. It's a 12minute\n[47:27] meditation. I always say it's the\n[47:28] perfect ADD meditation because it's only\n[47:30] 12 minutes. And for 12 minutes you do\n[47:33] this. Sa\n[47:35] m saw\n[47:37] saw.\n[47:39] It's two minutes out loud, two minutes\n[47:41] whispering, four minutes silently to\n[47:44] yourself.\n[47:46] 2 minutes whispering, 2 minutes out\n[47:47] loud, you're done. Satan ma, birth,\n[47:51] life, death, reborn. Birth, life, death,\n[47:54] reborn. But the one we studied is sat na\n[47:59] ma. And so if they look it up, kitin\n[48:03] crea um activates your cerebellum,\n[48:08] activates your frontal loes, calms down\n[48:11] your emotional brain. People who did\n[48:15] that for 12 minutes for 8 weeks, their\n[48:20] resting frontal lobe function was\n[48:22] stronger.\n[48:25] So simple.\n[48:27] >> What the hell is going on there?\n[48:29] I think it's the focused attention plus\n[48:33] you're doing a coordination meditation s\n[48:36] no s\n[48:40] >> loving your job good or bad for the\n[48:42] brain\n[48:43] >> absolutely great for your brain if\n[48:48] you're learning new things people who\n[48:50] are in a job that does not require new\n[48:54] learning have a higher incidence of\n[48:56] Alzheimer's disease So if you're\n[48:58] stagnant in your work, you have a higher\n[49:00] risk of\n[49:01] >> Alzheimer's. And like if I just read\n[49:03] brain scans all day, well, I know how to\n[49:06] do it. I'm not learning anything new.\n[49:10] So I do that,\n[49:13] but I also am writing about something I\n[49:16] don't know about. Um, or I'm learning\n[49:20] something new.\n[49:22] >> What if you're working with\n[49:24] >> I'm sorry.\n[49:24] >> I love the job, but I'm working with\n[49:26] >> Bad for your brain. Chronic stress\n[49:30] increases cortisol. And I think\n[49:33] everybody should sort of know their\n[49:34] baseline cortisol level\n[49:38] and cortisol shrinks the hippocampus\n[49:42] and puts fat on your belly. So that's\n[49:45] two very bad things for your brain.\n[49:48] >> Breath work. That's a big trap.\n[49:49] >> Excellent. Excellent. You want to break\n[49:51] a panic attack?\n[49:53] The 15-second breath. 4 seconds in, hold\n[49:58] it for a second and a half. Eight\n[50:00] seconds out, hold it for a second and a\n[50:04] half. You just do that four or five\n[50:07] times, your whole nervous system will\n[50:11] calm down. And the research shows take\n[50:14] twice as long to breathe out as you\n[50:18] breathe in. That's why 4 seconds in, 8\n[50:21] seconds out.\n[50:22] >> It shifts your nervous system, doesn't\n[50:24] it?\n[50:24] >> Yes. It increases something called\n[50:26] veagal tone.\n[50:27] >> Okay. Some bad things then. Social media\n[50:29] usage. Chronic social media usage. Good\n[50:31] for the brain, bad for the brain.\n[50:33] >> Because you're constantly comparing\n[50:35] yourself to people who aren't real.\n[50:38] >> What about workcoholism and hustle\n[50:40] culture?\n[50:41] >> So,\n[50:44] I love my work.\n[50:47] Am I addicted to it? I don't know. But I\n[50:50] love it.\n[50:55] When they say people are workaholics and\n[50:57] it's bad for the brain, it's they're\n[51:01] working\n[51:02] with\n[51:05] or doing something they don't like or\n[51:08] doing it for the money but without\n[51:12] other purpose.\n[51:14] >> Microplastics, that's a big\n[51:15] >> awful for the brain. One of the major\n[51:18] causes of hormone disruption and cancer.\n[51:24] and other environment.\n[51:25] >> Thank you for not giving me a plastic\n[51:26] water bottle. Yeah,\n[51:27] >> it's okay. Imagine imagine if we did\n[51:30] that when we spend a long a lot of time\n[51:31] these days talking about the\n[51:33] microplastics and other environmental\n[51:34] toxins that I think people are becoming\n[51:36] more aware of now which is good noise\n[51:39] pollution\n[51:40] bad for the brain and if if it hurts\n[51:44] your hearing hearing loss is actually\n[51:47] one of the risk factors for Alzheimer's.\n[51:50] Why is that? I did a I did a\n[51:52] >> Because you're not getting input, right?\n[51:54] >> And if you're not getting appropriate\n[51:56] input,\n[51:58] your brain starts to atrophy.\n[52:02] And if you don't hear what other people\n[52:06] are saying and you have a lot of ants,\n[52:09] you have a high negativity bias is you\n[52:12] can actually begin to get a bit paranoid\n[52:15] and fill in the empty spaces with\n[52:18] negativity.\n[52:19] I just bought some new Apple AirPods and\n[52:22] when I connected them to my phone, it\n[52:24] said, \"You want to do a hearing test?\"\n[52:25] So, I did the hearing test and then I\n[52:27] asked my girlfriend, I said, \"You should\n[52:28] do this hearing test as well.\" Cuz I\n[52:29] needed something to compare it to. And I\n[52:31] was a little bit shocked. Um, it said I\n[52:34] hadn't lost any hearing yet, but my\n[52:36] hearing was significantly not as good as\n[52:38] hers. And I remember thinking, gosh,\n[52:42] you know, this is, but I didn't have any\n[52:43] idea that it was linked to Alzheimer's\n[52:45] at all. So now I've turned down the\n[52:47] volume for the first time in my life\n[52:49] because I think your hearing declines\n[52:51] regardless really of what you do with\n[52:53] age anyway. Um but as you said earlier\n[52:55] like starting from a better baseline\n[52:56] when you're talking about the brain\n[52:58] reserves is really the game I think with\n[53:01] aging. My last point is uh my last\n[53:05] question is a bit of a\n[53:07] seems to be uncorrelated but the world\n[53:09] is heading towards a world that's driven\n[53:11] by artificial intelligence. It's like\n[53:14] all the all the rage at the moment if\n[53:15] you log on the internet. People talking\n[53:17] about they're going to lose their jobs.\n[53:19] All of these new tools that allow us to\n[53:21] optimize our lives in a variety of\n[53:22] different ways. When you think about the\n[53:24] world of AI that we're heading into,\n[53:26] there's so many ways that I imagine it's\n[53:28] going to make your job easier as someone\n[53:30] who's doing scans of brains and so on.\n[53:34] But do you think artificial intelligence\n[53:35] is going to be good or bad for our\n[53:36] brains?\n[53:40] I think in the short run it's going to\n[53:41] be bad because\n[53:45] your brain is going to do less and\n[53:48] that's bad for the brain. I I think it's\n[53:52] fascinating to watch what's going to\n[53:54] happen. And ultimately, in the words of\n[53:58] my friend Byron Katy, argue with\n[54:01] reality, welcome to hell.\n[54:04] We need to figure out how to use it to\n[54:07] enhance our lives rather than to steal\n[54:11] brain development.\n[54:13] >> Here's the first most replayed moment.\n[54:15] There was a study done in 2007 that\n[54:18] showed Can't even say it.\n[54:20] >> Curcumin.\n[54:21] >> That shows curcumin upregulates anti-\n[54:26] oxidant defenses and downregulates\n[54:28] oxidative stress.\n[54:30] >> Yeah. There was a study done in 2016\n[54:32] which is a meta analysis of random\n[54:35] control trials found curcuminium\n[54:37] comparable to ibuprofen in terms of pain\n[54:40] relief.\n[54:41] >> Yeah, there there's a lot of work on\n[54:44] kurcamin and turmeric. As I said, a lot\n[54:46] of people get confused because they\n[54:47] think the it only works if you absorb it\n[54:49] into the blood and I'm saying that\n[54:51] actually you don't. What you do is you\n[54:54] work with the microbiome to make it\n[54:56] useful. And there's early preclinical\n[54:59] studies taking place around the impact\n[55:01] it can have with cancers. And there's\n[55:03] promising but early studies showing the\n[55:05] impact that curcumin that comes from\n[55:07] turmeric can have on brain health.\n[55:08] >> Yes. Well, that's uh focus is switching\n[55:11] on to the blood supply to the brain.\n[55:15] What we call the vascular effects on the\n[55:18] brain. And there's something that we\n[55:20] used to call the blood brain barrier\n[55:22] which you've probably heard of which is\n[55:24] seen to be the place where the barrier\n[55:27] that stops a lot of stuff entering the\n[55:29] brain and potentially upsetting it. We\n[55:31] now know this bloodb brain barrier is a\n[55:34] very dynamic interesting interface\n[55:37] between the brains tissue and the rest\n[55:41] of us. It's now called the\n[55:43] neurovvascular unit, NVU.\n[55:46] And it is so exciting. And the more we\n[55:50] look at it so far, the more we find that\n[55:53] the things that help the neurovvascular\n[55:56] unit, the bloodb brain barrier are\n[55:58] plants. And we have green tea. And you\n[56:02] know we can if you if you really want to\n[56:05] help um our brain health regular\n[56:09] drinking of green tea you know\n[56:12] is has been shown to be really useful.\n[56:14] Not that rather than the supplement by\n[56:16] the way is the drink that you have um oh\n[56:19] I put it in here right so we can make\n[56:22] it.\n[56:24] So as you make that can you explain to\n[56:26] me why green tea is a good idea\n[56:31] >> because it contains a number of again\n[56:34] polyphenols\n[56:35] >> and polyphenols are those\n[56:36] >> are these colors\n[56:37] >> these colors yeah\n[56:38] >> in this case it's green obviously and me\n[56:40] green tea is just the smoked unprocessed\n[56:43] part of the tea leaf so it's a plant\n[56:46] called chameleia senses um\n[56:53] so this is nice Japanese teapot. That's\n[56:56] the sort of thing you'd have green tea\n[56:57] in. And these are the mugs, but we've\n[56:59] filled these up already with uh ginger\n[57:02] and cinnamon. So, let's let's leave it\n[57:05] for a moment, but we can while it's\n[57:07] sitting there for a while. There are a\n[57:09] number of these polyphenols in green tea\n[57:11] that seem to be particularly\n[57:15] effective in modulating that barrier. We\n[57:17] talked about the neurovvascular unit\n[57:19] between the brain and the rest of us.\n[57:22] And um there's all sorts of reasons why\n[57:25] regular consumption of green tea seems\n[57:27] to be linked to less of this sort of\n[57:30] trouble.\n[57:30] >> What what sort of trouble?\n[57:32] >> The dementia type problems, the\n[57:33] cognitive decline as they get older.\n[57:36] >> Do they find that in cultures where they\n[57:37] drink a lot of green tea, they have less\n[57:39] dementia?\n[57:39] >> Yeah. But that doesn't mean there's a\n[57:41] cause and effect. So you need a few\n[57:42] other things to establish that. What\n[57:45] we're finding is that other plants have\n[57:48] very likely powerful effects in this\n[57:50] area. And I mentioned the rosemary. Now\n[57:52] all you need to do to appreciate\n[57:55] rosemary is to press it and sniff.\n[57:59] >> Oh, it smells so good. Really nice.\n[58:02] >> That's not just nice because what you're\n[58:04] doing there is you're inhaling volatile\n[58:06] oils,\n[58:07] >> the things that give the smell.\n[58:09] >> And when you're inhaling,\n[58:11] they're literally going into your brain\n[58:14] because part of the brain actually\n[58:16] reaches the outside world. It's called\n[58:18] the alactory lobe. And when you inhale\n[58:21] something, it literally moves into the\n[58:23] brain and from there into the lyic\n[58:26] system. Remember there's a line in a\n[58:29] Shakespeare play called Hamlet Ailia\n[58:32] the young lady says rosemary that's for\n[58:36] remembrance\n[58:38] >> because everyone knew that this improved\n[58:40] cognitive functions and when I was in\n[58:43] working on our campus in Maryland we\n[58:45] actually did a clinical trial with\n[58:47] rosemary in people with struggling with\n[58:50] their crosswords you know as they get\n[58:52] older and found that although it wasn't\n[58:54] a conclusive study there were pointers\n[58:56] to it's improving cognitive or\n[58:58] performance in those people and there's\n[59:01] been other studies since that re that\n[59:03] reinforce that. I would say that\n[59:05] rosemary is one of the ones to watch in\n[59:08] terms of long-term brain health. There's\n[59:10] another remedy called GKO that a lot of\n[59:13] people know about which is used as a\n[59:15] prescription medicine in Europe uh for\n[59:18] cardiovascular problems and that's been\n[59:20] shown to be likely useful and using the\n[59:24] same sort of mechanisms as as we've seen\n[59:26] here and with the green tea. I'll check\n[59:30] it here. Yeah, that looks all right.\n[59:36] You see, it's more yellow than green,\n[59:38] but uh\n[59:40] and this is flavored with a little bit\n[59:42] of mint to make it a little more\n[59:44] agreeable. Sometimes people find green\n[59:46] tea is not their favorite taste. Green\n[59:49] tea is rich in polyphenols, um which are\n[59:52] linked to benefits ranging from heart\n[59:54] and brain health to fat loss and cancer\n[59:56] prevention.\n[01:00:00] >> It's got a nice minty flavor.\n[01:00:03] >> Yeah.\n[01:00:04] >> You can live with that, couldn't you?\n[01:00:05] >> Yeah. Yeah,\n[01:00:06] >> my girlfriend again, she she's all over\n[01:00:07] this stuff. She's always bloody right.\n[01:00:09] >> Well, you know that learned that lesson\n[01:00:11] a long time ago.\n[01:00:12] >> I know, right? Like I say it all the\n[01:00:13] time on this podcast, but she's always\n[01:00:14] like 2, three years ahead of what then\n[01:00:17] someone really, really smart comes and\n[01:00:19] tells me and I spend those two or three\n[01:00:21] years in denial. I'm like, what the\n[01:00:22] is she like doing over there? Don't get\n[01:00:24] me started on cacao. If you start\n[01:00:25] talking to me about cacao, no, no, no,\n[01:00:27] no, no. She's been telling me\n[01:00:29] >> I'm gonna I'm gonna nail this because\n[01:00:31] there's a lot of people listening who\n[01:00:32] will want to hear this.\n[01:00:33] >> Okay,\n[01:00:34] >> Coco. Yeah,\n[01:00:35] >> chocolate, dark chocolate is a medicine.\n[01:00:39] End of\n[01:00:41] one of the best medicines around is 50 g\n[01:00:45] or 100 g of 75% or more dark chocolate.\n[01:00:49] Do you know what I've just realized? My\n[01:00:51] girlfriend, she's going to live till\n[01:00:52] she's 150 because she all she eats 90%\n[01:00:56] or something 80% dark chocolate. She\n[01:01:00] drinks green tea all day. She has\n[01:01:04] the ginger and cinnamon drinks all day.\n[01:01:08] She eats the the full rainbow.\n[01:01:10] >> She should be stepping in for you.\n[01:01:12] >> I know. I I know. Exactly.\n[01:01:14] >> No, Coco. Seriously,\n[01:01:18] brain health as well,\n[01:01:20] >> cardiovascular health.\n[01:01:22] >> I mean, they just they do studies where\n[01:01:24] they've put coco into volunteers. That\n[01:01:27] means students usually um you know so\n[01:01:29] young kids and they were able to show\n[01:01:32] changes in the blood flow within minutes\n[01:01:37] certainly within an hour of eating cocoa\n[01:01:41] >> beneficial changes in your blood flow.\n[01:01:43] >> They call it the heart medicine.\n[01:01:45] >> Yeah. No heart circulation brain.\n[01:01:49] >> So she's um my girlfriend's very\n[01:01:51] spiritual. She runs a business called\n[01:01:52] Bali Breathwork. Um #ad if I have to say\n[01:01:55] that. But in her business, one of the\n[01:01:57] things she does at the very start of the\n[01:01:58] session with women all over the world\n[01:02:00] that come to her retreats is she makes\n[01:02:02] cacao for them. And\n[01:02:05] you notice instantly how people change\n[01:02:08] when they've had a hot cup of cacao.\n[01:02:10] It's and and she says it like almost\n[01:02:12] brings out their heart. And I guess\n[01:02:14] that's because of the circulation\n[01:02:15] reasons. Yes,\n[01:02:16] >> it is. But it also of course we know it\n[01:02:19] contains a few other beneficial\n[01:02:21] stimulate stimulating effects sort of\n[01:02:23] similar to the effects with coffee which\n[01:02:26] in certainly as I've already said is a\n[01:02:27] medicine as well. Uh but cocoa and\n[01:02:30] chocolate does have a uplifting effect\n[01:02:33] which is why we love it. So\n[01:02:35] >> and we have to be clear here we're not\n[01:02:36] talking about hot chocolate that comes\n[01:02:38] from a packet or something necessarily.\n[01:02:40] >> We would like it to be as dark as\n[01:02:42] possible.\n[01:02:43] >> Okay. Sorry,\n[01:02:44] >> the less sugar, the less fat. Um, so we\n[01:02:48] talk about 75% cocoa solids, you know,\n[01:02:50] so it's dark chocolate and it tastes a\n[01:02:53] bit more medicinal, doesn't it? It's not\n[01:02:54] as sweet. Um, but I'm saying to many of\n[01:02:57] my patients, take 50 g a day. It's a\n[01:03:00] medicine.\n[01:03:02] >> Damn, she's right. My fridge is full of\n[01:03:05] dark chocolate. I tend to avoid it, but\n[01:03:07] the drawer of my fridge has all of her\n[01:03:09] dark chocolate in, and it's she she\n[01:03:11] likes it 90%. If she can get a 90%\n[01:03:13] she'll take it.\n[01:03:14] >> Yeah. 90% is quite good now.\n[01:03:17] >> Yeah.\n[01:03:17] >> Yeah.\n[01:03:18] >> Having a look at the green tea.\n[01:03:23] There was a study done in 2008 which\n[01:03:25] supports how it improved cognitive\n[01:03:27] function, memory, attention accuracy and\n[01:03:30] um long-term consumption associated with\n[01:03:32] lower risk of cognitive decline and\n[01:03:34] Alzheimer's disease according to the\n[01:03:36] Journal of Nutritional Biochemistry in\n[01:03:38] 2011.\n[01:03:39] It's nice to have somebody else just say\n[01:03:41] what you said.\n[01:03:42] >> Yeah, but it's it's ex exactly. I didn't\n[01:03:45] realize that. I didn't I had no idea.\n[01:03:48] I had no idea.\n[01:03:50] All those times I turned it down when\n[01:03:52] she offered it to me.\n[01:03:54] >> You can't say sorry.\n[01:03:55] >> I have literally literally I've got a\n[01:03:57] Wow. heart health, brain function, fat\n[01:04:01] burning and metabolism, cancer\n[01:04:03] prevention, early evidence, blood sugar\n[01:04:05] and insulin sensitivity, gut and oral\n[01:04:07] health.\n[01:04:12] If there's anything we need, it is\n[01:04:14] connection. Especially in the world\n[01:04:15] we're living in today. And that is\n[01:04:17] exactly why we created these\n[01:04:19] conversation cards. Because on this\n[01:04:20] show, when I sit here with my guest and\n[01:04:22] have those deep, intimate conversations,\n[01:04:25] this remarkable thing happens time and\n[01:04:27] time again. We feel deeply connected to\n[01:04:30] each other. At the end of every episode,\n[01:04:31] the guest I'm interviewing leaves a\n[01:04:33] question for the next guest, and we've\n[01:04:35] turned them into these conversation\n[01:04:37] cards. And we've added these twist cards\n[01:04:39] to make your conversations even more\n[01:04:40] interesting. And there are so many more\n[01:04:43] twists along the way with the\n[01:04:44] conversation cards. This is the brand\n[01:04:45] new edition. And for the first time\n[01:04:47] ever, I've added to the pack this gold\n[01:04:49] card, which is an exclusive question\n[01:04:51] from me. But I'm only putting the gold\n[01:04:54] cards in the first run of conversation\n[01:04:57] cards. So get yours now before the\n[01:04:58] limited edition gold cards are all gone.\n[01:05:01] Head to the link in the description\n[01:05:02] below.",
  "transcript_source": "youtube_captions",
  "has_timestamps": true
}