{
  "tweet_id": "2006104228381721052",
  "author": "thebeautyofsaas",
  "url": "https://x.com/thebeautyofsaas/status/2006104228381721052",
  "title": "X Thread",
  "content": "Title: BOSS on X: \"Random Quality Of Life Improvements That Will Change Your Life\" / X\n\nURL Source: https://x.com/thebeautyofsaas/status/2006104228381721052\n\nPublished Time: Wed, 31 Dec 2025 09:32:47 GMT\n\nMarkdown Content:\nBringing you a random list of things (activities, protocols, items) that will improve your life. Prepare yourself… 25 min reading time.\n\nWalk everywhere\n\nWe are starting with the most basic one, which you probably already know. But most are not doing it enough. Walk more. Your health will improve. Your creativity will improve. Your quality of life will improve as a result of those. Everything you can do by walking instead of taking the car. Do it by walking. We suggest that everyone start paying attention to how many steps they take each day. Once you have a good overview of where you are and how it works. Start aiming for 10k steps a day until you don’t feel it is a problem to reach that. Over time, you realize how easy it is to get those steps in and what you have been missing all along. This sounds stupid until it doesn’t. Benefits are real, even if we put aside all the health ones.\n\nGet used to the silence (forget about podcasts, music…)\n\nWe are big believers that the noise around you and the constant distraction of music, podcasts, or YouTube in the background destroy your attention span. Not only does it destroy it. It robs you of the present moment and the joy you can experience while doing what you are doing. No matter how ridiculous it sounds. Everything you are doing is bringing something or at least shaping you in some subconscious way. Not convinced? Invest $2 in a cheap box of earplugs. Try working with them vs. working without them. Once it clicks, you will not be able to go back.\n\n[![Image 1: Image](https://pbs.twimg.com/media/G9cY02fWAAAHVVR?format=jpg&name=small)](https://x.com/thebeautyofsaas/article/2006104228381721052/media/2006099455276089344)\n\nThere is are no limits to what you can achieve.\n\nRemove all the negative associations with yourself\n\nCliche as it sounds. If you truly believe you can't achieve something or that something is holding you down (a set of beliefs). There is a good chance that it is completely right, and you could be your own biggest enemy. Nothing will make sense, and you won't get anywhere if you are held back by your beliefs and who you are. The key to a good quality of life is believing that you are capable and that you deserve to achieve what you want.\n\nPen and paper\n\nPocket notebook + pen = everything you need to turn your dreams into reality. The ultimate productivity tool. No reason to repeat ourselves. It has helped us and others around us to a point where we feel it is getting mentioned every other time. Everything you write down on paper will become your reality. Sooner or later.\n\nNotifications OFF at all times\n\nOne of those things that will have a massive improvement on the quality of life. The results of having notifications off? Better focus. Less distractions and even in some cases (less anxiety). Notifications should ONLY be on for family members and emergencies. This applies to all your devices.\n\n1.   Health\n\n2.   Time\n\n3.   Money\n\nThe #1 focus should always be health. Without health, you don’t have anything else. Neither time or you have the opportunity to make money. What about time? Similar concept. Money? Again, builds on the other two. They are all connected, and one has a direct influence over the other. To make this more practical. If you have to make a choice, always go for the things that will improve your health. After that, something that will help save you time. Last one? One that will make you money or help you make money. Without health, you don’t have time. Without time, you don’t have money. Without money? If you are consuming the right material and executing… There is nothing to worry about. Sooner or later, you will have more than enough of it.\n\nIt is one of those things that will either provide you with a completely new outlook on life or make you miserable. You have been warned.\n\nCost Of Your Lifestyle (Time Habits)\n\nLet’s say you are trying to balance between going to the gym and starting your side business. You are already working for someone else, and all the free time you have is precious. By understanding your chronotype and what kind of performer you are (early or late night). There is a good chance you know when to prioritize work and when to prioritize the gym. Let's say you decide to wake up at 6 am every day to work on your side business before heading to work (since you are an early bird). You could then allocate gym time after your standard work and do a bit of admin for your side business once you are done with the gym (later in the day). Meaning that the main work for your side business happens in the morning, while the admin stuff is done at night.Where do things get interesting, and why does this matter?\n\nIf you decide to break it down further:\n\n*   Waking up 1 hour earlier (you go to the gym 3x per week) → 3 hours per week.\n\n*   3 hours per week * 4 weeks → 12 hours per month\n\n*   12 hours per month * 12 months → 144 hours per year\n\n*   144 hours per year → 6 full days\n\nTo be 100% transparent… 144 hours per year won't make or break you. It is not that much when you look at the whole year - about 1.5% of the entire year. What will make or break you is when you start considering things from a more macro perspective. Add a few more activities on top of this, and suddenly you have 2–3 weeks of extra time with just a little planning… It doesn't take a genius to see the power of this and how easily it adds up. Our advice? Don’t sleep on this.\n\nCost Of Your Time (Money Habits)\n\nSimilar to the concept of habits mentioned above. To make it more practical and give you a full overview of how you can look at it.Let’s say you are making $10K/month. If we decide to break it down further:\n\n*   10K/30 days = $333 → Your day is worth $333\n\n*   10K/30 days * 24 hours → Your hour is worth $13.89\n\n*   10K/30 days * 24 hours * 60 seconds → Your minute is worth $0.23\n\nThe same principles as above… But a bit different. The way you should approach it is - if you have a task or something you hate doing, and you can justify the cost associated with it. Better said, someone to take care of the thing you hate doing. It is a straightforward choice. Hate cleaning your house, and you live somewhere remote where a housekeeper costs $10 an hour. You can definitely afford it a few times a week for a few hours each time. Are you wasting your energy and time doing what you absolutely hate? Just stop. The same principle applies to most stuff. It is one of those POVs that can either destroy you or provide you with a new perspective (depending on your personality). Positive in a way that you will always have the option not to do what you don’t want to and to pay someone else. Negative, once you start comparing how much time it will take to achieve what you want (car, vacation, paying off a mortgage, etc.)\n\nHow these two affect the quality of your life: Because they serve the most basic purpose we all tend to ignore and not pay enough attention to. They make you think. How are you spending your time? Could you do it better? Was there a smarter alternative, and how long will it take you to achieve something? The reason we put it as a warning is that, if you go deep enough, it could backfire, pointing out that you are wasting your time and doing things wrong. Something you want to think about and pay attention to. This could be either the best or the worst part of the post. We will stop here, and we recommend you give it some thought and consider how this could make you more aware.\n\nOne that should make you think…\n\nSomeday you would give anything for just 3 minutes of this:Mindset one. Big one. Powerful one. Baby crying at 2am? Partner complaining about their day? Parents pissing you off with their old-world takes? All of us will find ourselves in a position where we think the same thought. No one can deny that we all take things for granted. Those things we used to dream about and thought we believed would change everything… Represent nothing else but a weight on us (or at least it feels as such at the moment). Others are straight-up ungrateful. Both are common scenarios. This POV serves as a great reminder not to take things for granted and to appreciate where we are and what we have. Once, it represented everything you ever wanted, and now you take it for granted? There is beauty in the small stuff, and this should remind you of that. If you can take this and implement it… Your quality of life will skyrocket.\n\n1. Never tell anyone how much money you make: Yes, we are serious. Yes, this goes under the quality of life topic. There is no reason you should tell anyone how well you are doing. Just tell everyone that you are part of the herd and making an average income. Forget about being 100% transparent or letting others know what you are up to. It is a net negative game that only brings enemies. What happens if you give them the real number? They will hate you.\n\n2. Upgrade your sleep:Once you start spending time around the real heavy hitters… You realize that all of them fall into the two categories:\n\n*   People who take care of their sleep to ridiculous levels\n\n*   People who don’t sleep at all (or minimal)\n\nDepending on what you are doing, there is a good chance that you will have to mix between both. Or at least have periods where you will have to optimize for sleep and not sleep at all. At the same time, category b) appears to be drastically older than category a). This is purely based on the looks - not even going into the health discussion here. That tells you everything about the importance of sleep on your energy and health. The lowest effort improvement to the quality of life thing you can start doing is waking up / going to sleep at the same time. Another one we have already recommended on our Twitter is sleeping in sync with your sleep cycle or using tools like Sleepytime. The same advice applies to weekends. This allows you to ignore the part where you are forcing your body to adjust, or makes you feel unrefreshed when waking up. The importance of all this becomes more obvious once you are out of their 20s and still in the grind mode.Want to take it a step further?\n\n*   Level 1: Regular wake-up/sleep-in time (even on weekends)\n\n*   Level 2: No eating before sleeping (at least 3 - 4 hours), no exercises before sleeping, magnesium, blackout curtains (or sleeping mask)\n\n*   Level 3: Sunlight exposure, colder environment, an eight-inch sleep mattress or similar.\n\nIt goes deep and our advice is to at least cover level 1. and parts of the level 2. Leaving it up to you to decide.\n\n3. If you want to be where others are not, you have to live in a way no one else does:Pretty self-explanatory. The MASSIVE quality of life lifestyle advice is to go against the mainstream media. Do the opposite. Don't fall for the 40 year old mortgage trap. Don’t fall for this idea that others know better than you. Don’t let yourself think you are not worth it. Once you start doing what others around you are not doing, you will see the possibilities and what has been meant for you. It has never been easier to stand out and do what others around you are not doing because they are too busy wasting their lives. When everyone is eating slop food. You eat clean. When everyone is spending their time watching Netflix. You study. When everyone is getting into debt. You invest in assets. Keep this as a baseline because otherwise this might turn into a whole rant. Do the opposite of the masses. Do the opposite of what the mainstream media does. Live a happy life. You only get one, and it is a beautiful one… Risk + effort = always rewarded in the end.\n\n[![Image 2: Image](https://pbs.twimg.com/media/G9cZ97NWYAAWLH0?format=jpg&name=small)](https://x.com/thebeautyofsaas/article/2006104228381721052/media/2006100710673244160)\n\nYou don’t want to be part of this.\n\n4. Read every day:Not because it will make you smarter or better at communicating. More so because you are the reader of this website, which means that sooner or later you will find yourself in the company of those who know how to talk and won’t be bothered talking about sports or what was the latest show on Netflix. Young people have fallen for this psyop that reading books is a waste of time. Reading BAD books is a waste of time. Reading GOOD books is the key to accessing the ancient knowledge we lost over time. It will also help you with focus and make you better at connecting general ideas and principles. Forming big pictures and communicating them. You should have at least one or two books to read at all times. Which brings us to the next point…\n\n5. Learning how to communicate to the masses: The reason we are putting this under the quality of life is that it is an important concept to grasp and be aware of. As a result, it will affect the quality of your life. Improve it. What do we mean by that? Most people around you are operating based on the 8th-grade max. Meaning that if you are trying to communicate your message, and for some reason it is not sticking with the masses. There is a good chance that they don’t understand you. Where does this come in handy? When you are selling something or trying to explain it to others. Playing with the emotions of the masses is 10x easier than playing with those who know what they want. On the other hand, if you are dealing with the top 20% and those who know what they want (smart and rich people), you have to do your communicating differently. Less emotional phrases, more logic, learning how to be direct and use more complex words (sort of a filtering method). Something we have already covered in our social skills guide.\n\n![Image 3](https://pbs.twimg.com/amplify_video_thumb/2006103135048048641/img/Recl4A6RWOs6MImX.jpg)\n\nDo you never notice that devices and screens aren’t in your dreams? – Brian Chesky. All credits TBPN.\n\n6. Going off the radar for 24/48 hours:The video above brings. Suppose to this point. If you are already thinking to yourself. Why would anyone do this? Or you can’t do this because of _____ reason. You are wrong. Going off the radar and unplugging from the chaos that your mobile phone causes makes a big difference. Similar to the above point of turning all the notifications off. Creativity, thoughts, a sense of freedom, and purpose. If you are a business owner reading this, we all know that if you set up your systems correctly, nothing will happen and everything should work effortlessly, even if you take a whole week off and not just 48 hours. Our advice? Decide this month to take a day or two off from your mobile phone and social media. It is hard to put into words how refreshed you will feel after it with a clear vision.\n\nOur definition of going off the radar:\n\n*   No mobile phone (for scrolling or other useless stuff, you want to be available for REAL emergency calls).\n\n*   No social media.\n\n*   No consumption of any unnecessary material in your life (stick to books if possible or vouched stuff).\n\n7. AI + right information:We have already covered the power of the Notebook LM and how to approach using it. The real power of AI (right now) is that you can reference everything relevant in minutes instead of hours. The basic example should make our point clear. The quality of your life should improve through increased efficiency and using the right materials. Let’s say you went to the doctor for bloodwork. Everything seems fine, except for the one thing that has always been a problem for you (vitamin _____). Recently, you read a book by someone who claims they can help fix that problem. Instead of rereading the entire book or going chapter by chapter, try to reference and identify the exact problem you are experiencing - in this case vitamin deficiency. What you are doing is feeding the AI with that same book. Feed the AI your bloodwork results. Ask it to pinpoint exactly what’s relevant from the book and how you can use it to your advantage, given your situation. This is the real beauty and a use case that doesn’t get enough attention. Not just randomly referencing materials online, but being specific about it. You are in a position to reference the best material from the best artists, scientists, and creators, then compare it to what you are experiencing and going through. Imagine how many hours you can save by doing this and getting the best possible results. We are mentioning this because it doesn’t get enough attention as a REAL use case of AI.\n\n[![Image 4: Image](https://pbs.twimg.com/media/G9caiCTW4AAi3fa?format=png&name=small)](https://x.com/thebeautyofsaas/article/2006104228381721052/media/2006101331052781568)\n\n8.You are just one DM (or email) away from changing your life:If you had to take one thing out of this whole post, it is this one. Start contacting the people you admire, those who inspire you, and those who can give you the opportunities you want to be a part of. This is one of those things you will never believe until you do it and see the results. All it takes to change your whole perspective on this topic is to get positive feedback, an answer, or an opportunity. It is one of those things that has no negative consequences, yet the positives are hard to match. From the simple thank you email to asking for an opportunity. It is really all it takes, and it might just change your life…\n\n9. Spend hours on finding a stress protocol that works for you:This is another fairly uncommon principle that doesn't get the necessary attention. As the things you are doing and growing + you being exposed to new stuff… There will be a breaking point. No, we are not talking about burnout or going insane. But at the same time, something you can prolong even for years if done right. All of us have different levels of stress resilience, and it is one of those abilities (the ability to handle stress) that should be cherished yet never gets enough attention. Stress is a warning signal:\n\n1.   That you are not doing what you should be doing in the first place\n\n2.   That you are doing too much of it and don’t have complete control (going to fall off the wagon).\n\nIt comes from the fact that your subconscious didn't pick it up, which is why you are feeling stressed in the first place. Our advice is to start paying attention to what relaxes you. Do you have any fast tricks to help yourself? Proper breathing might be one of them. It changed our lives. It might change yours. Maybe it is power naps? Some swear by going to a sauna or taking a steaming hot shower to get back on track. Some swear by doing creative work. Some swear by doing extreme sports. The question is, what do you swear by? Do you know what relaxes you or what can break your negative thinking pattern? If not. You have a lot of work to do, and it is not something you should take lightly. Quite the opposite. This is one of those things that makes a massive difference to the quality of your life. But it is never obvious until you find yourself in a constant 24/7 pressure scenario. One in which every small activity that relaxes you makes a big difference. This is something you should spend time on.\n\n10. Feeling down and blocked expression:This is something that Sultanic described perfectly in one of his posts. The reason you are feeling down (or depressed) is because you are holding back who you are and not expressing your emotions. What happens when your forms of expression are blocked? You get depressed. Not convinced this is 100% right? Ask yourself why people feel better after a therapy session or while having one. Maybe you had some. What is the answer? The answer is because they are constantly expressing their emotions. Say what you want to get out of your situation, be honest with yourself and others, do what you want to do… Not necessarily by offloading everything to others. But doing it in a more strategic way (or direct if you can trust them). Learn to become the creator of your own kingdom.\n\n[![Image 5: Image](https://pbs.twimg.com/media/G9cay5lXIAEvccW?format=jpg&name=small)](https://x.com/thebeautyofsaas/article/2006104228381721052/media/2006101620770152449)\n\nScene from the legendary movie.\n\n11. The key to living a productive life is always to minimize:You want to have as few things as possible to give yourself enough space. Meaning you will not have to come up with the excuse for why you are not doing what you should be doing. This principle applies to all areas of your life. Basic example? Everyone knows someone who goes to the gym, does only a few compound movements, and eats the right food. That same person often beats those who half-ass their 6-day splits, not taking nutrition seriously, and taking a bunch of supplements. This is the perfect example of this - excluding any genetics discussions. It is always about minimizing and focusing on the things that actually matter. Once you pass that phase and gain everything you can from that phase. Which will happen and must as part of your progress. It is time to start adding things up and creating systems and the things you are enjoying.\n\n12. Replace podcasts, audiobooks, and music with phone calls:Next time you are driving or walking somewhere where you need to be. Instead of listening to something and stimulating your mind. The time you have would be better spent by calling and talking to the people you care about. It is the #1 way to show people you appreciate them and to keep them in your life. We are not sure why this doesn’t get more attention. But it is one of the easiest ways to stay connected with people and make them feel good (a key to a good social life. Want to take it further? Build your social circle.\n\n13. Change your workspace:One basic creativity hack that plays a big role for those doing 100% creative work is to change your workspace every day. What do we mean by that? Take your laptop and go out. Get out of your house and go to the closest hotel lobby, coffee place, or McDonald’s. Somewhere where you will be able to sit down and work. Want to take it to the next level? Go somewhere that inspires you to be there in the first place. This sounds ridiculous until you start using it and notice the difference between working in your office all the time vs. going somewhere else.\n\n[![Image 6: Image](https://pbs.twimg.com/media/G9ca8G7XMAAayug?format=png&name=small)](https://x.com/thebeautyofsaas/article/2006104228381721052/media/2006101778970914816)\n\n14. Spontaneity: It seems like a lost art at this point. You are one click away from knowing where your friends are or seeing what is happening around you. Social media, instant messages, and everything else that comes with it. The byproduct of knowing everything in a matter of minutes has killed a big part of the enjoyment and quality of life. Spontaneity. When was the last time you did something out of the ordinary? We would be everyone who, if they had an hour or two to reflect on their “favorite memories” and things they have enjoyed the most, would come out from spontaneity. Why are we mentioning this? Because it is one of those keys to a fulfilled life with a bunch of memories. Random travels, nightouts, dinners, or road trips. Those spontaneous arrangements (made out of the impulse) are usually the ones you will remember for the rest of your life. Our advice here is to give in. Don't be too hard on yourself, especially if you are a young person already working on your mission and goals. You have too much space to be spontaneous and impulsive. As a result, those memories will last a lifetime. Trust us on this… You will not regret it.\n\n> I encountered authority of a different kind than I had ever encountered before, and I did not like it. And they really almost got me. They came close to really beating any curiosity out of me. - Steve Jobs\n\n15. Protect your curiosity at all costs:Learn how to spark it. The reason this goes under the quality of life because curiosity and your ability to dive deeper into topics and expand on other topics from it. Plays a massive role in your happiness and overall quality. There is not much to add except that you need to find out what gets you going and don’t fall for the norms around you. What do we mean by that? Whether you love him or hate him, Steve Jobs explained it well when asked about school. The same applies to being surrounded by boring people, a job you hate, or any other form of environment you hate. To give you an answer on the more practical level, how do you protect your curiosity by not surrounding yourself with stuff that YOU hate and despise? Simple as that.\n\n[![Image 7: Image](https://pbs.twimg.com/media/G9cbF1YXMAA-xR4?format=png&name=small)](https://x.com/thebeautyofsaas/article/2006104228381721052/media/2006101946059403264)\n\n16. Getting the most out of your supplementation (energy):More on the health side. One basic approach to getting more outcomes is to have your DNA tested (as mentioned earlier - be creative with it). Download your raw DNA data and upload it to Genetic Genie. Once it is done, you should be given a panel of common deficiencies based on your DNA (which should serve as a basis for your nutrition). The final step?Use Chris Masterjohn’s choline calculator. Which should provide you with choline intake and how much you should consume (important one when it comes to energy). This goes much deeper. But it should provide you with solid, overall assumptions and a good target to aim for (cover common deficiencies).\n\n17. Stop consuming lifestyle (luxury, money, motivational) content:This advice is especially for our younger audience. If you follow those old money/accounts on social media, we advise you to unfollow them asap. The same applies to any celebrity who is flexing or trying to show off. Why? Because they can make you miserable and constantly put you in comparison mode. What happens when you are miserable and in comparison mode? You lack the energy and drive. The results of that? You don’t work hard or put effort… Or you are thinking short term, just trying to mimic what they do. How much money I have vs. _____. The only comparison you should be doing is you vs. you previous year. Avoid. Worth mentioning, half of those people you look up to are not nearly as rich as you tend to think they are. There is a good chance that with five years of effort, you could have more than they do.\n\n18. Once you understand how to make money:Again, the above point leads us to this topic. Once you truly understand how to make it and make money. There is no doubt you will get rich. The problem is that it takes time. Why is that a problem? Because you will have to psyop yourself up to a point where doing the exact thing over and over again (boring things) won’t feel boring. This is where most start doing degen stuff once money begins flowing in and get lost somewhere in the process. Once you understand what it takes to make money. It all becomes easy.\n\n19. The reason you should never retire (and most likely never will):When we talk about retirement, we are not talking about something you “Deserve” after spending enough time working 9-to-5. The idea of retirement goes much deeper. That one time, somewhere later in life, you are finally free to do the things you always wanted to do. Read this last sentence again. It sounds miserable. Because it is miserable. The entire concept of retirement has been misunderstood and will continue to be. Retirement is a state of mind. That is the best way to describe it. You are 10x better off realizing that saving your big dreams for later doesn’t make much sense. This doesn't mean you should be extreme and live day to day. It just means you need to always strive for the alone and forget this idea. The same applies to FIRE people and their concept of penny pinching to be free one day… It won’t happen. Many of you are the kind of person who experienced childhood trauma or grew up in a poor environment (nothing wrong with that). It is just that you will never feel like you have enough and even if you do. It will come much later in life.\n\nFew more reasons why retirement is a cope:\n\n1.   You don’t have the same energy as before.\n\n2.   Some of your close associates and friends will be gone… Hard concept to grasp, but the truth.\n\n3.   Health? You are lucky if you are healthy.\n\n> Retirement is just a socially acceptable way to give up and stop pretending to care. - Random Reddit comment\n\nThings you already know about:\n\n1.   Walk as much as possible\n\n2.   Learn to enjoy the silence and work in it. Your life will change (+ get earplugs they will help you a lot)\n\n3.   Remove all the negative associations with your life\n\n4.   Pen and paper over everything else… As always\n\n5.   Notifications of all on on devices. At all times\n\nHow to prioritize:\n\n1.   Health\n\n2.   Time\n\n3.   Money\n\nSomething to make you think:\n\n1.   Time habits\n\n2.   Money habits\n\n3.   Don’t take things for granted. You used to dream about them.\n\nStuff that matters:\n\n1.   Never tell anyone how much you make\n\n2.   Get proper sleep (or at least try to do)\n\n3.   Live in a way no one else does (do the opposite)\n\n4.   Read every day\n\n5.   Learn to communicate\n\n6.   Go off the radar 48 hours\n\n7.   Use the AI the right way\n\n8.   You are one DM away from changing your life\n\n9.   Find a stress protocol that works for you\n\n10.   Learn how to communicate your emotions (#1 way to not get depressed)\n\n11.   Always minimize (less is more)\n\n12.   Phone calls > podcasts, audiobooks, and music\n\n13.   Change your workspace often (Creativity hack)\n\n14.   Spontaneity\n\n15.   Protect your curiosity (Not enough talk about this)\n\n16.   Get the most out of your supplementation\n\n17.   Stop comparing yourself (consuming lifestyle material)\n\n18.   Once you understand how to make money…\n\n19.   You most likely never will retire (largely it is a cope)\n",
  "date": "2025-12-31",
  "source": "twitter"
}