{
  "video_id": "G9MO0",
  "channel_slug": "jay-shetty-podcast-2025",
  "date": "08-04-gEF67",
  "transcript": "============================================================\nTitle: Alex Hormozi: How To Make So Much Money You Question The Meaning Of It\nChannel: Jay Shetty Podcast\nDuration: 2:02:52\nURL: https://www.youtube.com/watch?v=gEF67-G9MO0\nVideo ID: gEF67-G9MO0\nTranscript source: youtube_captions\n============================================================\n\nCHAPTERS:\n----------------------------------------\n  [0:00] Intro\n  [0:40] Get Clear on the Exact Actions That Drive Success\n  [2:10] Why Most People Misunderstand How to Build a Business\n  [4:26] Is the ‘Get Rich Quick’ Model Really Possible?\n  [7:41] The Five Emotional Stages Every Entrepreneur Goes Through\n  [10:52] Start Here to Learn the Skills That Actually Make Money\n  [13:36] Should You Follow Your Passion for Income?\n  [23:30] How to Make Your First Dollar from Nothing\n  [27:57] The 10 by 10 Strategy to Build Proof and Confidence\n  [32:27] Your Product Must Solve a Real Problem\n  [35:37] What No One Tells You About the Trade-Offs of Business\n  [39:40] How to Turn Your Job Experience into a Business\n  [52:27] Redefining Success: It’s Not About the Outcome\n  [56:07] Listen to People Who Are Where You Want to Be\n  [1:02:18] Overcoming the Fear of Selling Ourselves\n  [1:04:23] How to Influence Without Manipulating\n  [1:10:17] The Difference Between Criticism and Insults\n  [1:17:28] How to Break Repetitive Negative Behavior\n  [1:26:15] When to Keep Pushing and When to Pivot\n  [1:28:46] The Four Ingredients of an Irresistible Offer\n  [1:37:02] Focus on Who You Want to Become Not Just What You Want\n  [1:38:40] What Would You Do If You Weren’t Afraid?\n  [1:42:46] The Simple Formula Everybody Has But Nobody is Doing\n  [1:45:53] The Most Important Step Is Just Start\n  [1:47:05] Is Work Life Balance Really Achievable?\n  [1:50:35] Be More Productive by Eliminating Everything Unnecessary\n  [1:55:17] Alex on Final Five\n----------------------------------------\n[00:00] You can build something very big in\n[00:02] about 5 to seven years. And the problem\n[00:03] is most people spend that same 5 to\n[00:06] seven years reliving the same 30 days\n[00:08] over and over again. You have to stay in\n[00:10] that painful place. Staying in the pain\n[00:12] is what gives you the catalyst to learn\n[00:16] how to get out of pain.\n[00:17] >> Please welcome a serial entrepreneur,\n[00:20] best-selling author, and the mind behind\n[00:22] a 100 million business portfolio, Alex\n[00:25] Hormosi.\n[00:27] What's that number one misconception you\n[00:29] hear when people are thinking about\n[00:30] building a business and you go that's\n[00:32] the issue?\n[00:32] >> I think they conflate sequence. A lot of\n[00:34] people who are wanting to make money\n[00:35] believe that the making money comes from\n[00:38] investing. Investing is the last thing\n[00:40] you do, not the first thing you do.\n[00:43] >> How do you get over the block of I don't\n[00:44] want to work for free?\n[00:45] >> I actually think it's entitlement.\n[00:47] You're not working for free. You're\n[00:48] learning and then you're earning.\n[00:50] >> Should you do what you love for money\n[00:52] and love what you do?\n[00:53] >> I think this is big myth number two.\n[00:56] People fail not because there's some\n[00:58] magical list nobody has. They fail\n[01:01] because it's an obvious list nobody\n[01:03] does.\n[01:04] >> It's the obvious list. If you were\n[01:05] trying to get in shape, you know you\n[01:06] should eat less and you should move\n[01:07] more. You already know what you're\n[01:09] supposed to do. The question is why you\n[01:10] aren't doing it.\n[01:12] >> What do you think is the number one\n[01:14] emotion that people don't know how to\n[01:16] control that leads to failure?\n[01:18] >> Fear.\n[01:21] >> The number one health and wellness\n[01:22] podcast.\n[01:23] >> J Shetty.\n[01:24] >> J Shetty. the one, the only J Shetty.\n[01:29] >> Alexi, I've been looking forward to this\n[01:32] interview for a long, long time. My\n[01:33] friends are fans. I'm a fan. And I know\n[01:37] we were in touch like maybe even a\n[01:38] couple of years ago now it's been,\n[01:40] >> but I'm so happy to be at the holy grail\n[01:43] of acquisition.com. I saw the big logo\n[01:46] when I walked in. Congratulations on\n[01:48] everything you've been up to and I'm so\n[01:49] glad to introduce you to my audience,\n[01:51] some of who I'm sure follow you already\n[01:53] and love your work. And then I'm hoping\n[01:55] you get a ton of new fans and a ton of\n[01:57] new people being impacted through this\n[01:58] as well. So, thank you so much for doing\n[02:00] this.\n[02:00] >> Well, thank you so much for having me\n[02:01] and I've been I'd say I mirror it right\n[02:03] back. We've been I've been looking\n[02:04] forward to talking because I think\n[02:06] there's there's so much good stuff that\n[02:07] I think is going to happen. So, I'm very\n[02:09] excited.\n[02:09] >> I love it. Alex, I want to start with\n[02:11] asking you something that I've been\n[02:12] thinking about a lot when I'm talking to\n[02:14] people today and it's when I think about\n[02:16] my community, my audience who's\n[02:17] listening right now.\n[02:19] >> What are you going to unblock for them?\n[02:22] >> When you if someone read all your books,\n[02:25] listen to your podcast, listen to\n[02:26] today's podcast, what are they going to\n[02:29] unblock that's been tripping them up,\n[02:31] keeping them behind or holding them\n[02:33] back? I think they would have clarity on\n[02:35] what actions were required to get what\n[02:39] they wanted and then at that point they\n[02:41] would only have to just think like why\n[02:42] am I not doing it which is a separate\n[02:44] conversation but there's a lot of\n[02:46] confusion I would say around like what\n[02:48] are the things that are required in\n[02:49] order to create a business in order to\n[02:51] create an income I would say that I'm an\n[02:53] objectivist and so I just look at what\n[02:54] are the things that are observable and I\n[02:56] think a lot of time people spend inside\n[02:58] their heads trying to think about\n[03:00] manifesting and energy and all of this\n[03:02] stuff when it's like we got to let\n[03:04] people know about the stuff we have. We\n[03:05] got to have something to sell and we got\n[03:07] to make sure that what we're charging\n[03:08] costs less than than it costs to deliver\n[03:10] it. And we try and do that as many times\n[03:11] as we can. And so each of those pieces\n[03:13] obviously has frameworks behind them.\n[03:15] But they're all tied to one thing which\n[03:17] is just what actions are required. And\n[03:18] that's been the single pervasive frame\n[03:22] in my life that has made navigating\n[03:24] reality significantly easier for me cuz\n[03:26] I was very confused coming up and I was\n[03:27] like, I don't know what any of this is.\n[03:28] and I read all these self-help books and\n[03:30] and I felt more confused after the 10th\n[03:32] book than I did on the first book and\n[03:33] and then it was just like okay what do I\n[03:35] have to do and then that is kind of what\n[03:37] has started this journey for me.\n[03:38] >> What's that number one misconception you\n[03:40] hear when people are thinking about\n[03:43] building a business making money\n[03:44] changing their financial situation?\n[03:46] What's the number one thing you hear and\n[03:48] you go that's the issue? I think the\n[03:49] conflate sequence is probably the first\n[03:51] and biggest thing because a lot of\n[03:53] people who are wanting to make money\n[03:55] believe that the making money comes from\n[03:57] investing and investing is the last\n[04:00] thing you do, not the first thing you\n[04:01] do. And so one of the things is they'll\n[04:03] look at people who are at the end of\n[04:04] their careers and say, \"Okay, well these\n[04:05] guys are making all these, you know,\n[04:07] these bets, right? I if I if I just\n[04:09] bought this memecoin or I just bought\n[04:10] Bitcoin in 2013, I'd be super rich.\" But\n[04:12] it actually doesn't take into\n[04:14] consideration what a decision-making\n[04:15] process like that would create, which is\n[04:17] if you took a swing at every type of\n[04:19] Bitcoin, because you can't just say, \"I\n[04:20] would only pick this one.\" You'd have to\n[04:21] say, \"I'd pick every single super long\n[04:23] shot.\" It's like we probably would have\n[04:24] lost them 99 of the other bets.\n[04:26] >> And so it's like we have to take it in\n[04:27] aggregate. And so I would say making\n[04:30] active income cool again uh rather than\n[04:33] the passive bet and really just gambling\n[04:35] um is probably the the first thing that\n[04:37] that people mess up is that they're they\n[04:39] somehow think that working or active\n[04:41] income is not scalable when in reality\n[04:44] the people who have the most money\n[04:45] typically have tremendously high incomes\n[04:47] and it's because of the excess of cash\n[04:49] flow from that income are they able now\n[04:50] to make big swings with riskier bets\n[04:53] that sometimes pay off and sometimes\n[04:54] don't. But you can't take those swings\n[04:56] unless you have more cash flows coming\n[04:58] in from the things you do every day.\n[05:00] >> You know what? No one's ever said it\n[05:02] that well, like from everyone I've\n[05:03] spoken to. And I'm so glad you pointed\n[05:04] it out because I completely agree. I\n[05:08] have so many friends who when they saw\n[05:11] the rise of crypto or whatever it was,\n[05:13] jumped in with a large sum of their life\n[05:17] savings\n[05:18] >> because they heard of a friend of a\n[05:19] friend of a friend who'd made a killing.\n[05:22] >> Put it all in there. A week later it\n[05:25] dropped by like 10k. They pulled it all\n[05:28] out. The next week it went up double\n[05:30] like and and it was just a mess. And so\n[05:32] many of them lost like 10 20 30 40,000\n[05:35] dollars.\n[05:36] >> And it's all because you're thinking\n[05:39] that's the way to get there\n[05:41] >> and it's cooler and it's smarter and\n[05:42] like you're a genius\n[05:44] >> if you And you're right. Actually,\n[05:45] everyone I know that's made amazing\n[05:47] money on any of that already had tons of\n[05:50] money and it was play money for them.\n[05:52] Yeah. So it just changed into this. So\n[05:54] what's happening there? Why is it that\n[05:56] we've been led down this thought process\n[05:58] and how do we get out of it?\n[06:00] >> I mean I think it's fundamentally the\n[06:01] something for nothing fallacy of like\n[06:02] how can I get rich quick? How can I do\n[06:04] it really easily? And um basically the\n[06:06] more it feels like luck is usually where\n[06:08] you should have your first red flag. If\n[06:10] you I mean I have a belief that if you\n[06:12] control all the variables then you can\n[06:14] predict the outcome. Now, we don't\n[06:16] always control all the variables in any\n[06:17] given situation, but the greater number\n[06:20] of variables we control, the greater\n[06:21] influence we have over the outcome. And\n[06:23] if you're getting into something like\n[06:24] this and you're like, I actually don't\n[06:25] even know what the variables are. Then\n[06:26] it's like, you are you are 100%\n[06:28] gambling. And so, this is your life\n[06:29] savings. Would you put it on black at\n[06:31] the casino? Probably not. This is really\n[06:34] not that different than that. Except at\n[06:36] the casino, you have no nods at least\n[06:38] right here. It's like you have no idea.\n[06:40] And typically by the time especially\n[06:41] Genpop uh kind of retail investors find\n[06:44] out about something it is the peak and\n[06:47] it is too late. And so you have to be at\n[06:49] the very beginning of these if you want\n[06:50] to be speculative, which I\n[06:52] wholeheartedly am not a big fan of\n[06:53] speculative investments in general\n[06:54] because it's basically the greater fool\n[06:56] theory, which is what they call it in\n[06:57] the investment world, which is just like\n[06:58] we just keep selling to the greater and\n[07:00] greater fool until sometime somebody is\n[07:02] the greatest fool of all and then it\n[07:03] drops, right? And so I prefer to think\n[07:05] about instead of thinking of investments\n[07:07] and active income, I think of just money\n[07:09] per unit of time. And that kind of takes\n[07:12] out this binary or what I would consider\n[07:13] a false binary of active and passive and\n[07:16] think well and I I I feel like I can\n[07:18] prove this pretty clearly which is we\n[07:20] live in time and we collect money in\n[07:23] that period of time. And so\n[07:24] fundamentally all we want to do if we\n[07:26] want to increase our income is just\n[07:27] think what are we earning per unit and\n[07:29] this is where again bad piece of advice\n[07:30] is like never sell your time. It's like\n[07:32] okay well if someone gave you a billion\n[07:33] dollars for an hour would you not sell\n[07:35] that? I would, right? And so, it's a\n[07:38] question of how much is your time worth?\n[07:40] And then that creates a much more\n[07:41] actionable uh decision-making framework\n[07:43] of is this worth it or not? And to lad\n[07:46] up to the active versus passive, it's\n[07:49] how active is it versus how passive is\n[07:52] it? And it's my belief that nothing is\n[07:54] passive because there's always going to\n[07:56] be a certain amount of if you're doing\n[07:57] it right. Let's say if you you made one\n[07:59] passive investment, if you're doing it\n[08:00] the right way, you probably should have\n[08:02] looked at a hundred deals and all of\n[08:04] that took time. And all of that takes\n[08:06] diligence. And then after doing all this\n[08:07] analysis, then you decide to make this\n[08:09] investment. And so to say that it's\n[08:11] passive, it's like it doesn't take into\n[08:13] account all of the research that goes\n[08:14] into ahead of time, which is absolutely\n[08:15] still work. Now after the investment,\n[08:17] sure, but there's still time that you're\n[08:19] trading by first breaking that idea of\n[08:21] like if for in order for me to get rich,\n[08:23] it must be something that I don't trade\n[08:24] my time for, I think is like big myth\n[08:26] number one. So if we assume that, then\n[08:29] we say, okay, I have to trade my time\n[08:31] for money because money comes in over\n[08:32] time. what are the things that I can\n[08:34] trade my time for that will get me more\n[08:36] than I'm currently getting which is a\n[08:37] much more solvable problem that also is\n[08:39] significantly less risky and so\n[08:41] especially when you're trading time we\n[08:42] have some and so we don't we really just\n[08:45] risk the time to be like I would I never\n[08:46] want to I don't want to sell my I'm not\n[08:48] a I'm not a slave it's like calm down\n[08:50] we're it's a voluntary exchange and if\n[08:52] it's and here's the thing is if you\n[08:53] don't think the price is worth it then\n[08:55] don't make the trade and that's one of\n[08:56] the beauties of capitalism is it's two\n[08:57] parties both saying they'll be better\n[08:58] off and so fundamentally I would say the\n[09:01] focus of the the content the stuff that\n[09:02] I put out is how can I equip people with\n[09:04] the skills so that when they trade that\n[09:06] time they get more for it and then\n[09:08] continue to trade up and up and up for\n[09:09] the rest of their careers.\n[09:10] >> Yeah. I mean that is that's actually\n[09:12] such counterintuitive advice to what I\n[09:15] feel has been spreading on the internet\n[09:16] for the last two decades\n[09:19] >> of every conversations around passive\n[09:21] income. I feel like every one of my\n[09:23] friends is addicted to figuring out how\n[09:25] they can make passive income and those\n[09:27] are the same people that are not making\n[09:30] >> any more money than they already were.\n[09:32] But it's this addiction and obsession\n[09:34] with if I figure this out then I won't\n[09:38] have I can quit my day job and whatever\n[09:40] it may be.\n[09:41] >> Yeah. And I I've had influence so the my\n[09:43] neighbor is um is he owns uh Panda\n[09:46] Express and so last time I checked they\n[09:48] did $3.7 billion in revenue and they\n[09:52] have about a 27% net margin. So he took\n[09:54] home $935 million in personal income not\n[09:57] investment income. And so people see his\n[09:59] investment portfolio which is impressive\n[10:00] as you can imagine. has been doing it\n[10:01] for 45 years and so that starts to add\n[10:03] up, right?\n[10:04] >> But the thing is he can only take these\n[10:06] kind of bigger swings or bigger bets\n[10:07] because he has this very regular cash\n[10:10] that he spent 45 years building.\n[10:12] >> And I would say that what's interesting\n[10:14] is that you can build something very big\n[10:16] in about 5 to seven years. And the\n[10:18] problem is that I think most people\n[10:19] spend that same 5 to seven years\n[10:23] reliving the same 30 days over and over\n[10:25] again jumping from thing to thing to\n[10:27] thing and never actually getting the\n[10:29] root set so that they can pay down their\n[10:31] ignorance tax of not knowing enough.\n[10:34] Basically there's I would say there's\n[10:35] five stages that most newer\n[10:37] entrepreneurs or people who want to\n[10:38] pursue income go through. So the first\n[10:40] is um what I call uninformed optimism.\n[10:42] So your friend tells you about this\n[10:44] thing they made 10 grand on and you're\n[10:45] like that sounds amazing. you're\n[10:46] uninformed, but you're optimistic,\n[10:47] right? And so then you get into it and\n[10:49] then all of a sudden you get to uh\n[10:51] informed pessimism. So you get in and\n[10:53] then you put your money in and then it\n[10:54] drops and you're like, \"Wow, this\n[10:56] sucks.\" And then, you know, people are\n[10:57] like, \"Buy the dip.\" And so you're like,\n[10:58] \"Okay, I'm going to I'm going to put\n[11:00] more money in.\" And so then you get to\n[11:01] kind of stage three, which is the value\n[11:02] of despair, where you're like, \"Oh my\n[11:03] god, I've lost so much money. I have no\n[11:06] idea what's what's going on right now.\"\n[11:07] And at stage three, there's kind of a\n[11:09] fork. And so either people then go,\n[11:11] \"Well, my other friend told me about\n[11:12] this other thing.\" and they jump back to\n[11:14] step one and go to uninformed optimism\n[11:16] and then they just they funnel through\n[11:17] that loop over and over again. Now to\n[11:19] break through that that dip you have to\n[11:21] basically get to stage four which is um\n[11:24] informed optimism. So now you understand\n[11:27] the rules of the game, you understand\n[11:29] the variables at play and it's not as\n[11:31] good as you thought it was but you at\n[11:32] least get it. And so from there then you\n[11:35] can get to achievement which is the\n[11:36] fifth step. But the thing is is that you\n[11:38] have to stay in that third painful place\n[11:40] because staying in the pain is what\n[11:43] gives you the catalyst to learn how to\n[11:46] get out of pain. And so rather than\n[11:48] trying to pull your parachute, it's like\n[11:50] I have to trudge through this so that it\n[11:52] forces me to learn the individual\n[11:54] skills, the individual variables that\n[11:55] affect this outcome. And that means I\n[11:56] might have to take 20 more lashings to\n[11:58] finally get it. And then at that point,\n[12:01] it starts to tick up. And then that's\n[12:02] when you start to become more of an\n[12:04] expert, more of a master at something.\n[12:05] >> Yeah. And if you don't sit in that pain,\n[12:06] you're going to keep repeating that\n[12:07] cycle with something new. So it was\n[12:08] crypto, then it was NFTs, then it was\n[12:10] whatever else just keeps going round and\n[12:11] round and round. Is that system in this\n[12:13] new book?\n[12:14] >> So this is probably for one chunk above\n[12:16] that.\n[12:16] >> Okay. Got it. Got it. Got it. Got it.\n[12:18] No, cuz I was um I love the way you\n[12:21] break down the journey that we go\n[12:23] through in our mind and you do that with\n[12:25] multiple things because I think we don't\n[12:26] even see it.\n[12:27] >> Like that pattern you just explained is\n[12:30] a pattern you could live for three\n[12:31] decades. You've just saved people three\n[12:33] decades of pain by pointing it out and\n[12:35] saying, \"Well, this is what you're\n[12:36] doing.\" Yeah.\n[12:37] >> And here's how to shift that. And I\n[12:39] think people make the mistake where we\n[12:41] go, I don't have time to learn,\n[12:42] >> right?\n[12:43] >> So, I'm going to learn from someone who\n[12:44] makes me feel like I can learn it in an\n[12:46] hour.\n[12:47] >> Yeah.\n[12:47] >> And then I'm going to do it, which still\n[12:50] is uninformed optimism. So, how do we\n[12:53] learn? Where do we go? How do you build\n[12:57] that time to say, \"How many hours do I\n[12:59] need to even learn about this? I'm going\n[13:00] to put money in it.\" How would you\n[13:02] calculate that? If someone was like, I'm\n[13:03] going to put in a,000. I'm going to put\n[13:05] in a $10,000. How much time should they\n[13:07] put to value that amount of money?\n[13:10] >> So, great question. I would reframe the\n[13:12] premise, which would be we we'd still be\n[13:15] operating under this as I'm going to put\n[13:17] money into something. And so, I would\n[13:19] reject the original premise and say,\n[13:20] well, if you want to get really good at\n[13:22] something, then why don't we start with\n[13:23] skills that generate income? And so, if\n[13:26] we follow kind of the the three elements\n[13:28] of a business at its most basic form is\n[13:29] you have some element of promotion. So\n[13:31] we got to let people know about our\n[13:32] stuff. The second element is we got to\n[13:34] have a way to convert them. So we have\n[13:35] to be able to sell some sort of exchange\n[13:37] mechanism. And then finally, we have to\n[13:38] deliver, right? So track, convert,\n[13:40] deliver. Very easy. Um well, easy to\n[13:42] easy to say, hard to do, right? Within\n[13:44] each of those things, it's like, okay,\n[13:46] well, how do I let people know about my\n[13:47] stuff? Or even before that, what stuff\n[13:50] do I sell? Right? And so that's where I\n[13:52] like to think about it as people try to\n[13:54] think, man, there's so many people and\n[13:56] and try to boil the ocean. like it's\n[13:58] impossible to try and like try and think\n[14:00] what business could I possibly start\n[14:01] because you're trying to address the\n[14:03] world when it's much easier to say what\n[14:05] are the problems that exist in my life\n[14:07] and I kind of think of it as the three\n[14:08] Ps like most businesses come out of a\n[14:10] passion so something that you're just\n[14:12] inherently interested in they come out\n[14:13] of a profession so you currently\n[14:14] exchange right now you have a job\n[14:16] whatever it is and you get paid maybe\n[14:18] not as much as you want but you do get\n[14:20] paid uh for exchanging some sort of\n[14:22] value with the business and then the\n[14:24] third is P which is pain right so\n[14:26] there's some deep pain that sometimes\n[14:27] you went through. So maybe it's a mom\n[14:29] who had to figure out how to um create\n[14:31] non-allergenic food for their kids,\n[14:33] right? It's it would be something as\n[14:34] small as that. And so from that those\n[14:36] three kind of uh buckets is I think the\n[14:39] best starting point for most people who\n[14:41] want to start making an income. It's\n[14:42] like okay well if you're inherently\n[14:43] interested in this topic it's like can\n[14:45] we make can we let people know about\n[14:47] stuff around that topic? Can we create\n[14:48] solutions around that stuff? Can we\n[14:50] create services which is where I prefer\n[14:51] most people start which to be fair in\n[14:53] the United States 78% of businesses are\n[14:55] service based businesses. And I think\n[14:57] it's because they're the easiest to\n[14:58] start. You just trade time for money.\n[14:59] Very low risk,\n[15:01] >> right? You either get richer or you\n[15:02] don't. But like your your base your base\n[15:04] is zero. When you have a superior money\n[15:06] model, it gives you padding to be bad at\n[15:08] everything else\n[15:09] >> because you finally make more money per\n[15:11] customer than anyone else does in your\n[15:12] space, which means your advertising\n[15:13] doesn't have to be as good. You don't\n[15:14] have to be as good at sales. The offer\n[15:15] itself might not necessarily be as good.\n[15:17] But when you sequence these things\n[15:18] together properly the right way, then\n[15:20] you can unlock skill in the business.\n[15:21] People don't really give up on their\n[15:22] dreams. They see what it takes to get\n[15:25] their dreams and then decide it's too\n[15:26] expensive. I think that if we make who\n[15:29] we become the goal\n[15:33] rather than the thing we achieve instead\n[15:35] of winning once a decade we can win\n[15:37] every day. Do you want healthy greatl\n[15:39] looking skin without spending a ton of\n[15:41] time on it? If you answered yes, and\n[15:43] let's be honest, who wouldn't? Dove Men\n[15:45] Plus Care Body and Face Scrub is your\n[15:48] ultimate hack for effortless skin care.\n[15:50] When I say hack, I mean it. This scrub\n[15:52] does it all. Exfoliates, cleanses, and\n[15:55] moisturizes all in one simple step. No\n[15:58] extra steps, no hassle, just better\n[16:00] looking skin made easy. Plus, it's made\n[16:02] with natural essential oils. It's vegan\n[16:05] and free from parabens and sulfates,\n[16:08] designed specifically for men's skin, so\n[16:10] it does exactly what you need it to. The\n[16:12] best part, it's easy. Your skin will\n[16:14] look better, feel better, and it won't\n[16:16] take up more than a moment of your day.\n[16:18] Just hack your grooming routine and add\n[16:20] the Dove Men Plus Care Scrub into your\n[16:23] shower. Have you seen any metrics in\n[16:25] success rates between passion,\n[16:27] profession, and pain?\n[16:29] >> No, I haven't. I that would I really\n[16:31] want to know now.\n[16:33] >> Yeah. The reason why I ask it is because\n[16:36] >> I've been thinking about this for so\n[16:37] long and I want to go through each of\n[16:38] those because I think they're really I\n[16:40] think it's really sound advice.\n[16:42] I used to really believe that everyone\n[16:45] should try to do what they love\n[16:47] >> and love what they do.\n[16:48] >> Yeah.\n[16:49] >> And I've changed my mind about that.\n[16:51] >> And I used to believe it very strongly\n[16:55] probably like 10 years ago.\n[16:56] >> Mhm.\n[16:57] >> Only to then realize that that works\n[17:00] great for the 1 to 10%.\n[17:02] >> Yeah.\n[17:03] >> But for the majority of people that's\n[17:04] going to be really really hard.\n[17:05] >> Mhm. And recently I was giving the\n[17:08] Princeton commencement speech for their\n[17:10] graduation\n[17:11] >> and I was thinking about it a lot before\n[17:14] I gave that speech because I was like\n[17:15] wait a minute these are like\n[17:16] >> the most talented,\n[17:18] >> smartest people in the country who have\n[17:21] everything at their disposal. And I know\n[17:24] that even some of these people may not\n[17:25] get a job they love\n[17:27] >> or may never ever build something they\n[17:29] love. But guess what? Everyone needs\n[17:30] money to survive. Yeah.\n[17:32] >> So the question is and I want to hear\n[17:33] your take on it and I'll reflect back is\n[17:36] should you do what you love for money\n[17:38] and love what you do?\n[17:40] >> I think this is big myth number two. So\n[17:42] if we have we start with you know\n[17:43] passive versus active is big problem\n[17:45] number one. Um number two is follow your\n[17:47] passion. I think the reason that this is\n[17:49] so espoused I'll start where I think the\n[17:51] idea comes from and then kind of break\n[17:53] down from there. I think it's because\n[17:55] most of those commitment speeches are\n[17:57] billionaires or very successful people\n[17:59] and they say follow your passion. But if\n[18:00] we think through what other advice could\n[18:02] they give that would be socially\n[18:04] acceptable. They can't say you know I\n[18:06] got lucky. They can't say um I worked\n[18:09] you know super hard cuz people were like\n[18:11] sure you know like and so then it's like\n[18:13] okay well they're never going to get\n[18:14] attacked for saying follow your passion.\n[18:16] But the problem with that is it also\n[18:18] assumes that your passion or your\n[18:20] interest will never change.\n[18:21] >> And I mean anybody who's listening to\n[18:23] this just think about what you were\n[18:24] really interested in 10 years ago. It's\n[18:25] probably different than it is now. And\n[18:27] if you extrapolate that another 10\n[18:29] years, it'll probably be different\n[18:30] again. And so if we can think about the\n[18:33] hypothetical extreme of a really\n[18:34] successful person is someone who sticks\n[18:36] with the same thing for an extended\n[18:37] period of time, which is something that\n[18:38] I believe because you learn all the\n[18:40] lessons you possibly can in a very\n[18:41] narrow field, right? And that you\n[18:43] basically try and make as many mistakes\n[18:44] as you can. And if you basically, you\n[18:46] know, pay off all the all the ignorance\n[18:47] debt you can, it's like you end up just\n[18:49] succeeding by default if you just fail\n[18:50] every other way. But if you try and if\n[18:52] you try and do too many things, you\n[18:53] never actually get to to push the road\n[18:56] all the way, you know? trudge through\n[18:57] the mud and get there because you're\n[18:59] only learning one or two mistakes in\n[19:00] many fields and not many in one.\n[19:02] >> Yeah.\n[19:02] >> And so the follow your passion issue is\n[19:04] that yeah, number one, the the passions\n[19:07] will change. Number two is that\n[19:08] sometimes you're passionate about things\n[19:10] that people don't value. And the thing\n[19:11] is is there's nothing wrong with that.\n[19:13] It's just that it'll be very hard to\n[19:14] make an income that way.\n[19:15] >> The third thing is that I think that it\n[19:17] creates an emotionality around business\n[19:18] or income, which is that the moment it\n[19:21] doesn't feel good that you believe the\n[19:23] myth that you should stop.\n[19:25] >> When I think that Oh,\n[19:26] >> good. you if you and I were to talk\n[19:27] about you know the business side of\n[19:29] anything there are elements that I love\n[19:31] and there are elements that I hate and I\n[19:34] see them as both required you know I\n[19:37] would love to maximize one versus the\n[19:38] other but it's just the cost of doing\n[19:40] business literally but I try to reframe\n[19:43] that pain that comes from doing the\n[19:45] things that I don't want to do to do the\n[19:46] things that I do want to do as the price\n[19:48] tag required to become the person that I\n[19:50] want to become and so if we think about\n[19:53] the traits of any person so it's like if\n[19:55] I want to be patient, then I can't\n[19:57] expect things to happen faster, right?\n[19:59] Like, if we were to go to the end of our\n[20:00] lives and say, \"Hey, I want these\n[20:01] character traits.\" It's like, well, if\n[20:02] you had to play a character, you know,\n[20:04] in a video game and make them that way,\n[20:06] it's like, well, what would you have to\n[20:07] put them through in order to get those\n[20:08] traits? It's like, well, if you want\n[20:10] patience, then you're not going to get\n[20:11] things quickly. If you want to have\n[20:13] endurance, it's like you have to be able\n[20:14] to tolerate suffering, right? If you uh\n[20:16] if you want to be wise, it's like you're\n[20:18] going to have to get burnt and you're\n[20:19] going to have to learn the value of\n[20:20] judgment. And sometimes that means\n[20:21] you're going to get betrayed in order to\n[20:23] learn that pattern. And so it's like we\n[20:25] we lament the price tag for the things\n[20:28] that we want. And I think that at least\n[20:30] for me, my ultimate, you know, long-term\n[20:32] goal is just to become the person that I\n[20:34] the best version of me, right? And I\n[20:36] think that in order for that to happen,\n[20:37] I will have to go through pain. And so\n[20:40] the follow your passion, you know,\n[20:41] moniker also creates this emotionality\n[20:43] that gets you to quit when you really\n[20:45] are on the right path. And it's just\n[20:47] this is just part of it. And so I think\n[20:48] those are probably the big three um that\n[20:51] I think about when it comes to why\n[20:52] follow your passion doesn't serve most\n[20:54] people. And the other I'll say bonus\n[20:56] fourth might be that you might be really\n[20:59] good at something and people are very\n[21:00] willing to exchange money for that thing\n[21:02] and it doesn't mean that you actually\n[21:04] have to do the thing that you work on\n[21:06] that you make money on all the hours of\n[21:07] the day,\n[21:08] >> right? Like you can work for 20 or 30\n[21:12] hours a week and then have the other 120\n[21:14] to do whatever you want, 130 to do\n[21:15] whatever you want. Um, and that's I mean\n[21:18] not a bad not a bad thing in my opinion.\n[21:20] >> Yeah, I I'm that's that's the reason I\n[21:22] asked it. And I think even the advice\n[21:24] follow your passion doesn't mean focus\n[21:26] on your passion, right? Like there's\n[21:28] this confusion with like time. So even\n[21:30] when I think about it in my life\n[21:32] >> when I left the monastery and went to\n[21:34] work as a consultant because I needed to\n[21:35] pay the bills. Again, a very real\n[21:37] decision. Yeah. Because I was 25 years\n[21:40] old, living in my\n[21:41] >> loft room in my parents' house again\n[21:44] >> and that couldn't last very long.\n[21:46] >> When I went into that work, I was\n[21:49] teaching meditation by lunch. Like in my\n[21:52] lunch breaks, in the evenings, I would\n[21:54] teach meditation to my colleagues. There\n[21:55] was no demand for it. Two people would\n[21:57] show up.\n[21:58] >> 2013, this was meditation and\n[22:00] mindfulness were not this\n[22:02] >> global movement. And I was just enjoying\n[22:06] it because I was following my passion.\n[22:08] >> But I was making money by being a\n[22:11] consultant which was trading my time for\n[22:12] money.\n[22:13] >> As I followed that passion more, I got\n[22:15] more confidence in it. The market\n[22:17] changed. We're in a very different\n[22:19] landscape today 12 years on for there\n[22:22] being business opportunities in wellness\n[22:24] and health that didn't exist 12 years\n[22:26] ago. And so now following my passion for\n[22:29] all of that time meant there was a time\n[22:30] when I could focus on it. Mhm.\n[22:32] >> But let's say I had another passion that\n[22:35] wasn't monetizable, people weren't\n[22:36] interested in at all. I could follow it\n[22:38] for years and bring it into my work and\n[22:40] bring it into my life and it would be\n[22:41] beautiful and I'd be more fulfilled,\n[22:43] >> but it didn't need to be my thing,\n[22:45] right? And so I really really like that\n[22:48] advice and it's something that I I\n[22:50] almost want to propagate so hard right\n[22:52] now because\n[22:53] >> I I feel just responsible that for so\n[22:56] long we've been telling people to, you\n[22:58] know, just do what you love and chase\n[22:59] what you love. And it's like, yeah, in\n[23:00] your private time and personal time, you\n[23:02] should, but but don't think that that\n[23:04] has to be the thing you make money from,\n[23:06] especially if you have a really obscure\n[23:08] gift.\n[23:08] >> I 100% agree. I mean, I'm a utilitarian.\n[23:11] I I tend to be very I've probably edged\n[23:13] too much on pragmatic. Um, and maybe\n[23:16] that's just the im immigrant upbringing\n[23:18] of just like how are you going to pay\n[23:19] your bills? That's all anyone cared\n[23:21] about.\n[23:21] >> Well, the funny thing is I had that too.\n[23:23] My parents immigrants, too. But\n[23:24] >> I I think that there's a I think I got\n[23:27] really lucky to figure out what I loved\n[23:30] really early.\n[23:30] >> Yeah.\n[23:31] >> And I got really lucky that I got to get\n[23:33] really good at it really early.\n[23:34] >> I had this mentor really early on in my\n[23:36] career who said never do what you love\n[23:39] because then it becomes work.\n[23:41] >> And so just a completely counter take\n[23:43] and this guy was a guy who just had a\n[23:45] normal he had three or four stores that\n[23:47] he ran and he retired at age 28 and not\n[23:50] as a gazillionaire. I think he made\n[23:52] something in the neighborhood of\n[23:53] probably like 30 or $40,000 a month, uh,\n[23:55] you know, take home. And for 20 years,\n[23:57] he did nothing besides collect his money\n[24:00] once a month and then he played golf 5\n[24:01] days a week and he got to hang out and\n[24:03] wa and basically be there for the\n[24:05] entirety of his kids and he loved that.\n[24:07] And that was that he accomplished he he\n[24:09] used to tell me he's like, I slayed the\n[24:10] dragon of life. Um, and so what's\n[24:12] interesting is that now the that his\n[24:14] girls are out of the house, he now is\n[24:15] going back and he's back in like, well,\n[24:16] what am I going to do now? Right? I\n[24:18] wholeheartedly agree with the the the\n[24:20] not following your passion piece. the\n[24:21] the practical translation um might be or\n[24:24] at least my my my third myth that I\n[24:25] would probably tack on to this as we're\n[24:27] building these\n[24:28] >> is um overbelief in idea and underbelief\n[24:32] in execution.\n[24:33] >> Oh yeah, so true.\n[24:34] >> And so there's two elements to this. So\n[24:36] one is that I think many people who are\n[24:38] you know intimidated to start believe\n[24:39] that they have to start the next\n[24:40] Facebook and you know the Zuckerbergs\n[24:43] and the basis of the world are so\n[24:46] incredibly rare. The vast majority of\n[24:48] people who got into business have many\n[24:50] many failured and many many failures\n[24:51] many many failed businesses uh that that\n[24:54] led them to fail into success right and\n[24:58] so uh one is that the idea has to be\n[25:00] this big amazing thing and the second is\n[25:02] that you shouldn't that the idea itself\n[25:04] is is the success right because they'll\n[25:07] share with as many people as they can\n[25:08] and they almost scratch the itch of\n[25:10] starting when you haven't done anything\n[25:12] >> I say there's basically four steps to\n[25:13] starting a business it's like you have\n[25:15] to get an LLC you take the LLC to a bank\n[25:18] and then you get a bank account and then\n[25:20] you connect that bank account to a\n[25:21] payment processor and then you go ask a\n[25:24] stranger if you can do something in\n[25:25] exchange for money and if you do all\n[25:27] four of those things you have a business\n[25:29] that's it right and so a lot of people\n[25:31] like spend years being like I'm going to\n[25:34] start a business one day it's like you\n[25:35] can do it tomorrow literally do all of\n[25:37] this tomorrow\n[25:38] >> and then it's like okay well then how do\n[25:40] I get the person to exchange money it's\n[25:41] like well you reach out to the people\n[25:42] you know right you open your phone you\n[25:44] look at the 400 contacts you have there\n[25:46] you open up Facebook profile. You have\n[25:47] 300 friends. You you look at those\n[25:49] friends and then you just say, \"Hey,\"\n[25:51] you send a personal video, send a\n[25:52] personal text and say, \"Hey, I am\n[25:54] starting this thing. Um, this is what\n[25:56] we're doing. This is what I'm solving.\n[25:58] Uh, do you know anybody?\" That's it. And\n[26:00] so, it's not even like you're asking\n[26:01] your friends to buy something from you.\n[26:02] And what's interesting though is that\n[26:03] 90% of the time, the person who responds\n[26:05] is, \"Oh, you know, you could do that for\n[26:06] me if you want, but that just gives you\n[26:08] the easiest way that costs 0.\" And\n[26:10] because we're all connected with the\n[26:11] internet and phones, it's like the\n[26:12] barrier to entry has never been lower\n[26:14] than it is now. It's just the problem is\n[26:15] that um the barrier to distraction is\n[26:17] even lower.\n[26:18] >> What what stood out to me there is the\n[26:20] personal text, the video and the email\n[26:22] and then the fact that you're asking\n[26:24] your friends to introduce you to people\n[26:25] who may want it, not asking them\n[26:26] directly.\n[26:28] >> That first part, the amount of emails I\n[26:30] get and I'm sure you get as well of\n[26:32] people pitching their services to you,\n[26:34] but none of them are personalized.\n[26:35] >> Yeah.\n[26:36] >> Walk me through the difference of that\n[26:38] personal video, that personal because\n[26:40] it's it's it's life-changing like when\n[26:43] it's done right. So, I mean, these are\n[26:44] your friends or at least your contacts\n[26:46] that you've met at some point in your\n[26:47] life. And so, trying to recall when you\n[26:50] met that person, literally just stating\n[26:51] their name and asking that it's, hey,\n[26:53] I'm going to be doing this. And I would\n[26:55] say consistency is the currency of\n[26:57] credibility. So, what people don't want\n[26:59] to do is refer a friend to somebody\n[27:00] who's fly by night. But if you can\n[27:02] actually just demonstrate that, hey,\n[27:03] he's still doing that, the likelihood\n[27:05] that they're going to refer someone goes\n[27:06] way up because the relational capital is\n[27:08] not nearly at risk. Because if I'm going\n[27:09] to introduce somebody to somebody else,\n[27:11] I'm risking my social capital on the\n[27:13] hope that the third party or whoever is\n[27:15] sending this original text is actually\n[27:16] going to do a good job. And so you can\n[27:19] also include a little bit of risk\n[27:20] reversal in that which is like, hey, I'm\n[27:22] doing the first 10 for free and the\n[27:24] reason I'm doing it is because I just\n[27:25] want to get some testimonials, get some\n[27:27] reviews, and also just so that I can\n[27:28] learn, too. Um, and I think just being\n[27:30] really upfront and really being really\n[27:32] honest about it makes the stakes feel a\n[27:34] lot easier. And so then those first 10\n[27:36] people, you do exactly that. And the\n[27:37] thing is is that you're going to be\n[27:38] better off than they will. For those of\n[27:40] you who are like, I don't want to work\n[27:41] for free. It's like you're not working\n[27:42] for free. You're earning and then you're\n[27:43] sorry, you're learning and then you're\n[27:44] earning. And so we got to go through the\n[27:46] learn phase first. And the best way to\n[27:47] do it is people who aren't direct\n[27:49] connections of yours. Maybe one step\n[27:51] step removed. And then at that point,\n[27:53] they're going to give you very real\n[27:54] feedback. And if you do a good job, then\n[27:56] after a certain point, my goal is to get\n[27:59] people to basically shift supply demand\n[28:00] in their favor. Like I say the two the\n[28:02] two laws of business that I am the most\n[28:04] moved by are supply and demand which is\n[28:06] this X right here and then leverage. So\n[28:08] it's a fulcrum for leverage. And so I\n[28:10] see those are the two biggest forces in\n[28:11] business. And so I want to create\n[28:14] artificial demand for somebody who's\n[28:15] starting out by just saying we'll do a\n[28:16] lot of stuff for free. And then what\n[28:18] happens is when you have more no more\n[28:19] time to give and if people still want\n[28:22] you to do stuff and you say hey I can't\n[28:23] take any more people. If you want you\n[28:25] can pay and people like yeah that's\n[28:27] fine. And then boom and then you make\n[28:29] your first sale. And so, and you'll have\n[28:31] confidence because you're like, \"Well, I\n[28:33] just did it 20 other times.\" And look at\n[28:34] the results from those people. And but\n[28:36] and the first one, you'll be embarrassed\n[28:38] about the 19th one, you're like, \"Wow,\n[28:39] you're going to already pay down 60 70%\n[28:41] of all the mess ups that you were going\n[28:42] to do.\"\n[28:43] >> And then at that point, you're going to\n[28:45] start feeling good. And then from there,\n[28:46] my way of doing it is just you just keep\n[28:48] bumping the price by 20% every five\n[28:50] people until eventually people start\n[28:52] stop saying yes. And then up we're like,\n[28:54] \"Okay, this is the price I can do for\n[28:55] now.\" And that's basically a very\n[28:57] seamless transition into how do I go\n[28:59] from nothing to making my first dollar.\n[29:01] >> How do you get over the block of I don't\n[29:03] want to work for free?\n[29:04] >> I actually think it's entitlement. I\n[29:06] think it's believing that you deserve\n[29:08] something for nothing. Like to to flip\n[29:11] the flip the rules in reverse. Imagine\n[29:13] somebody comes to you, they've never\n[29:15] done anything ever in this particular\n[29:17] space and they say, \"Hey, will you pay\n[29:18] me to do this thing?\" Would you\n[29:21] immediately, now maybe some people would\n[29:23] be like, \"Sure.\" then it's a charity\n[29:24] thing which is different but would you\n[29:25] be like you know what I I really believe\n[29:27] that this guy is the best person that I\n[29:29] can get this problem solved from\n[29:30] probably not and so to carry some of\n[29:33] that risk for yourself you say I'm going\n[29:34] to front this but if you want to not do\n[29:37] it for free thing number one is that\n[29:39] you're getting educated so like you're\n[29:41] you're getting free education which I\n[29:43] see is absolutely valuable the second\n[29:45] thing is that you can make terms that\n[29:47] don't necessarily mean that it's free\n[29:48] like there's the price and then there's\n[29:50] the terms the terms of the agreement can\n[29:51] be if you do this with you have to give\n[29:54] me feedback uh throughout the entire\n[29:56] process and at the end if I do a good\n[29:57] job you leave a review right and on\n[29:59] three different formats and leave me a\n[30:01] video and leave me you know a text\n[30:02] version of it that's now absolutely like\n[30:05] I'll say it differently a business owner\n[30:07] they do illegally and and so therefore\n[30:09] they're very willing to pay people to\n[30:11] leave them testimonials and so if you\n[30:13] would be willing to pay $500 to get an\n[30:15] amazing testimonial then they're\n[30:16] basically you're they've paid you that\n[30:18] $500 but I promise you those first five\n[30:21] 10 reviews will make you so much more\n[30:24] than they could ever have paid you and\n[30:25] not given you a testimonial. So, if we\n[30:27] if we flip it and say, \"Hey, would you\n[30:29] rather get $1,000 from this person and\n[30:31] have them not leave a review versus free\n[30:33] and a glowing review?\" I promise you,\n[30:35] you will make so much more from one\n[30:37] glowing review than you will from the\n[30:38] $1,000 long term. So, you're just\n[30:40] building up the stockpile, the\n[30:41] foundation to then build whatever you\n[30:43] want to build on top of it.\n[30:44] >> Yeah, it's it's really strong advice.\n[30:45] It's I I hope everyone who's listening\n[30:48] and watching right now is like going\n[30:49] this is what I'm going to do right now\n[30:50] like 10 hours for free because\n[30:52] >> that's where we're blocking ourselves.\n[30:54] We don't have the experience\n[30:56] >> and therefore we don't feel comfortable\n[30:57] selling more because we don't even know\n[30:59] how the service will look.\n[31:01] >> Right? So you're trying to sell a\n[31:02] service and maybe you sold one but you\n[31:04] haven't been through the full life cycle\n[31:06] of what it feels like to deliver that\n[31:07] service.\n[31:08] >> Now you don't know how many website\n[31:10] revisions or edits there's going to be.\n[31:12] You don't know how many app updates\n[31:14] there going to be. you have no idea\n[31:16] >> and now you're actually less likely to\n[31:18] go sell another one because you're\n[31:19] scared that you don't even know if you\n[31:20] can do it. And I feel\n[31:21] >> under that entitlement is an insecurity\n[31:24] totally\n[31:24] >> of I don't actually even know how to do\n[31:26] this. Like I've got a lot of friends who\n[31:28] are like really talented, really\n[31:29] skilled, they they actually would do a\n[31:31] great job,\n[31:32] >> but because they've never just done 10\n[31:33] clients for free,\n[31:35] >> they don't know how it's going to be if\n[31:36] they went and got 100 clients tomorrow.\n[31:38] So they're scared of getting a 100\n[31:39] clients.\n[31:40] >> Yeah.\n[31:40] >> Not because they're not capable, but\n[31:42] because they haven't taken 10 clients\n[31:43] through the process.\n[31:45] >> So I want to give you something super\n[31:46] tactile for the audience.\n[31:47] >> Yeah, please.\n[31:48] >> Just 10 by 10. So give 10 people 10\n[31:51] hours. And so you can say, \"Hey, I'm\n[31:53] going to do 10 hours of work for free.\"\n[31:56] That is a really compelling offer. And\n[31:57] you're going to do it one-on-one and\n[31:59] ideally with them. And so if you want to\n[32:01] build the website, build it in front of\n[32:02] them for the 10 hours so they can give\n[32:04] you real-time feedback. If you want to\n[32:05] uh you know write email copy, you still\n[32:08] meet with them once a week or not\n[32:10] ideally multiple times a week during\n[32:11] that so you can pay down that the 10\n[32:12] hours faster. And if you're worried you\n[32:14] can do you can do five people for 5\n[32:15] hours that matters less but it's more\n[32:16] that one-on-one so the least scalable\n[32:19] thing possible and it's free labor that\n[32:21] they can track. The reason that's such a\n[32:23] compelling offer is that everyone even\n[32:24] at in in every country even minimum wage\n[32:27] has value. Anybody can understand that 5\n[32:30] hours of work is a material amount of\n[32:31] work that you're choosing to give away\n[32:33] for free. And so even if you have no\n[32:34] expertise, labor at base price is still\n[32:37] worth something. And so if you add on\n[32:38] expertise, it becomes a very compelling\n[32:40] offer. But the beauty of that setup of\n[32:42] having five or 10 hours that you choose\n[32:44] to spend is that there's basically if\n[32:46] you're doing it oneonone, there's almost\n[32:47] no technical, you know, component to it.\n[32:49] You don't have to like build all these\n[32:51] calendaring and and schedule. It's just\n[32:52] like you're just going to text those\n[32:53] five people, hey, you want to do same\n[32:54] time tomorrow. Very simple. And then for\n[32:56] each of those, you know, calls that\n[32:57] you'll take with them. Um by the in the\n[33:00] very first call, you just say, hey, I\n[33:01] want to be clear. What's the problem?\n[33:02] what do you want to you know what do you\n[33:03] want to solve and do you mind at the end\n[33:05] of the five hours we spend together if\n[33:07] this was good if I can tell you about\n[33:08] what I do if you just set that that that\n[33:11] preframe up front and then you do the\n[33:13] hours on the fifth call or the fifth\n[33:14] hour or the 10th hour you say hey\n[33:16] remember I said at the beginning I was\n[33:17] like has this been good so far it's like\n[33:18] awesome let me just recap what we've\n[33:20] done over what we've covered and the\n[33:21] progress we've made do you feel happy\n[33:23] about that great so this is what I think\n[33:25] it would look like cuz also you spent\n[33:26] those 5 or 10 hours getting as much\n[33:28] information or ammunition from them of\n[33:30] all the other problems that you could\n[33:31] potentially solve and then at that point\n[33:33] says, \"Hey, I think that I can solve\n[33:34] problem 1, 2, and three. It'll take me\n[33:36] maybe 6 months, but this is what kind of\n[33:38] an engagement would look like. How does\n[33:39] that sound to you?\" That's all you have\n[33:41] to do. And the thing is is that after\n[33:42] you give someone 5 or 10 hours, there's\n[33:44] so much reciprocity that's built up.\n[33:45] They're like, \"Well, shoot.\" I mean,\n[33:47] sure. Now, if somebody on the first call\n[33:48] says, \"No, I don't want to.\" Then it's\n[33:50] like, you don't you don't even need to\n[33:51] like continue. And so, one of the big\n[33:52] things that I I'm a big proponent of is\n[33:55] absolutely give stuff away for free to\n[33:57] people who are qualified.\n[33:58] >> Yes.\n[33:58] >> And so, you're like, I don't want a lot\n[34:00] of tire kickers. was like for sure\n[34:01] neither do I. But if I had a room of 100\n[34:04] of the most qualified people, which if\n[34:06] you're like what are a qualified person,\n[34:07] it's it's B. So uh IBM made this figured\n[34:10] this out like 70 years ago and it's\n[34:12] really never changed. So B is budget\n[34:14] authority need timing. Do they have the\n[34:15] money to spend the ability to make the\n[34:17] decision? They need the thing right now\n[34:19] and is now is is it now a priority? And\n[34:21] so if we had a room of a hundred people\n[34:23] who met all four of those criteria,\n[34:25] wouldn't you want to do something and\n[34:26] spend five or 10 hours for free? I mean,\n[34:28] my god, like if you had if you could\n[34:31] sign like the reason they sell time\n[34:32] shares over six hour blocks of time is\n[34:34] because it just takes time to build\n[34:36] trust for a higher ticket sale. So, if\n[34:38] anything, it's like you're choosing to\n[34:40] say that I'm going to give you 5 hours,\n[34:42] but they're giving you 5 hours to\n[34:44] influence them to ultimately prove that\n[34:45] you're good at whatever you do. And so,\n[34:46] I think that is the easiest way to get\n[34:48] started. You can make that your\n[34:49] front-end offer. You can put that in the\n[34:50] video. And I think the the beauty of\n[34:52] that specific offer is that you don't\n[34:54] need to even figure out what you're\n[34:55] going to sell because you'll figure it\n[34:56] out during the time you spend with them.\n[34:58] And so you can figure out the offer in\n[35:00] real time with them. And also because\n[35:01] you're doing it one-on-one, you can\n[35:03] basically you can you can permutate it.\n[35:04] You can you can tweak it every single\n[35:06] time you you you pitch it to somebody on\n[35:07] the fifth or eighth call or whatever.\n[35:09] That ultimately gets you so many faster\n[35:11] iterations that are low risk.\n[35:13] >> Yeah. You know, talking to you today and\n[35:14] Alex, I watch your stuff all the time.\n[35:16] The thing that's standing out to me is\n[35:18] you're super tactical. There's all these\n[35:20] methods, there's all these systems, but\n[35:22] then when you were talking about your\n[35:24] life, you were like, it's all about who\n[35:26] I want to become.\n[35:27] >> Is there a number that you stop at or is\n[35:31] it actually who you want to become\n[35:33] that's your northstar? I see\n[35:35] entrepreneurship as the single greatest\n[35:37] path for personal development because if\n[35:39] if we define you know learning as fast\n[35:42] feedback loops, there are very few other\n[35:44] you know professions that give you that\n[35:45] much feedback that brutally honest\n[35:48] brutally honest feedback as the market\n[35:49] will do. And so at every point where I\n[35:52] get stuck in a business, I think to\n[35:53] myself like what skill do I lack? And I\n[35:56] define everything by skills. So even\n[35:57] traits which is just you know a\n[35:58] colloquial term which is really just a\n[35:59] bucket of many skills. Um, I just think,\n[36:01] okay, well, in order for me to appear\n[36:03] confident or be confident, it's really\n[36:04] like 38 things that I have to learn. And\n[36:06] all of these things, if I break them\n[36:08] down easier, I can do them. So, it's\n[36:10] like, okay, when I shake hands, I make\n[36:12] sure that I web the the middle of my\n[36:14] hand and I squeeze firmly and I look at\n[36:15] the person in the eye. It's like, that's\n[36:17] thing one. Thing two is that when we're\n[36:19] talking, like, you nod because you've\n[36:20] been doing this for so long. But some\n[36:22] people who don't know how to have\n[36:23] conversations just stand like this. But\n[36:24] somebody who's an active listener will\n[36:26] nod. They'll say, \"Oh, that's a great\n[36:27] point, whatever.\" And so it's like\n[36:28] that's a second thing. When I walk into\n[36:30] a room, I'm going to call people by\n[36:31] name. It's a third thing. And so when I\n[36:33] when I try and think about these traits\n[36:34] of who I want to become, it's like can I\n[36:35] break these down into actions that I can\n[36:37] actually do. And so I think that is that\n[36:39] has been a large part of the the growth\n[36:40] that I've I've hopefully, you know, been\n[36:42] able to uh achieve. But in terms of the\n[36:44] ultimate goal for me, it's always just\n[36:46] been to be useful. Mhm.\n[36:48] >> And if I think I just do that, then I\n[36:50] like that it's such a simplified goal\n[36:52] because being useful has uh it actually\n[36:54] includes multiple parties because you\n[36:56] cannot be useful unless there's someone\n[36:57] else you're being useful to. And so it\n[36:59] gives you something controllable which\n[37:00] is that I have to learn skills so that I\n[37:02] can serve someone else and that is how I\n[37:04] can ultimately be useful. And so even\n[37:06] when we're, you know, we're making\n[37:07] content or whatever it is that we're\n[37:08] putting out, I I always try to think\n[37:09] like is this useful? Like can someone\n[37:11] actually will this change someone's\n[37:12] behavior? Like I want to educate. It's\n[37:14] like what is education? It just means\n[37:15] same condition, new behavior. So if\n[37:17] someone has had their same day over and\n[37:19] over again, then they're not learning.\n[37:21] So if your day looks the same every\n[37:22] single day, you have learned nothing.\n[37:24] And so that means that if you listen to\n[37:25] this podcast and then nothing changes my\n[37:27] behavior as a result, this was just\n[37:28] entertainment, not education. And so\n[37:31] that has been just it's a very sobering\n[37:33] point because you realize, oh, I have to\n[37:35] change my behavior in order to\n[37:36] demonstrate that I have learned. Now the\n[37:38] second component of this is like, okay,\n[37:40] well, what's intelligence then? So\n[37:41] intelligence as I define it is rate of\n[37:43] learning. So, how quickly do I change my\n[37:46] behavior in the same condition based on\n[37:49] some stimulus?\n[37:49] >> Mhm.\n[37:50] >> And so, if you you in a very real way,\n[37:52] you can influence your intelligence by\n[37:54] being willing to change faster. And so,\n[37:55] if you've heard 10 podcasts and then you\n[37:57] eventually change versus somebody who\n[37:58] listens to one and then changes, that\n[37:59] person is more intelligent than you are.\n[38:01] And so, I see that is actually really\n[38:03] encouraging because it means like, oh my\n[38:04] god, I have an active control on how\n[38:06] quickly I can learn simply by changing\n[38:08] my behavior. And so, that has been kind\n[38:10] of my my motus operandum for how I how I\n[38:12] how I live life. Yeah, I want to dive\n[38:14] into that. But as an aside, my No, no,\n[38:17] no. The reason why you you'll get it in\n[38:18] a second. As an aside, I've been really\n[38:21] embarrassed of my handshake lately. It's\n[38:22] because I've got a really bad case of\n[38:23] tennis elbow. I've been playing a lot of\n[38:25] pickle ball and so my elbow is\n[38:27] destroyed. And so every time I've been I\n[38:29] was on tour for the last month and every\n[38:31] time I've shook someone's hand in a meet\n[38:33] and greet, my hand was just like just\n[38:35] like literally and I felt so\n[38:37] embarrassed, but every time every time I\n[38:39] did a proper handshake, my elbow would\n[38:40] hurt. Anyway, um but so you just you\n[38:42] just brought back all that all all that\n[38:44] trauma. I really appreciate that mindset\n[38:47] because it's what you said earlier that\n[38:49] it actually sets you up for long-term\n[38:51] success even when things are not going\n[38:54] your way, when the results may not go\n[38:56] your way, when you're having to do the\n[38:57] things you hate. Like it's only when\n[38:59] that's your north star that you can do\n[39:01] all of that. Whereas if your northstar\n[39:03] is just a number\n[39:04] >> or just an exit or whatever it may be,\n[39:08] it's really really hard when you feel\n[39:10] like that exit is just further and\n[39:12] further away and that numbers further\n[39:14] and further away.\n[39:15] >> And I'm sure that you've met I mean so\n[39:16] many entrepreneurs that they have their\n[39:18] exit and everyone almost has invariably\n[39:20] the same story. I went to a beach, I\n[39:22] drank my ties for a month and then\n[39:24] realized that this wasn't for me. And\n[39:26] so, so one of the refrains that I have\n[39:28] in my head all the time is uh you are\n[39:29] the problem like me talking to me, but\n[39:31] like we are the problem. And so we have\n[39:34] this issue where we fundamentally just\n[39:36] always want what we what we can't have.\n[39:37] Single people want to get married,\n[39:38] married people want to be single. And so\n[39:40] it's more that we just want something\n[39:41] different almost all the time. And so\n[39:43] it's that that desire and you're you're\n[39:45] the monk here, so you know more about\n[39:46] this than I do. That's the issue. Like\n[39:48] that's the core problem. Um and so even\n[39:50] everyone right now who who doesn't have\n[39:51] a business is like, \"Man, I would like\n[39:53] to start a business someday.\" And then\n[39:54] all the people who started businesses\n[39:55] are like, \"My god, I can't wait to get\n[39:56] out of this thing.\" Right? And so it's\n[39:57] just there are pros and cons on both\n[40:00] sides. There are trade-offs. And I would\n[40:02] say that if there was a fourth myth that\n[40:03] we were we we would tackle. It's that\n[40:06] people want the benefits of multiple\n[40:08] paths without the trade-offs of each.\n[40:10] >> And so I think one of the reason so\n[40:12] there's lots of, you know, content of\n[40:13] like, you know, talk to 80-year-olds and\n[40:15] they'll tell you, you know, their\n[40:16] biggest life regrets. But what I find\n[40:17] really interesting is that typically\n[40:19] what they will do is they will assume\n[40:21] all the benefits of their current life\n[40:22] and say I also wish I had the benefits\n[40:25] of this other path.\n[40:26] >> Yes,\n[40:26] >> without the costs of that other path\n[40:28] that are unknown. And also they don't\n[40:31] they forget to subtract all the benefits\n[40:33] of their existing path. And so I like to\n[40:36] play it out. It's like okay well if I\n[40:37] were to do this other path and make that\n[40:39] trade um would I be would I be better\n[40:42] off? And most times it ends up just\n[40:44] being like I'd probably be about as\n[40:45] happy as I am now.\n[40:46] like it's like, \"Oh man, that the one\n[40:48] that got away, it's like you'd probably\n[40:49] be about just as happy as you are now.\n[40:51] As soon as you play it out a couple\n[40:52] years, it's like you probably be about\n[40:53] the same.\" And so that's actually\n[40:55] dramatically reduced my kind of regret\n[40:58] uh analysis from from a living\n[41:00] perspective. But I think the trade-off\n[41:01] part is so important because especially\n[41:03] when you're starting out or even when\n[41:04] you're more advanced in business,\n[41:05] there's a what I call the fallacy of the\n[41:07] perfect pick, which is that we\n[41:09] overanalyze things because we think that\n[41:10] we have to get it just right. Because we\n[41:12] think that if we pick just perfectly,\n[41:13] we'll find a way to get only benefits\n[41:15] and no costs. and it doesn't exist. And\n[41:17] so instead, people just stay stuck\n[41:19] thinking that there is some pick that\n[41:20] they're not seeing, but it's just not\n[41:21] true. And so I think the faster you're\n[41:23] willing to make the trade-offs and\n[41:25] actually spell them out like these are\n[41:26] the things I'm willing to trade because\n[41:27] I think a lot of people when they want\n[41:30] to like pursue any endeavor, they they\n[41:32] immediately think, and I think this is a\n[41:34] little bit more western, is that they\n[41:35] think about addition. They think about\n[41:36] how can how many more things can I do?\n[41:37] How many more things can I add to my\n[41:39] calendar? But most like right now, you\n[41:41] currently have a quote full calendar.\n[41:42] You live 24 hours a day and you do\n[41:44] stuff. And so I think it's more valuable\n[41:46] to think what am I willing to give up?\n[41:48] What am I willing to sacrifice? And\n[41:50] because we have to create space, we have\n[41:51] to create this vacuum so that we can put\n[41:53] this other thing in. And so those are\n[41:55] the trades. And I think in the beginning\n[41:57] the trades are sometimes uh you know,\n[41:59] more emotional. Uh because in the\n[42:00] beginning it's more, you know, my\n[42:02] friends will think this is weird. Uh\n[42:03] they don't want to get this text. What\n[42:05] if someone says, \"Oh yeah, you're\n[42:06] starting your business. I forgot.\" Or,\n[42:07] \"Oh, you're not not coming out with us.\n[42:08] Are you really doing that thing again?\"\n[42:09] Dude, it's not going to I mean, hey,\n[42:10] man, I love you, man. Like I I'm\n[42:12] supporting you, right? or your your\n[42:13] mom's like are you really going to\n[42:15] pursue podcasting as a thing?\n[42:17] Right.\n[42:18] >> I think like the the you know the first\n[42:20] rule of entrepreneurship is use what you\n[42:21] got.\n[42:22] >> Right. It's not waiting for some perfect\n[42:23] condition because um starting is the\n[42:26] perfect condition.\n[42:26] >> Yeah. That's where the profession part\n[42:28] comes in. Going back to where you are\n[42:30] like\n[42:30] >> going back to passion, profession pain\n[42:32] >> with profession that's use what you got\n[42:34] like you actually understand this\n[42:36] industry. Maybe you even worked really\n[42:37] hard to get a degree in it if you went\n[42:39] to college\n[42:40] >> or you've had work experience since you\n[42:41] were 16. But you kind of want to\n[42:43] disregard that because you think there's\n[42:45] the perfect pick over here and\n[42:48] potentially the passionate pick over\n[42:49] here. How do you turn that profession\n[42:52] into a service, a side hustle, a real\n[42:55] business? What does what does that look\n[42:56] like?\n[42:57] >> So what's what's really nice from the\n[42:58] prof the profession of the three is by\n[43:00] far the fastest angle for sure because\n[43:02] you already have the thing that's\n[43:04] valuable because you already do exchange\n[43:05] it for money. And so the only thing you\n[43:07] actually have to add at that point is\n[43:08] promotion and conversion. So you have to\n[43:10] say, how do I let people know about this\n[43:11] thing that I'm doing? And secondarily,\n[43:13] how do I get these people once they find\n[43:14] out to give me money? Right? And so from\n[43:17] a letting people know about it, I gave\n[43:18] one of eight ways of letting people\n[43:20] know. So there's warm outreach, so\n[43:21] that's letting people know one-on-one\n[43:22] about your stuff. There's cold outreach,\n[43:24] which is oneonone to strangers. You've\n[43:26] got uh paid ads, right, which you can\n[43:28] run um on any platform. Um or you've got\n[43:30] posting content. Those are the only four\n[43:32] things that one person can do. Now,\n[43:34] >> that's a great breakdown. There's only\n[43:36] four things cuz you start thinking\n[43:38] there's a million things I have to do.\n[43:39] >> You've got strangers and people you know\n[43:41] and you've got oneonone and one to many.\n[43:42] That's the four box. Now from those core\n[43:45] four you then unlock four others which\n[43:48] is that I can do oneonone uh outbound or\n[43:50] I can do or I can post constant or I can\n[43:52] run ads to get customers who then get me\n[43:55] more customers to get affiliates or\n[43:57] partners who get me more customers to\n[43:59] get employees who will then do these\n[44:00] things on my behalf to get me more\n[44:02] customers or to get agencies who will\n[44:04] then do it as v you know as a vendor on\n[44:06] my behalf. And so the first is the\n[44:08] everyone must start with the core four.\n[44:10] Even if you get, you know, a bunch of,\n[44:11] you know, partners who then promote on\n[44:13] your behalf, you still started with a\n[44:15] message that you sent to somebody,\n[44:16] right? And so the core four is the first\n[44:18] activity that you must do in order to\n[44:20] promote. These other things are higher\n[44:21] leverage. That makes sense. But this is\n[44:22] the core four that you start with. Once\n[44:25] you have someone who's responding to you\n[44:26] and say, \"Hey, I'm interested in your\n[44:27] stuff.\" Uh, which takes someone from a\n[44:29] contact to an engaged lead, right?\n[44:30] They've shown interest. Then we\n[44:32] basically have to take them from engaged\n[44:33] to ideally somebody who's going to buy,\n[44:36] right? And so that process um at the\n[44:38] most basic level is going to be a\n[44:39] conversation that leads to a conversion,\n[44:42] right? And so I have um a very simple\n[44:44] framework that I that I encourage people\n[44:46] who are starting out to follow which I\n[44:47] call closer. Um and so it's an acronym\n[44:50] so it's easy. So C stands for clarify\n[44:52] which you begin the conversation like\n[44:54] hey why' you respond to my thing right?\n[44:56] And the nice thing is that whenever you\n[44:57] promote you only are really going to\n[44:59] have a conversation with someone who\n[45:01] engages back right so you always have\n[45:02] the reason why right at the front. So\n[45:04] what made you what made you comment on\n[45:05] my post? What made you DM me after that?\n[45:07] What made you uh respond to my ad? What\n[45:09] made you u even respond to my my\n[45:11] original message or call? Right? So that\n[45:13] you have that reason. So what made you\n[45:14] do that? Clarify. Then you have L, which\n[45:16] is you label them with a problem. So\n[45:18] okay, so what I'm hearing is uh this is\n[45:20] problem. This is what you're trying to\n[45:21] solve. Does that sound about right?\n[45:22] Okay, cool. Then we go to O, which is\n[45:23] overview their past experiences. And so\n[45:25] here we're simply asking them more or\n[45:27] less the same four questions, which is\n[45:29] okay, what have you done so far? How did\n[45:31] that work for you? Uh what was good?\n[45:32] What was bad? And then we try and tie\n[45:34] that to our solution, the pieces that we\n[45:35] can solve. It's like, oh, I think you\n[45:37] might like this because we have this\n[45:38] other element. I'll get to that later,\n[45:39] but okay, this is great. What else have\n[45:40] you done? What else have you done? And\n[45:41] so that's kind of the pain cycle. And\n[45:43] the reason the pain cycle is important\n[45:44] is because in order to increase\n[45:46] motivation in the short term, we have to\n[45:48] basically expand the deprivation around\n[45:51] the thing that they want. And so we have\n[45:53] to we have to increase its priority in\n[45:55] the short term to get them to take\n[45:56] action. And that's why that that cycle\n[45:58] is so important. The fourth is S, which\n[46:00] is we sell the vacation. And so we want\n[46:02] to talk about the outcomes of what the\n[46:03] experience is going to be like once the\n[46:05] problem's solved. Uh rather than uh just\n[46:08] having some long-winded pitch. And\n[46:09] what's very interesting about the cell\n[46:10] portion is that most people talk way too\n[46:12] much. We try and get it to under 320\n[46:14] words. So it doesn't like people if you\n[46:17] can if you can very accurately describe\n[46:19] someone's existing condition to them and\n[46:21] say, \"So it sounds like you're\n[46:22] struggling with this and it sounds like\n[46:23] you're struggling with this and it\n[46:24] sounds like you're struggling with this\n[46:25] and if we solve this one, this is what\n[46:27] unlocks. We solve this one, this is what\n[46:28] locks and we solve this, this one locks.\n[46:29] Is that about right?\" They're like,\n[46:30] \"Yeah.\" It's like we can totally help\n[46:32] you. A lot of times you actually don't\n[46:34] need to sit if you nail the the pain\n[46:36] part. The pitch is very easy. And so I\n[46:38] am a big believer in having three points\n[46:40] in whatever pitch you have. So you can\n[46:41] always chunk it up, you know, like I\n[46:43] have our attract, convert, deliver. You\n[46:44] have okay, how do we get people to find\n[46:45] out? How do we convert them and how do\n[46:46] we give them the stuff? Right? Having\n[46:48] three elements of whatever it is. I\n[46:49] mean, I used to do sales scripts for,\n[46:51] you know, different companies back in\n[46:52] the day. So it's like I had a mortgage\n[46:53] lead company and they're like, \"Okay,\n[46:54] well the the leads are, you know,\n[46:56] timely. You want them to be qualified\n[46:57] and you want them to be exclusive.\"\n[46:58] Okay, great. If you're in fitness, it's\n[47:00] like you need you need a you need a\n[47:01] workout, you need to eat right, and you\n[47:02] need to have accountability. If you have\n[47:04] all three, then you can't fail, right?\n[47:05] And so there's always three. And then\n[47:06] with each of those three, I have kind of\n[47:08] in the back pocket a little anecdote\n[47:10] that to give an example of that. So that\n[47:12] way it makes it more real for the person\n[47:14] rather than explaining all the sets and\n[47:16] reps and all that stuff. No one cares.\n[47:17] That's why it's selling the vacation,\n[47:18] not the plane flight. Uh we're not going\n[47:20] to sell how we're going to get there.\n[47:20] We're going to sell where we're going to\n[47:21] go.\n[47:22] >> And so once we do S, then we go to E. So\n[47:24] at that point, we ask for the sale. If\n[47:25] they say no, then E and R come into come\n[47:27] into uh come into play. E is explaining\n[47:29] away their concerns. There's only five,\n[47:31] right? They're going to have a timing\n[47:32] issue. I've got a lot going on right\n[47:33] now. They have a money issue. I don't\n[47:35] think it's worth it. Uh they have a\n[47:37] decision maker problem, which is I don't\n[47:39] have the authority to make the decision.\n[47:40] I need someone else's permission. Uh\n[47:42] they're going to have a uh a stall\n[47:44] issue, which is let me think about it.\n[47:46] And then there's fifth is preferences.\n[47:48] So I don't like this particular thing\n[47:49] about your product or solution.\n[47:51] >> Um which is just saying that they want\n[47:52] your results a different way. And so\n[47:55] basically once you understand how to\n[47:56] overcome each of those five issues which\n[47:58] they are all actually just uh fallacies\n[48:00] in decision-m. So if it's timing issue\n[48:03] it's not really a time thing. It's a\n[48:04] priorities thing. If it's a money thing\n[48:06] it's not really a money thing. It's a\n[48:07] value thing. If it's a decisionmaker\n[48:08] thing it's really that they need support\n[48:10] not permission. And then we rely on past\n[48:11] agreements in order to say hey well your\n[48:13] husband knows that you're overweight\n[48:15] right? Do you think he wants you to stay\n[48:16] overweight? No. Then why would it be\n[48:17] against you doing something to change\n[48:18] that? Right? So, just walking through\n[48:20] those and I go through all of them, but\n[48:21] that's okay.\n[48:22] >> No, I love it. Yeah, this is a master\n[48:25] class, man.\n[48:27] >> Um, and then and then from a stalling\n[48:29] perspective, it's actually helping\n[48:30] someone make a decision because a lot of\n[48:32] people don't know how to decide because\n[48:33] you will have this conversation far more\n[48:35] than every person you talk to. People\n[48:36] maybe only have five 10 sales\n[48:38] conversations a year. If you are selling\n[48:40] in for a business, you'll have four or\n[48:42] five a day. And so, you should\n[48:43] absolutely always be more equipped than\n[48:45] they are to solve the problem. Um, the\n[48:47] one that I skipped was preferences,\n[48:48] which is, you know, I like uh, hey, I I\n[48:50] really want, you know, my my my friend\n[48:52] Charlotte, she lost 30 lbs doing your\n[48:54] thing, but can I just keep eating the\n[48:55] food that I'm currently eating? And so,\n[48:57] they want their results your way. And\n[48:59] so, the easiest way to explain around\n[49:00] that is if you change the variables,\n[49:01] change the outcome. Do you like the\n[49:02] outcome? Yeah. Well, then don't change\n[49:03] the variables.\n[49:04] >> And this is the only thing that I can\n[49:05] give you confidence in. And the question\n[49:06] is, is\n[49:08] >> you eating the food you want more\n[49:10] important than you looking the way you\n[49:11] want to look? And that's a real\n[49:12] question. And if the person says yes, it\n[49:13] is, then it's like, okay, well, then\n[49:15] nothing's going to change. if you don't\n[49:16] change.\n[49:16] >> Yeah.\n[49:17] >> And so then you get to have a real\n[49:18] conversation. But each of those those\n[49:19] are the fundamental kind of ways of\n[49:21] getting over them. And so once you\n[49:22] explain away the concerns you after each\n[49:24] explanation, you always ask again. So\n[49:27] does like does that does that help that?\n[49:28] Does that does that um does that solve\n[49:30] that for you? Great. So ready to move\n[49:33] forward, you ready to do whatever the\n[49:34] next thing is? And then finally is R.\n[49:36] And the R actually happens after the\n[49:37] sale and is something that I added years\n[49:39] later in my career. It used to just be\n[49:40] close. Um but the R um is reinforce the\n[49:44] decision. So in the 24 hours post\n[49:46] purchase is when the vast majority of\n[49:48] people either either have you know cold\n[49:49] feet or they regret or you can reinforce\n[49:51] it and becomes a a super positive right\n[49:53] and so people believe it or not there's\n[49:54] tons of research that supports this is\n[49:56] that they will make a decision about\n[49:58] your business based on the first 24\n[50:00] hours post purchase. So it's this huge\n[50:03] moment where you can make a first\n[50:04] impression that preframes the remainder\n[50:06] of the of the relationship that you have\n[50:08] with them. And so being incredibly\n[50:10] dialed of like hey so you bought let me\n[50:12] tell you what the next steps are going\n[50:13] to be. We're going to take these steps\n[50:14] and we're going to tie that to goal.\n[50:15] Right? So, you said you wanted these\n[50:17] three things. The way that we're going\n[50:18] to solve these three things is these\n[50:19] three steps. These are the actions you\n[50:20] take. We're going to meet tomorrow at\n[50:21] this time. I'll see you there. Or if you\n[50:23] have a, you know, onboarding rep, then\n[50:24] you'd go from there. But that\n[50:25] fundamentally is how you'd have the\n[50:27] conversion conversation. And so, to loop\n[50:28] back to if I'm a professional, how do I\n[50:31] do this? It's like, well, you're going\n[50:32] to use the core four. You're going to\n[50:33] reach out to people. Once they respond,\n[50:35] you'll initiate the conversation where\n[50:36] you go through the closer framework and\n[50:37] then you make them an offer to do your\n[50:40] stuff, which will be either moonlighting\n[50:41] or, you know, in the morning. And what's\n[50:42] really interesting is that people think\n[50:44] that their 9 to5 is getting in the way\n[50:46] of their dreams when it's really they're\n[50:47] 5 to 9. And so 5:00 a.m. to 9:00 a.m.\n[50:50] it's like you're it's four prime hours\n[50:52] and then 5:00 p.m. to 9:00 p.m. it's\n[50:54] another four prime hours. So it's like\n[50:56] you've got eight you've got a full\n[50:57] workday that you can work which I\n[50:59] strongly recommend. I think a lot of\n[51:00] people are big on the burn the boats\n[51:02] thing and I think there's a time and a\n[51:03] place for that. But if you have a family\n[51:05] and you've got a mortgage, I would\n[51:07] recommend you keep your job.\n[51:09] >> I agree. and then supplement your\n[51:10] income. And then at the point where your\n[51:12] supplemental income in your off time\n[51:15] surpasses your your full-time income,\n[51:17] that is when I say make the jump. And\n[51:19] for me, cuz I actually, believe it or\n[51:21] not, tend to be relatively riskaverse\n[51:22] person. I would say if you do that for 6\n[51:23] months because there's going to be\n[51:24] volatility\n[51:26] >> um in the business. And I'll also just\n[51:28] play out the next problem they're going\n[51:30] to have if that's all right.\n[51:31] >> Go for it.\n[51:31] >> So,\n[51:32] >> so much value, man. So much value.\n[51:34] >> So volatility is a symptom of\n[51:36] insufficient volume. And so if you feel\n[51:38] like you're like, man, how, you know, I\n[51:40] got a couple customers and then, you\n[51:42] know, the the leads stop coming in. It's\n[51:43] like, well, you're doing insufficient\n[51:45] volume. You're not doing enough of the\n[51:46] core four. We have to post more content.\n[51:48] We have to post more ads. We have to do\n[51:50] more reachouts, right? That's what we\n[51:51] have to do. And so, if you think, okay,\n[51:54] well, I've been doing these reachouts\n[51:55] and, you know, no one's responding or\n[51:56] things like that. One, we need to make\n[51:57] sure that the offer that we have is\n[51:58] good, which I think we started with the\n[51:59] 5 hour thing. I think it's a great first\n[52:01] offer. But, you know, under that\n[52:02] assumption, if we do this, I have a rule\n[52:04] of 100, which is that you do 100 uh per\n[52:07] day. So, that means you're doing either\n[52:08] a h 100red minutes that you're putting\n[52:10] into posting content and you post and\n[52:11] you post to be very clear and you post\n[52:15] uh you you spend $100 a day on ads uh or\n[52:18] you do 100 reachouts. And if you want to\n[52:19] be crazy, you can do all three. And so,\n[52:21] in those in those in those scenarios, uh\n[52:23] the key is that you have to keep going.\n[52:24] And so if you get, let's say you do the\n[52:26] rule of 100 and you get one sale a week,\n[52:29] okay, then if you want to, that would\n[52:31] give you four sales a month roughly. If\n[52:33] you're like, man, I want to go from four\n[52:35] sales a month to to 16 sales a month.\n[52:38] The nice thing is that you actually have\n[52:39] a clear input output equation, which is\n[52:41] that, okay, it costs me 700 primary, you\n[52:44] know, efforts to get one sale. And so\n[52:48] that volatility feels like it's only\n[52:50] one, but it's because you're not doing\n[52:51] enough. If I take that 700 and do 700\n[52:53] per day, then all of a sudden I'll be\n[52:56] making one sale a day. And\n[52:57] fundamentally, that little compression\n[52:59] process is the only thing that separates\n[53:01] very small businesses from very large\n[53:02] businesses. Most small business owners\n[53:04] have no idea how much more volume the\n[53:07] guys who are ahead of them put out. I\n[53:09] remember a conversation at the very\n[53:10] beginning of me deciding to make content\n[53:11] after I sold the company where I said,\n[53:13] \"Hey, you know, I I really want to learn\n[53:15] this Instagram game um and content\n[53:17] game.\" And so I talked to somebody who's\n[53:19] big big influencer and I said, you know,\n[53:22] can you can you analyze my stuff and\n[53:23] tell me what I'm doing wrong? And he\n[53:24] said, \"Dude, you're not doing anything\n[53:27] wrong. You're just doing too little.\"\n[53:29] And so he said he said, \"Pull up your\n[53:31] Instagram.\" And I pulled it up. Uh and I\n[53:33] think I was doing like a post every\n[53:34] other day or something like that. And\n[53:35] he's like, \"Dude, I got four posts a\n[53:37] day.\" And I was like, \"Whoa.\" And then\n[53:38] he said, \"Pull up your LinkedIn.\" And I\n[53:40] I don't think I posted on LinkedIn. He's\n[53:41] like, \"I got 10 posts a day.\" And he's\n[53:42] like, \"Pull up your pull up your\n[53:44] Twitter.\" At the time, now X is like I\n[53:46] had nothing. Right. And so he he went\n[53:47] side by side. He's like, I'm putting out\n[53:49] 70 80 a day and you're putting out one\n[53:50] every other and you're complaining. And\n[53:52] I was like, got it.\n[53:53] >> And so the most people dramatically\n[53:56] underestimate the amount of volume that\n[53:57] is required. And that volume has a great\n[53:59] feedback loop for skill because you do\n[54:01] these iterations and you will suck\n[54:04] >> and that is okay. And as long as you\n[54:06] like the process that I have for\n[54:07] improving any part of any system is just\n[54:10] do a tremendous amount of volume. Let's\n[54:12] say we do a 100 whatevers. We look at\n[54:14] the top 10 percent of of the ones that\n[54:15] got the highest response rate or the\n[54:16] ones that got the most views or the ads\n[54:17] that got the most clicks. We say, \"Okay,\n[54:19] what was different about these top 10\n[54:20] percent compared to the other 90?\" And\n[54:22] so the next hundred we do, we say,\n[54:23] \"Let's just try and just do the thing we\n[54:25] did in the top 10%. We do it again.\" And\n[54:27] that continual refinement process has\n[54:29] been the key to all the stuff that we've\n[54:30] done. It's just look at what worked, do\n[54:32] more of that. And so if you were in the\n[54:34] professional bucket, that is more or\n[54:36] less kind of the approach that I would\n[54:37] take to get that first dollar.\n[54:38] >> Everyone needs to listen to that 15\n[54:40] minutes every day. I'm not kidding. That\n[54:42] was the most amount of value I think has\n[54:44] ever been packed in a 15 minutes that\n[54:47] I've ever heard in my entire life. And\n[54:48] I'm not kidding. That is such brilliant,\n[54:51] brilliant advice. Totally broken down\n[54:54] step by step. I mean, you could I mean,\n[54:56] you can make like 70 posts off of just\n[54:58] the last 15 minutes. It was so No. And\n[55:00] and I mean that. I'm not just saying\n[55:01] that because right now as you're\n[55:03] speaking, I've got so many friends that\n[55:05] I've got in my head that are exactly at\n[55:07] that point. And it's either the volume\n[55:09] that's messing them up. It's either not\n[55:11] having the plan to how do you pitch and\n[55:13] convert? Two questions. The first is how\n[55:17] do you stop being scared of sucking?\n[55:21] >> Because a lot of my friends are scared\n[55:22] of sucking.\n[55:23] >> Mhm.\n[55:24] >> And the second one is why are we so\n[55:28] uncomfortable selling\n[55:30] >> and promoting and showing our work?\n[55:32] >> So the first one, what's really\n[55:34] interesting about the question is that I\n[55:35] think that most people are actually very\n[55:37] okay with sucking. I think they're very\n[55:39] not okay with being judged for sucking.\n[55:41] And so I think that at the at the onset\n[55:44] we have to redefine success as trying\n[55:47] and not as succeeding uh or at least\n[55:50] getting whatever desired outcome there\n[55:51] is because failure and success are are\n[55:54] salt and pepper. They're married.\n[55:55] They're the one one leads to the next.\n[55:57] And so the idea is we want to get as\n[55:59] many failures out of the way as fast as\n[56:01] possible. And so it's like we want to\n[56:02] pay down that failure debt as again as\n[56:04] soon as we can. And so the the very\n[56:06] tactical thing that I would advise is\n[56:10] think about there's we think I don't I\n[56:12] don't want people to think that I'm a\n[56:13] failure. It's actually not people.\n[56:15] There's like two people that you hear\n[56:17] their voice in your head. And so when\n[56:19] you actually get really clear on who\n[56:20] whose voice is that because I'll tell\n[56:22] I'll tell you a real world example. So\n[56:23] for me\n[56:24] >> when I this is sounds ridiculous but\n[56:26] just but just to show you hopefully how\n[56:27] ridiculous whatever you think sounds\n[56:28] I'll share one of mine. So, when I was\n[56:32] uh thinking about selling my company,\n[56:33] the the offer was for for 46.2 million.\n[56:36] And I I was afraid that it wasn't enough\n[56:40] to impress the people that I wanted to\n[56:42] impress. And so, and I had to figure\n[56:44] that out. I was like, I don't know. I\n[56:46] mean, is it worth it? Maybe I should\n[56:47] hold on to it longer and grow more. And\n[56:49] I want, you know, back and forth. And\n[56:50] when I thought more more about it, I was\n[56:52] like, actually, there's only one person\n[56:54] whose opinion I'm concerned about. And\n[56:57] then when I named it, when I was like,\n[56:59] \"Oh, it's Tom. Tom's the per and like\n[57:02] I'm not even that close with Tom, but\n[57:04] Tom, my envisionment of Tom judging my\n[57:08] my my my exit as not good enough for\n[57:10] their approval.\" I was like, \"Wait, I'm\n[57:13] letting Tom have this much influence\n[57:15] over my life. That's absurd.\" And so,\n[57:18] one of the big um reframes that I have\n[57:20] in my head is that if you don't know why\n[57:21] you believe what you believe, it's not\n[57:23] your belief, it's someone else's. And so\n[57:24] if you can't explain like why am I not\n[57:26] doing this? If you can't actually\n[57:27] explain it, it's because there's someone\n[57:28] else's voice that is influencing you\n[57:30] that you're not aware of. And so I try\n[57:31] and Yeah. Ex the naming is the key part\n[57:33] because as soon as you see that, you're\n[57:35] like Tom. You're like screw Tom. You're\n[57:37] like I want to It's like is is Tom's\n[57:39] approval worth more than the dream that\n[57:42] you want to pursue. And as soon as you\n[57:44] get that, you're like, well, hell no.\n[57:46] And then you move forward. And I can\n[57:48] tell you just from from the other side\n[57:49] of this, and I want to I want to be\n[57:50] really clear. I understand how scary it\n[57:52] is. It took me 6 months to quit my job.\n[57:54] And I I talked to my friend every single\n[57:55] day saying, \"This is the day. This is\n[57:56] the day. This is the day.\" And when I\n[57:58] did finally quit my job, I drove across\n[58:00] the country. And I only called people\n[58:03] from home when I was already halfway\n[58:05] across. I didn't tell anyone I was\n[58:06] leaving because I was so afraid of what\n[58:08] they would say. So I say this as\n[58:10] somebody who absolutely gets it. But I\n[58:12] just want to tell you from the other\n[58:13] side of it, it's, you know, this is a\n[58:16] Leila quote, not me, but you know, fear\n[58:18] is a mile wide and an inch deep. And so\n[58:20] it looks like this vast ocean of of like\n[58:22] I'm going to drown. But as soon as you\n[58:23] take the first step, you're like, \"Oh,\n[58:25] this is a puddle.\"\n[58:26] >> And there's a quote from Jo Willick that\n[58:28] I love that's recent. It's been top of\n[58:29] mind for me, which is besides death, all\n[58:33] failure is psychological.\n[58:35] >> It's just when you the longer you think\n[58:37] about it, the more you're like, wait,\n[58:39] >> all failure is just me drawing an\n[58:41] arbitrary line in the sand that I say\n[58:43] anything that does not meet the standard\n[58:44] will force me to be upset. Yeah. Yeah.\n[58:46] Yeah.\n[58:47] >> And so it's like, okay, well, if I don't\n[58:49] die, then I can keep going. And if I\n[58:50] don't die, then it means I can stand it.\n[58:53] >> Yeah. And and I think a big part of it\n[58:54] when I'm listening to you is because\n[58:56] it's psychological.\n[58:58] >> Let me know that it will happen. Yeah.\n[59:00] >> So I remember when I put out my first\n[59:01] video, which I didn't tell anyone I was\n[59:03] going to do. I spent two years watching\n[59:07] videos before I made one and put one\n[59:09] out.\n[59:09] >> And when I put out my first video, I\n[59:11] remember my friend saying to me, \"You\n[59:13] talk too fast. the music is too loud.\n[59:16] It's edited badly. Cool. Like it wasn't\n[59:19] received with praise.\n[59:21] >> Now, I didn't think about that too much.\n[59:24] >> And now, if I go back to advise someone,\n[59:26] I'd say, anticipate that.\n[59:27] >> Yeah.\n[59:28] >> Because if you anticipate it, then it's\n[59:31] okay. Then it's uh inch deep.\n[59:33] >> Yeah.\n[59:33] >> Right. You're like, \"Oh, okay. Well,\n[59:34] yeah, they're probably going to tell me\n[59:36] that the editing wasn't great or\n[59:37] whatever.\" Yeah,\n[59:38] >> but if\n[59:40] I have it,\n[59:42] you know, not people who actually\n[59:47] avoid some of them, but guess what? I\n[59:49] won't avoid all of them. There will\n[59:50] still be someone who criticizes the\n[59:52] tone, what I'm wearing, how I look,\n[59:54] whatever it is. And as soon as you know\n[59:56] that,\n[59:56] >> you go, \"Oh, that's all it is.\"\n[59:59] Someone's going to look at and be like,\n[01:00:00] \"Yeah, I'm not sure.\" And it's like,\n[01:00:02] \"Oh, wait. Their reaction doesn't change\n[01:00:04] my reality.\" Yeah,\n[01:00:05] >> like their reaction will always be\n[01:00:07] there. And I think what we're trying to\n[01:00:08] do, going to your earlier point as well,\n[01:00:10] is we're trying to avoid the reaction.\n[01:00:12] We want to create something\n[01:00:14] >> that has no negative reaction.\n[01:00:17] >> And there is not a single person on\n[01:00:19] planet earth that has created a song, a\n[01:00:21] movie, uh podcast or whatever it may be\n[01:00:24] that has had no negative reaction. So\n[01:00:26] >> I have so so many quick thoughts on\n[01:00:28] this. So number one is that if you do\n[01:00:30] nothing, people will criticize you. If\n[01:00:32] you do something, people will criticize\n[01:00:33] you. So criticism is a fixed cost.\n[01:00:35] Period. Number two, it takes about 20\n[01:00:39] hours to become proficient in just about\n[01:00:41] anything. You want to play guitar like\n[01:00:43] proficient in just about anything. It\n[01:00:45] just takes people 10 years to get the\n[01:00:47] first 20 hours. And that's a huge a huge\n[01:00:50] issue. The third is that when you're\n[01:00:52] thinking about feedback is one, not all\n[01:00:55] feedback is created equal. You don't\n[01:00:57] want to listen to the people who are\n[01:00:58] closest to you. You want to listen to\n[01:00:59] the people who are closest to your\n[01:01:00] goals. M\n[01:01:01] >> and so listen to the people who are\n[01:01:03] already at your goals who already have\n[01:01:04] achieved those goals and listen to their\n[01:01:06] feedback because I'll say for example\n[01:01:08] for me like if I if I I mean I rarely do\n[01:01:10] but if I post anything of me at the gym\n[01:01:12] the only people who comment are people\n[01:01:13] who are smaller than me. No guy who is\n[01:01:16] bigger than me ever has talked [ __ ]\n[01:01:18] about you know about my you know my\n[01:01:20] fitness stuff. Um and so to the same\n[01:01:22] degree anybody who's an entrep who's a\n[01:01:23] real entrepreneur is going to be like\n[01:01:24] hell yeah man you got out there. Oh of\n[01:01:26] course you failed. I mean obviously you\n[01:01:27] failed but that's okay right? everyone\n[01:01:29] falls the first time right from uh from\n[01:01:31] the matrix. And so expect failure and I\n[01:01:34] think that if you can play it out the\n[01:01:35] there's a there's a really wonderful\n[01:01:37] framework around this which is the the\n[01:01:38] frame of the veteran which is if you\n[01:01:41] were to imagine whatever bad experience\n[01:01:42] occurs happening a thousand times more\n[01:01:44] in a row how would you feel on the\n[01:01:46] thousandth time? And if that's how\n[01:01:49] you're going to feel in the thousandth\n[01:01:50] time with the exact same condition, you\n[01:01:52] might as well feel that way today. And\n[01:01:54] it's just been a really like a like if\n[01:01:55] you're like man I hate traffic. It's a\n[01:01:56] Google. Let's assume traffic is a\n[01:01:58] constant and it happens for the next\n[01:01:59] thousand days. You'll probably be like,\n[01:02:00] \"Well, it's just how it is.\" Totally,\n[01:02:01] >> right? And so, this is just how it is.\n[01:02:03] That's the feedback that you're going to\n[01:02:04] get from the videos and it's going to\n[01:02:05] keep happening and it's okay.\n[01:02:06] >> Yeah. Your your point just now of the\n[01:02:09] problem is it takes us 10 years to get\n[01:02:11] the first 20 hours\n[01:02:12] >> is so true. I know something that I've\n[01:02:15] >> because people are often like that to me\n[01:02:16] like Jay, how do you solve a problem?\n[01:02:18] I'm like, if I think something's a big\n[01:02:19] problem to solve or a skill to learn, I\n[01:02:22] will cancel every evening plan this week\n[01:02:24] and I will cancel my entire weekend. And\n[01:02:27] all I'm doing this weekend is figuring\n[01:02:29] out that skill. I'll get a coach. I'll\n[01:02:32] commit to the time and I'll be around\n[01:02:34] that community of people. Those are my\n[01:02:35] three practices or things to develop a\n[01:02:38] skill. And then this weekend is\n[01:02:40] dedicated to getting good at X. And it's\n[01:02:43] like if I don't get enough hours in this\n[01:02:46] weekend, the next four weekends are\n[01:02:48] dedicated to that thing. And all of a\n[01:02:50] sudden in a month, I've solved a problem\n[01:02:52] that could have taken me six years. And\n[01:02:54] so I love that piece of advice because I\n[01:02:55] think it's it's the same advice when you\n[01:02:57] give people like, \"Hey, just try three\n[01:02:59] things out.\" And they're like, \"Okay,\n[01:03:00] I'll try three things out, one a year.\"\n[01:03:02] >> And and also when you give it 12 months\n[01:03:05] to try one thing out, you actually never\n[01:03:07] know. Whereas if you did something for a\n[01:03:09] whole day,\n[01:03:10] >> like I remember when me and my wife were\n[01:03:11] in Hawaii and we both grew up in London.\n[01:03:14] >> We never went surfing or skiing and\n[01:03:17] things like this, right? We're in\n[01:03:18] Hawaii. We try surfing. We do it the\n[01:03:20] whole day. I knew I was never going to\n[01:03:22] be a surfer and it's the last thing I\n[01:03:24] want to do and I don't care at all about\n[01:03:26] surfing. It It looks good, but it is not\n[01:03:29] fun to do. Like I didn't enjoy the\n[01:03:30] process. And I'm like, but if I went\n[01:03:32] like for 30 minutes one day, then I'd be\n[01:03:35] like, \"Oh, well maybe I just didn't do\n[01:03:36] it right.\" And then you're like, \"Okay,\n[01:03:38] I'll go 30 minutes next year. I'll do an\n[01:03:39] hour next year.\" And so we just keep\n[01:03:41] elongating the kind of failure rate or\n[01:03:44] knowing how quickly something's\n[01:03:46] important or not.\n[01:03:47] >> I think it's getting completely immersed\n[01:03:50] and just soaked in whatever the thing\n[01:03:52] that you're trying to pursue. So I'll\n[01:03:54] tell you a comparable story. So when I\n[01:03:56] was when I had my first business, I I\n[01:03:59] was I've never been a tech oriented\n[01:04:00] person. Now I try not to speak that over\n[01:04:02] myself, but like I'm working on it. And\n[01:04:04] so I was like, I have to learn how to\n[01:04:06] build web pages. I hate relying on these\n[01:04:07] IT guys. They're slow. They don't build\n[01:04:09] it the right way. And so this is right\n[01:04:10] as some of the early kind of softwares\n[01:04:12] come out. And I had put it off. And then\n[01:04:15] I finally said, \"Both days this weekend,\n[01:04:17] I'm locking the doors. I'm closing the\n[01:04:19] the frames. I'm turning off my phone.\"\n[01:04:21] And I just had a simple page. I said,\n[01:04:22] \"I'm just going to copy this page. I\n[01:04:23] just want to see if I can figure it\n[01:04:24] out.\" And I set two full days aside and\n[01:04:27] I finished it by noon.\n[01:04:28] >> Yeah.\n[01:04:28] >> But I had put it off for weeks. And so\n[01:04:32] most times it's almost like fear is a\n[01:04:33] mile wide and an inch deep. So is\n[01:04:35] ignorance. It's like it's more than you\n[01:04:37] expect but less than you think. Yeah.\n[01:04:38] Right. You get in and you're like, \"Oh,\n[01:04:40] there's only four parts to this.\" Okay.\n[01:04:41] I think okay, now I You want to wrap\n[01:04:43] your arms around it. And I think that's\n[01:04:44] why having these kind of longer intense\n[01:04:46] sessions where you kind of drink all of\n[01:04:47] it up because if you did multiple 30\n[01:04:49] minute sessions, for example, it's like\n[01:04:50] it'll take you the first 15 minutes to\n[01:04:52] get back into what did I just learn last\n[01:04:54] time? And then it just it takes very\n[01:04:56] it's very hard to get make progress. And\n[01:04:57] so I'm a I'm a massive advocate of full\n[01:05:00] shutdown days. I mean, drink your\n[01:05:02] coffee, get your good night's sleep, and\n[01:05:03] then put your earplugs in and then like\n[01:05:05] lock in.\n[01:05:06] >> Yeah. Absolutely. Absolutely. And then\n[01:05:07] the second question was why are we so\n[01:05:10] uncomfortable with selling, promoting\n[01:05:13] ourselves, putting ourselves out there?\n[01:05:15] >> So I would put that as two two separate\n[01:05:17] buckets. So one is the promotion, which\n[01:05:19] is kind of public embarrassment, public\n[01:05:20] harass, you know, that kind of Yeah. The\n[01:05:23] second one is um why am I scared to ask\n[01:05:26] this person for money? Right? And so I\n[01:05:28] think on some level it comes down to\n[01:05:30] some people feel like imposters. They're\n[01:05:31] like I you know I don't deserve this and\n[01:05:33] things like that. But I think that\n[01:05:35] there's a there's a very tactical way to\n[01:05:37] overcome that which is you outwork your\n[01:05:39] self-doubt. And so if you um if you've\n[01:05:43] done those 20 and I think it's the\n[01:05:45] people who haven't done the 20 who feel\n[01:05:47] like imposters, but if you've done it 20\n[01:05:48] times and you're like, I know what's\n[01:05:50] going to happen next and I know what\n[01:05:51] your problem is and I also know I can\n[01:05:53] solve it. And so your conviction goes up\n[01:05:55] because you're not you're not\n[01:05:56] exaggerating anything. You're not\n[01:05:57] puffing your chest. You're just one of\n[01:05:59] my big rules in persuasion is state the\n[01:06:01] facts and tell the truth. And so you're\n[01:06:02] like, listen, I've done 20 of these. You\n[01:06:04] have the same issues as these people.\n[01:06:06] This is what I did for them. I think I\n[01:06:07] can do the same thing for you. We're not\n[01:06:09] exaggerating. We're not claiming\n[01:06:10] anything. We're just saying like this is\n[01:06:11] this is what's happened. And so I think\n[01:06:13] that that will dramatically decrease the\n[01:06:15] anxiety around the conversation. The\n[01:06:17] second piece is the fear of like\n[01:06:18] rejection in the micro. And so um it's\n[01:06:22] it's always overstated because the worst\n[01:06:24] thing they can say is no. And then you\n[01:06:26] say, \"Okay, fine. No worries.\" Like not\n[01:06:29] a big deal. I'll just ask somebody else,\n[01:06:30] right? Like if anything, sales is like\n[01:06:33] dating. It's a numbers game. Like you\n[01:06:34] have to be willing to say I would and\n[01:06:36] this is why I like rule of 100 a lot is\n[01:06:38] have a hundred conversations and I\n[01:06:40] promise you your anxiety will go down\n[01:06:42] because you'll just habituate. And so\n[01:06:44] everyone like and this is the\n[01:06:45] psychological way of actually curing\n[01:06:46] phobias. If you're afraid of spiders,\n[01:06:48] the fastest way to cure spiders is lock\n[01:06:50] you in a room with spiders. You'll have\n[01:06:51] a couple panic attacks. You'll you'll\n[01:06:53] you'll pass out. You'll wake back up.\n[01:06:54] The spiders are still there. You wait\n[01:06:55] pass out. Wake back up and eventually\n[01:06:56] you're just like, \"All right, I'm used\n[01:06:58] to it.\" Yeah.\n[01:07:06] >> It's because they've done this before.\n[01:07:07] And so we just have to get you to the\n[01:07:08] we've done this before part as fast as\n[01:07:10] we can.\n[01:07:10] >> Yeah. What about people who feel like\n[01:07:13] the approaches are manipulative, okay?\n[01:07:15] >> Or these tactics are like you're preying\n[01:07:18] on someone's vulnerabilities and\n[01:07:20] insecurities and of course that person\n[01:07:22] wants to lose weight for their partner\n[01:07:24] and you're playing to that. Like what\n[01:07:26] about someone who feels that way and\n[01:07:27] that's what gets in their head like oh I\n[01:07:29] know I have a valuable service. I know I\n[01:07:31] want to help people but actually like\n[01:07:33] they should want to do it themselves.\n[01:07:35] I'm not going to convince them.\n[01:07:36] >> So I'm going to I'll define two things.\n[01:07:38] So one I see the process of selling as\n[01:07:40] arranging the variables to increase the\n[01:07:41] likelihood a sale occurs. That is a\n[01:07:43] selling process. And so we want to use\n[01:07:45] all the variables we can because if we\n[01:07:46] can control the variables we control the\n[01:07:47] outcome. And so I see then underneath of\n[01:07:50] that the difference between help and\n[01:07:51] manipulation is intention. And so you\n[01:07:53] use the exact same uh variables to\n[01:07:56] influence someone's purchasing decision.\n[01:07:58] But if your intention is to scam them\n[01:08:00] out of money and not help them, then for\n[01:08:01] sure you should I hope you feel all the\n[01:08:03] feelings that you have right now. But on\n[01:08:04] the flip side, if you're if you know\n[01:08:05] that you're going to do your absolute\n[01:08:07] best and and you've not misrepresented\n[01:08:09] something. And I think this is the key\n[01:08:10] part where people feel the imposter\n[01:08:11] syndrome is because they misrepresent.\n[01:08:13] If you state the facts and tell the\n[01:08:14] truth, most of your anxiety goes away.\n[01:08:16] And I have this conversation sometimes\n[01:08:18] with entrepreneurs even at a million\n[01:08:19] dollar a year, $5 million a year. And\n[01:08:20] they're like, I just feel this imposter\n[01:08:21] syndrome with my business and I'll say,\n[01:08:23] \"Are you stating anything that's not\n[01:08:25] true?\" And then they'll kind of look at\n[01:08:27] me and they're like, \"Well, you know, I\n[01:08:28] teach agencies how to, you know, grow\n[01:08:30] their customer base.\" And I'm like,\n[01:08:31] \"Okay, and why do you feel like an\n[01:08:34] imposttor?\" They're like, \"Well, you\n[01:08:35] know, I had an agency and it just really\n[01:08:37] wasn't that successful.\" And I'm like,\n[01:08:38] \"Okay, are your clients successful?\"\n[01:08:40] They're like, \"No, the clients are\n[01:08:41] successful.\" I'm like, \"Okay, so what do\n[01:08:43] you teach them that you were not able to\n[01:08:44] do for yourself?\" And they're like,\n[01:08:45] \"Well, I was actually just really good\n[01:08:46] at the sales side. I was really bad at\n[01:08:47] the delivery side.\" I said, \"If you just\n[01:08:49] say, \"Hey, I had an agency. I was really\n[01:08:52] good at selling customers, really bad at\n[01:08:53] delivering on them, but if you're good\n[01:08:55] at delivering on them and you need a\n[01:08:56] sales process, I can help you.\" I was\n[01:08:57] like, \"Would you feel like you're being\n[01:08:58] an imposttor?\" He's like, \"No.\" I was\n[01:08:59] like, \"And believe it or not, that's\n[01:09:01] actually more compelling because you\n[01:09:03] have a damaging admission, which\n[01:09:04] actually makes you it's one of the\n[01:09:05] components of persuasion, right? Like\n[01:09:06] you just just tell people all the things\n[01:09:08] that are not good because when you tell\n[01:09:10] them the good things, they'll actually\n[01:09:11] believe them more.\" And so I would tell,\n[01:09:13] you know, I was in the gym space for a\n[01:09:14] while and so, you know, a gym owner\n[01:09:16] would have, you know, a bad location and\n[01:09:18] bad parking. And they're like, you know,\n[01:09:20] I I don't I don't it's it's\n[01:09:21] embarrassing. And I say, include it in\n[01:09:23] the ad. Just say, hey, by the way, we\n[01:09:26] have the uh we don't have the newest\n[01:09:27] equipment. Uh our parking is terrible.\n[01:09:29] We have a tiny location, but we have the\n[01:09:31] best workouts on this side of the\n[01:09:32] Mississippi. Right? And if you say that,\n[01:09:34] then it's like people are like, I love\n[01:09:35] that guy, right? Because he told the\n[01:09:36] truth. And so you'll be significantly\n[01:09:38] more persuasive and have less anxiety by\n[01:09:40] just stating the facts and tell the\n[01:09:41] truth. And if the facts aren't\n[01:09:42] compelling enough, do the free work so\n[01:09:44] the facts are compelling.\n[01:09:46] >> Yeah. Oh, I love that so much because\n[01:09:47] I'm thinking of a friend right now who\n[01:09:49] has a service he offers and he's always\n[01:09:51] scared that he's a one-man band and he's\n[01:09:53] scared that companies are going to ask\n[01:09:55] for a service and he's almost\n[01:09:56] embarrassed of saying,\n[01:09:57] >> well, I'm just one guy\n[01:09:59] >> and he wants to present himself as a\n[01:10:01] company.\n[01:10:02] >> And I'm always saying to him, well, no,\n[01:10:03] tell them because you're one guy, you\n[01:10:06] can actually be there. You're present.\n[01:10:07] You're doing all the work yourself.\n[01:10:08] You're committed. you're not just\n[01:10:09] rolling out something that everyone else\n[01:10:11] is doing.\n[01:10:12] >> So, I have I have an awesome frame for\n[01:10:13] this. So, when we had our software\n[01:10:15] company, Allen, which we sold in 21, uh\n[01:10:17] it was a software that helped uh\n[01:10:19] agencies kind of manage schedules. It\n[01:10:21] did automated texting stuff back before\n[01:10:23] all the new stuff now, right? And so, um\n[01:10:25] I actually had agencies that sold to gym\n[01:10:28] owners and I obviously also owned Gym\n[01:10:30] Launch at the time, too, which is which\n[01:10:31] is the category, you know, king in that\n[01:10:32] space, right? It's the biggest company\n[01:10:34] there. And so, they were like, \"How do\n[01:10:35] we how do we compete against you?\" And I\n[01:10:37] said, \"Every position has an advantage.\"\n[01:10:39] And so you are going to say, \"Man, Alex,\n[01:10:43] Alex isn't going to be the one take, you\n[01:10:44] know, he's not the one taking your\n[01:10:45] calls. He's just going to you're going\n[01:10:46] to be client number 77. He's not even\n[01:10:48] going to know your name. You're going to\n[01:10:49] be assigned to some account rep that he\n[01:10:50] pays, you know, nothing to.\" And of\n[01:10:52] course, we paid well, but like I don't\n[01:10:54] know, you know, he just pays way less.\n[01:10:56] Um that he onboarded in two days. Uh and\n[01:10:59] like that's the level of service you're\n[01:11:01] going to get. Whereas with me, you get\n[01:11:03] the highest person. and you get the CEO\n[01:11:05] and you call me, I'll respond\n[01:11:06] immediately. I'm the one working your\n[01:11:07] account. So, don't compare Jim the size\n[01:11:09] of Gym Launch to the size of my company.\n[01:11:11] Compare the person you're actually going\n[01:11:12] to work with. And am I going to be\n[01:11:13] better than his rep number seven? Yes.\n[01:11:16] That's a compelling pitch. Now, if I'm\n[01:11:18] flipping the table, I'm going to say,\n[01:11:19] \"Listen, this guy's in his mom's\n[01:11:20] basement. He hasn't proven any track\n[01:11:22] record. We've been here for 10 years,\n[01:11:24] and the reason we've been here for 10\n[01:11:25] years, and we've gotten so big, is\n[01:11:26] because we're actually good at what we\n[01:11:27] do. And if we weren't good at what we\n[01:11:28] do, we wouldn't be this big, and we\n[01:11:29] wouldn't been doing it for this long.\n[01:11:30] This guy has no process. He might be\n[01:11:32] gone tomorrow.\" We both have advantages\n[01:11:34] that we can cater. So there's no\n[01:11:35] position on the board that doesn't have\n[01:11:36] advantage. You just got to play what you\n[01:11:37] got. Again, rule number one, right?\n[01:11:40] >> Yeah. And and and the idea of pointing\n[01:11:42] it out.\n[01:11:42] >> Yeah.\n[01:11:43] >> Is just so masterful because that's\n[01:11:45] what's blocking us. It takes away we're\n[01:11:47] all trying to be everything to everyone\n[01:11:49] >> and we want to portray that we've\n[01:11:50] thought about every part of the puzzle\n[01:11:52] and we're the one-stop shop. And I feel\n[01:11:55] like whenever anyone says they're the\n[01:11:56] one-stop shop,\n[01:11:58] >> there's nothing there, right? Because\n[01:12:00] it's like, well, wait a minute. There's\n[01:12:01] no way you could have figured out\n[01:12:04] >> this and this and this and this and this\n[01:12:06] >> with just you.\n[01:12:06] >> With just you and you've been in the\n[01:12:08] business for two years, right? Like it's\n[01:12:10] it's just not possible. And so and\n[01:12:13] that's so freeing. Like I'm hoping\n[01:12:14] people hear that and just feel so much\n[01:12:16] lighter and go tell the truth, state the\n[01:12:18] facts, and and that's it. You know,\n[01:12:20] >> if they say no, that's okay. Because\n[01:12:22] honestly, if they say no, then they\n[01:12:24] weren't going to be a fit.\n[01:12:25] >> Yeah. And so I can promise you some of\n[01:12:27] the best deals are the ones you never do\n[01:12:29] because right now any business owner can\n[01:12:31] tell you this like there are customers\n[01:12:32] that you're like I wish we did not ever\n[01:12:34] talk to this person, right? And so like\n[01:12:36] you're just avoiding some of these\n[01:12:37] things that are going to be calamities\n[01:12:38] later. So you might as well just get it\n[01:12:40] up front. And the thing is is that when\n[01:12:41] you set those expectations, it just it\n[01:12:43] creates such a clean relationship from\n[01:12:44] there on. It's like these are the\n[01:12:46] expectations you can set. This is what I\n[01:12:47] will do. Anything outside of that, I'm\n[01:12:49] not going to pretend like I have done\n[01:12:50] it. Now if we want to figure this out,\n[01:12:51] I'll be figuring it out with you. and if\n[01:12:53] you if you like the stuff I have here, I\n[01:12:54] can apply some of those principles, but\n[01:12:56] I haven't done it. I want to be upfront\n[01:12:57] about that. And so, where's the imposter\n[01:12:59] syndrome? Where's the fear? It's like\n[01:13:01] there shouldn't be any. And it's all\n[01:13:02] about the deception piece. And I think\n[01:13:03] that's where that's where people get in\n[01:13:04] trouble.\n[01:13:05] >> Yeah. The other thing I've learned about\n[01:13:06] that is that I feel like people who win\n[01:13:09] watch winners. Yeah.\n[01:13:10] >> And people who fail watch losers.\n[01:13:13] >> And so when I look online or even if I\n[01:13:15] talk to people that I get a lot of this\n[01:13:17] where people be like, I can't believe\n[01:13:19] this guy has like 100,000 followers.\n[01:13:20] Like, have you seen his stuff? it just\n[01:13:22] sucks. Like, oh, I can't believe that\n[01:13:24] this guy like has a business making a\n[01:13:26] million dollars. Like, I mean, he hasn't\n[01:13:28] even got, you know, and so there's a lot\n[01:13:30] of this where you find people who are\n[01:13:31] not winning are constantly whereas like\n[01:13:34] I'm sure if me and you were talking\n[01:13:35] about something like dude, did you see\n[01:13:37] what this guy did? That's amazing. Like,\n[01:13:39] do you see what you know, whatever? And\n[01:13:41] and so I feel like there's that ideology\n[01:13:43] that we get stuck in where we're like, I\n[01:13:45] know I'm better than that guy or\n[01:13:47] whoever, that girl, whatever it is. I\n[01:13:49] know I'm better, but I'm not doing\n[01:13:51] anything about it. And that hurts me\n[01:13:52] even more.\n[01:13:53] >> Can I tell you a story about this?\n[01:13:54] >> Yeah.\n[01:13:55] >> So, I know I think you've had um Kylie\n[01:13:58] Jenner on this.\n[01:13:59] >> Not Kylie. I've had\n[01:14:00] >> You have a Kendall. You've had Kendall.\n[01:14:02] Kendra.\n[01:14:03] >> Well, I'll then I'll tell you the story.\n[01:14:05] So,\n[01:14:05] >> Oh, I know the Kylie story from you.\n[01:14:07] Yeah. Yeah. Right. Right. When she\n[01:14:08] became a billionaire. Yeah. Yeah. I've\n[01:14:09] watched the video, man. I'm in, man. I'm\n[01:14:11] in your content. I'm there. I'm there.\n[01:14:13] >> So, Kylie became a billionaire. I'm\n[01:14:15] 27ish at the time and I'm making I'd say\n[01:14:18] very good money and I thought I was I\n[01:14:22] was, you know, the the man, right? And\n[01:14:24] then here comes this girl who's seven,\n[01:14:27] eight years younger than me and she's\n[01:14:29] crushing, you know, she crushed it and\n[01:14:30] she was better she was better than I\n[01:14:32] was. And I and I, you know, my first\n[01:14:34] response was ego being like, \"Hey, Chris\n[01:14:36] Jenner is her mom. She's had her life\n[01:14:38] set up since day one. She's been on\n[01:14:39] reality TV for, you know, I had all that\n[01:14:41] all that narrative.\" And then underneath\n[01:14:43] of that, I was like, chill. What can I\n[01:14:46] learn from her? Right? And so I have the\n[01:14:48] fundamental belief that if someone makes\n[01:14:49] more money than you, they know something\n[01:14:51] that you don't know. And in that, you\n[01:14:53] can learn of them. And I think that that\n[01:14:55] allows every single person in the world\n[01:14:57] success to serve you.\n[01:14:58] >> Yeah.\n[01:14:59] >> Literally, you just flip the world into\n[01:15:00] like these are all the different lessons\n[01:15:02] I can learn from all these people. And I\n[01:15:03] think um one of my it's the sword of\n[01:15:06] Gryffindor, but I love this quote that\n[01:15:07] was on it.\n[01:15:08] >> I love Harry Potter. Yeah.\n[01:15:09] >> Um, but it was made of, you know, goblin\n[01:15:11] steel or dwarf steel and it was it only\n[01:15:13] took that which made it stronger.\n[01:15:15] >> And so you know in no way makes you\n[01:15:18] stronger and you trying to point out all\n[01:15:20] the deficiencies. It's like you're you\n[01:15:21] are the thing that you are afraid of for\n[01:15:24] yourself. Like you're you're going to\n[01:15:26] point out all this person's deficiencies\n[01:15:27] and your big fear is about the fact that\n[01:15:28] other people want to do that to you. So\n[01:15:30] first start by stop doing it to other\n[01:15:31] people and start trying to find what are\n[01:15:33] the things that they are because the\n[01:15:34] thing is is it is a fact. They are\n[01:15:35] better than you at something. And I\n[01:15:36] think like you have to accept that as\n[01:15:37] much as you're like that guy's got\n[01:15:39] 100,000 followers. Well, and he only had\n[01:15:41] one viral video. It's like, well, he's\n[01:15:42] got one more than you do.\n[01:15:43] >> Yeah.\n[01:15:43] >> What was it about that video now? Let's\n[01:15:45] start tackling that. Um, and so like\n[01:15:47] from Kylie, the thing that I learned was\n[01:15:48] brand. I was like, she's got a big\n[01:15:49] brand. And then I was like, okay, I need\n[01:15:51] to start looking at that. And that's\n[01:15:52] what that's what kicked off this entire\n[01:15:54] journey for me even making all this\n[01:15:55] content stuff was that Forbes cover.\n[01:15:57] >> Yeah.\n[01:15:58] >> That was like that was the thing for me.\n[01:15:59] And so, you know, Kylie, if you ever\n[01:16:01] watch this, like you're a huge influence\n[01:16:02] in my life.\n[01:16:03] >> I love that. We'll get it. We'll get it.\n[01:16:06] I love that. And and what I like about\n[01:16:07] that is that criticism doesn't cure\n[01:16:10] envy.\n[01:16:11] >> Yeah.\n[01:16:11] >> And also success doesn't cure envy. It's\n[01:16:14] only study that kills envy. Like that\n[01:16:16] appreciation, that admiration, that's\n[01:16:18] the only thing. And envy is that thing\n[01:16:20] that when when I coach people and I've\n[01:16:22] been fortunate enough to coach\n[01:16:24] >> musicians and actors and whatever.\n[01:16:26] >> And there's two questions I always ask\n[01:16:27] people is the first thing is who do you\n[01:16:28] envy?\n[01:16:30] >> And there is no person on the planet\n[01:16:32] even in the 0.001% 001% who doesn't envy\n[01:16:35] someone that I've that I've met at least\n[01:16:37] >> and then the second one is who's your\n[01:16:38] god or what is your god whether it's\n[01:16:40] money time energy whatever it is\n[01:16:42] >> and and those two questions sum it up\n[01:16:44] for people and what I found is that\n[01:16:46] success just doesn't take away envy so\n[01:16:48] even if you had become a billionaire in\n[01:16:51] the next 12 months\n[01:16:53] >> that still wouldn't have taken it away\n[01:16:55] because she did it at 21 and you did it\n[01:16:57] younger I can tell you\n[01:16:58] >> yeah exactly and so it's like that\n[01:17:00] that's what's so fascinating about it is\n[01:17:02] that we You become successful by what\n[01:17:04] you get, but you become fulfilled by\n[01:17:06] what you lose. And losing envy and\n[01:17:09] losing comparison and losing criticism\n[01:17:12] leads to happiness. So when people say\n[01:17:14] money doesn't buy happiness, it's not\n[01:17:16] that money is not important. Money makes\n[01:17:17] you successful and it's great. You\n[01:17:18] should get it.\n[01:17:19] >> Happiness was never in the equation with\n[01:17:21] money. That wasn't the point of it. Like\n[01:17:23] I love having awards and accolades, but\n[01:17:25] they were never in the equation of\n[01:17:26] happiness. They were in the equation of\n[01:17:28] success. And the equation of happiness\n[01:17:30] was envy, ego, illusion, lust, anger,\n[01:17:33] all of this stuff. And so it's funny how\n[01:17:35] the equations get like, you know,\n[01:17:37] crossed over.\n[01:17:38] >> Yeah. Oh, I I just I loved everything\n[01:17:40] that you\n[01:17:40] >> No, I just it really resonates hearing\n[01:17:43] about it from your story and also just\n[01:17:44] like breaking it down for people and\n[01:17:46] making it really simple and going like,\n[01:17:47] let's stop demonizing people who are\n[01:17:49] selling well or making money and doing\n[01:17:51] this thing because it it leads to a\n[01:17:53] certain part of the puzzle. But then\n[01:17:55] let's also remember that you wouldn't be\n[01:17:57] who you are today if you hadn't got over\n[01:17:59] that envy right at the beginning.\n[01:18:01] >> So let me toss this in that I think\n[01:18:02] might be helpful.\n[01:18:03] >> So one of the quotes that I don't like\n[01:18:06] is comparison is the thief of joy. And\n[01:18:08] I'll explain why\n[01:18:10] >> because I so I think comparison is\n[01:18:12] incredibly valuable feedback tool. Now\n[01:18:14] what we want to be clear is the\n[01:18:15] differentiation between criticism and\n[01:18:18] insults. And so insults are attack on\n[01:18:20] someone's character saying and I'll give\n[01:18:22] you an example. And a criticism is the\n[01:18:23] difference between uh expected and\n[01:18:25] reality, right? Or desired and actual.\n[01:18:27] So uh I expect you to be on time and you\n[01:18:32] are 5 minutes late. Okay, cool. So I\n[01:18:34] say, \"Hey, you were 5 minutes late. This\n[01:18:36] was the expectation. This is what\n[01:18:37] happened.\" That is criticism, right?\n[01:18:39] Insult. And you're lazy. And so um if we\n[01:18:43] can pull those things apart, we can take\n[01:18:44] the good of because I I think our brains\n[01:18:47] are comparison brains. Like it's how we\n[01:18:49] how we orient ourselves in the world.\n[01:18:50] Where am I? and very tough. Maybe years\n[01:18:53] and years of of of monk study can maybe\n[01:18:54] get you out of it, but I think for the\n[01:18:56] vast majority of people, comparison is\n[01:18:57] is going to be fixed in their brain. And\n[01:18:58] so it's like we want to use that. We\n[01:19:00] want to use that skill of learning to to\n[01:19:02] point out the discrepancy between where\n[01:19:04] they are and where I am so that I can\n[01:19:06] create steps so that I can get better. I\n[01:19:10] want to completely eliminate and erase\n[01:19:12] insults. And also on the flip side, if\n[01:19:15] someone insults me, um this is a a side\n[01:19:17] note, but like if the big fear that many\n[01:19:20] people have on promoting or selling is\n[01:19:21] that someone's gonna say something bad\n[01:19:22] about them\n[01:19:23] >> and so that they're going to get\n[01:19:24] insulted. And the biggest reframe that's\n[01:19:27] been helpful for me is simply\n[01:19:28] translating all hate or insults into he\n[01:19:31] lives his life in a way that I would not\n[01:19:33] prefer.\n[01:19:34] >> And it just comes down to that. I can't\n[01:19:36] believe he's he's married to this\n[01:19:37] person. He makes this kind of why does\n[01:19:38] he think he like he lives his life in a\n[01:19:40] way that I would not prefer? And that is\n[01:19:41] just it has really boiled a lot of the\n[01:19:44] the hatred down to like oh well I mean\n[01:19:46] you live your life in a way that I would\n[01:19:47] not prefer and that's fine. That's why\n[01:19:48] you life my life and hey\n[01:19:49] >> more power to you man. Uh and that has\n[01:19:51] just like really quelled a lot of the\n[01:19:53] concern because I'm sure uh like you I\n[01:19:56] get an unending you know deluge of of\n[01:19:59] hate comments just because if you put\n[01:20:00] yourself out there like if again if you\n[01:20:02] do nothing you will get criticized for\n[01:20:04] doing nothing and if you do something\n[01:20:05] you'll get criticized. So criticism is a\n[01:20:06] fact. It is a fixed cost.\n[01:20:08] >> Yeah. And and yeah and that's why like I\n[01:20:10] I agree with you on the comparison point\n[01:20:11] and that's why I look at\n[01:20:13] >> comparison as two kind of brothers study\n[01:20:16] and envy\n[01:20:17] >> and so that's that's the choice you have\n[01:20:19] like we have to compare comparison is a\n[01:20:21] fixed like you're going to compare\n[01:20:22] because the brain is wired that way and\n[01:20:24] it's either I compare myself with envy\n[01:20:26] or study and those are my two choices\n[01:20:28] I'm going to compare and so this idea of\n[01:20:30] never comparing yourself to anyone\n[01:20:32] >> is actually a lie and a myth in and of\n[01:20:34] itself because if you never compared\n[01:20:36] yourself to anyone you wouldn't have\n[01:20:37] goals you wouldn't aspire for anything.\n[01:20:39] You wouldn't become better.\n[01:20:41] >> There's no feedback because you can't\n[01:20:42] say, well, this is where I was and this\n[01:20:44] is what hap like that is a comparison.\n[01:20:46] And so I would I say that because one of\n[01:20:48] the things we have is feedback is fuel,\n[01:20:49] right? And so it's like I want as much\n[01:20:50] fuel as I can.\n[01:20:51] >> Yeah. Yeah. Exactly. And that's that's\n[01:20:54] such a you know, you've said the word\n[01:20:56] feedback's come up so many times today\n[01:20:57] where you mentioned it so many times and\n[01:20:59] to to see feedback as fuel is the only\n[01:21:02] way to have an iterative constantly\n[01:21:05] evolving process. And I find that, you\n[01:21:08] know, there's the famous quote from\n[01:21:08] Albert Einstein where he said, \"Insanity\n[01:21:11] is doing the same thing over and over\n[01:21:12] again expecting a different result.\"\n[01:21:15] >> And feedback is the way you don't do the\n[01:21:17] same thing over and over again. You can\n[01:21:18] change it every time.\n[01:21:20] >> But so many of us keep doing something\n[01:21:24] even when it doesn't work,\n[01:21:25] >> hoping for that different outcome.\n[01:21:29] >> Why?\n[01:21:31] >> We don't change the email copy. We don't\n[01:21:33] post at a different cadence. We don't up\n[01:21:35] the volume. We It's just like we're\n[01:21:37] just, you know, I've got so many\n[01:21:39] friends. We'll upload a video, delete a\n[01:21:40] video, upload, you know, it's like we\n[01:21:41] don't change that and then we're still\n[01:21:43] going, wait a minute, what's going on\n[01:21:44] here?\n[01:21:45] >> So my worldview on why anyone does\n[01:21:49] anything is that they've been rewarded\n[01:21:50] for doing that in the past.\n[01:21:53] >> And so, you know, one of the one of the\n[01:21:55] really difficult things with language in\n[01:21:56] general is that there's descriptive and\n[01:21:58] explanatory language. And so, for\n[01:21:59] example, I'll give the simplest example.\n[01:22:01] you know, Timmy stole a bike uh because\n[01:22:04] he is dishonest. Okay. Well, if we\n[01:22:06] define dishonest, we would say, well,\n[01:22:07] dishonest people steal things. But\n[01:22:09] that's a circular definition. It doesn't\n[01:22:11] actually help. The explanation of why\n[01:22:13] did he actually steal it is because he's\n[01:22:14] been rewarded for stealing in the past\n[01:22:16] and so he repeated that that action\n[01:22:17] because it got him something good. And\n[01:22:19] same thing goes for lying. Same thing\n[01:22:20] goes for cheating. All of these things\n[01:22:22] like why does someone do it? It's like\n[01:22:23] because they've been rewarded for doing\n[01:22:24] so in the past. They've been reinforced.\n[01:22:26] >> And so why do people Yeah. Why do people\n[01:22:30] uh do anything that is and and you know\n[01:22:33] my worldview is somewhat different than\n[01:22:34] I think many people's because I come\n[01:22:36] from everything from a behaviorist\n[01:22:37] perspective but it has made me\n[01:22:38] significantly better at business because\n[01:22:39] I get better at predicting behavior. And\n[01:22:41] so um I'll give you a simple example. So\n[01:22:43] um you know there was an exec at you\n[01:22:45] know one of the companies uh and I was\n[01:22:47] talking to one of the other owners and\n[01:22:48] they were like hey you know I I this guy\n[01:22:50] said that he would leave if we changed\n[01:22:52] the his title or whatever. And I said,\n[01:22:55] 'Okay, well, how many times have you\n[01:22:57] changed his title uh historically? And\n[01:22:58] he said, 'Ly of times. And I said,\n[01:22:59] 'Okay, has he ever left?' And the answer\n[01:23:01] was no. I said, 'So based on his history\n[01:23:03] of behavior, I would say that he says\n[01:23:05] these things to decrease the likely that\n[01:23:06] you do it because that's his preference,\n[01:23:07] but the likelihood that he quits as a\n[01:23:09] result is low. And so it's like those\n[01:23:10] kind of deconstructions, some people\n[01:23:12] just take things at face value. It's\n[01:23:13] like, well, if we look, if we actually\n[01:23:14] try and find the explanation rather than\n[01:23:15] the description of the event, we can get\n[01:23:17] way better predicting behavior,\n[01:23:18] including our own. And I think that's\n[01:23:20] where like people like I want to get\n[01:23:21] back to the the the trauma of whatever\n[01:23:24] it's like maybe like can I go to this\n[01:23:26] because I think this this might be\n[01:23:28] helpful.\n[01:23:28] >> So um\n[01:23:29] >> I love the direction you go.\n[01:23:31] >> Okay. So many people will will use\n[01:23:35] trauma or some event and they will\n[01:23:37] create a narrative around why why\n[01:23:39] haven't I started? It's because my dad\n[01:23:41] didn't hug me enough as a kid and I\n[01:23:42] don't have this confidence. And so they\n[01:23:44] just create this big story and then\n[01:23:46] they're like, I need to go see a\n[01:23:47] therapist so that I can, you know,\n[01:23:48] untangle all of this. But if I were to\n[01:23:50] say, hey, I'm going to teach you how to\n[01:23:52] how to serve in pickle ball, right? We\n[01:23:55] wouldn't have the first session be, hey,\n[01:23:57] go do a serve. And then you would serve,\n[01:23:59] not ideally if I'm a pickle ball coach,\n[01:24:01] right? And then I'd say, okay, so for\n[01:24:02] the next, you know, few weeks, what\n[01:24:04] we're going to do is we're going to try\n[01:24:05] and go back in the past and we're going\n[01:24:06] to try and figure out why your serve is\n[01:24:08] so bad. And no, we're just going to say,\n[01:24:11] change your wrist like this. this is how\n[01:24:13] you do it. And so it's so much more\n[01:24:15] productive to just focus on what do we\n[01:24:16] need to do instead rather than trying to\n[01:24:18] figure out uh why you did it because the\n[01:24:20] reality is you're never going to know.\n[01:24:22] It's a convenient narrative and it might\n[01:24:23] make sense but at the same time it could\n[01:24:25] just be that you rewarded for doing\n[01:24:26] something like this in the past period.\n[01:24:27] Now there might have been conditions\n[01:24:28] that created that reward and you can\n[01:24:30] lament the person but at the end of the\n[01:24:31] day the only thing you can do about it\n[01:24:32] is change behavior. And so um trauma\n[01:24:35] which is tossed around a lot um I define\n[01:24:38] as uh a permanent change in behavior\n[01:24:40] from an aversive stimulus from a bad\n[01:24:42] thing. So you permanently change how you\n[01:24:43] act because of something bad that\n[01:24:44] happened. Now the question is is trauma\n[01:24:46] bad? Well did the change in behavior\n[01:24:49] result in increase or decrease in\n[01:24:50] likelihood of achieving whatever goal we\n[01:24:51] have. And so if a kid touches a hot\n[01:24:54] stove and they say ouch and then they\n[01:24:55] never touch hot stoves again then that\n[01:24:57] was a traumatic event by that definition\n[01:24:59] and it's probably good trauma because\n[01:25:01] they never touch hot stoves again. So\n[01:25:02] decrease the likeli they die in a fire.\n[01:25:04] Great. And so sometimes it's like well\n[01:25:06] then maybe we can be grateful for some\n[01:25:07] of the quote traumas that we've had\n[01:25:08] because it permanently changed my\n[01:25:09] behavior in a good way. Now if we have\n[01:25:11] quote trauma that that uh permanently\n[01:25:13] changed my behavior in a negative way.\n[01:25:15] So I had you know bombs and saw someone\n[01:25:16] die in front of me and the next time I\n[01:25:17] hear a loud noise I you know I freak out\n[01:25:19] and I can't you know perform my job.\n[01:25:21] Then that would be something that\n[01:25:21] decreases the likelihood. But then at\n[01:25:23] that point rather than trying to figure\n[01:25:25] out the triggering event in the past we\n[01:25:27] just think okay how can we recondition\n[01:25:28] this person under similar conditions so\n[01:25:30] that they can act this way instead. And\n[01:25:32] so trauma what it ends up happening is\n[01:25:34] it becomes an accelerated learning\n[01:25:36] event. And so something bad happens your\n[01:25:37] brain's like pay attention because it's\n[01:25:39] like I'm going to learn and you're I'm\n[01:25:41] going to permanently change our behavior\n[01:25:42] to make sure this doesn't happen again.\n[01:25:44] And so it's not this and I hear this\n[01:25:46] because a lot of people will\n[01:25:47] anthropomorphize uh you know make human\n[01:25:49] or you know try and bi biologize um\n[01:25:53] that's a word go for it\n[01:25:55] um something that occurs it's like it's\n[01:25:57] stored in your body and I was like we're\n[01:25:59] not computers right it's just that you\n[01:26:01] have a behavior set and all we have to\n[01:26:03] do is change these behaviors and then it\n[01:26:04] eliminates and so um the reason so this\n[01:26:07] all started with feedback and so the\n[01:26:09] reason feedback is fuel and what makes\n[01:26:10] feedback good versus bad or rather\n[01:26:12] useful versus non-useful is the latency\n[01:26:14] of the feedback, how quickly do you get\n[01:26:15] it, and how specific is it? And so if\n[01:26:18] you say, \"Hey, that sucked in the\n[01:26:19] moment.\" That not helpful. I will be\n[01:26:22] less, what it will do is make me less\n[01:26:23] likely to do the thing in front of you.\n[01:26:24] Right? If you said that\n[01:26:26] >> on the flip side, if you were to say\n[01:26:28] immediately, hey, real quick, when you\n[01:26:30] do your intro, raise your tone a little\n[01:26:32] bit at the end because I think it'll\n[01:26:33] actually create more curiosity and\n[01:26:34] people want to stay longer. Okay, do the\n[01:26:36] intro again. There, I have a very\n[01:26:37] specific piece of feedback and I did it\n[01:26:39] immediately so that the likelihood that\n[01:26:40] you change behavior is really high and\n[01:26:41] maybe that it sticks. And so the reason\n[01:26:44] feedback is full and ideally if you're\n[01:26:45] trying to change someone else's behavior\n[01:26:46] or even your own, it's like I want to\n[01:26:47] seek out very fast feedback that's as\n[01:26:49] specific as possible to the behaviors.\n[01:26:52] And so um I tell the story a lot because\n[01:26:53] it's a it's a story that we tell inside\n[01:26:55] of our company because it's almost\n[01:26:56] become lore. But we had a a director\n[01:26:59] super proficient, very competent in his\n[01:27:01] role, really high performer. The problem\n[01:27:02] was that everyone said he's such a dick.\n[01:27:04] And the thing is is that I really like I\n[01:27:06] liked his performance and I want to\n[01:27:08] decrease the likelihood that I get\n[01:27:09] complained to about him. And so he had\n[01:27:12] four different people in the company\n[01:27:13] have like one-on- ones with him being\n[01:27:14] like, \"Hey, I need you to stop being a\n[01:27:15] dick.\" And the thing is his behavior\n[01:27:16] didn't change. And so I I was supposed\n[01:27:18] to be like final boss in this situation\n[01:27:20] and be like, \"All right, let's let's\n[01:27:21] let's have the sit down.\" And so I said,\n[01:27:23] \"Hey, I I don't care if you are a dick\n[01:27:26] on the inside. I would like to decrease\n[01:27:27] the likelihood that other people\n[01:27:28] describe you as one.\" And so I want to\n[01:27:30] be clear. I have no judgment. I just\n[01:27:32] want to change this likelihood of this\n[01:27:33] outcome. And so that kind of took the\n[01:27:35] personal attacks out of the\n[01:27:36] conversation. And then it was like,\n[01:27:37] okay, so what are the behaviors you do\n[01:27:39] skill-wise as minutely as possible that\n[01:27:41] get people to say this about you? So it\n[01:27:43] turned out it was you interrupt people\n[01:27:44] on calls, uh you tell people how to do\n[01:27:46] their jobs and and it was two other\n[01:27:48] things, whatever it was. And so I said,\n[01:27:49] \"So next time you have the, you know,\n[01:27:52] desire to tell someone uh what to do\n[01:27:54] about their job, you have two options.\n[01:27:55] Either say nothing or say, hey, I I\n[01:27:58] heard this thing that might help. Do you\n[01:28:00] mind if I share it?\" If you just say\n[01:28:01] that first and if they say no, then just\n[01:28:03] be like, \"Okay, no worries.\" or they say\n[01:28:05] yes, then now you have permission to\n[01:28:07] share it. And when you share it, share\n[01:28:08] it in terms of behaviors, criticism, not\n[01:28:10] insult. And so I just had to change a\n[01:28:12] couple of those things. And then within\n[01:28:13] a week, people were like, \"Oh my god,\n[01:28:15] he's had he's a night and day. He's a\n[01:28:17] different person. They create all these\n[01:28:18] narratives. Maybe it was because his mom\n[01:28:19] did hug him. She called him or because\n[01:28:21] we told him what to do instead.\" And so\n[01:28:23] I I I bring this up because I think many\n[01:28:25] people do not take action around\n[01:28:28] pursuing their dreams because of\n[01:28:29] narratives that they create about their\n[01:28:31] past. But the reality is that none of\n[01:28:33] that matters because all we have to do\n[01:28:35] is just say what do we need to do\n[01:28:36] instead under these conditions. And if\n[01:28:38] we if we take that premise then you need\n[01:28:41] to learn and learning means same\n[01:28:44] condition new behavior. And so if every\n[01:28:46] day is the same for you to your point of\n[01:28:48] insanity then you have the same\n[01:28:50] conditions and if your behavior has not\n[01:28:51] changed then maybe you are insane or at\n[01:28:53] least for at least we're expecting a\n[01:28:55] different outcome.\n[01:28:55] >> Yeah.\n[01:28:56] >> And so that I think makes it significant\n[01:28:58] more palatable of like just change this\n[01:28:59] one thing and then run it again. Yeah.\n[01:29:01] How does someone who's taking that\n[01:29:03] feedback, trying to get better,\n[01:29:05] >> and the results just not changing,\n[01:29:07] >> they're not getting closer to the\n[01:29:08] outcome?\n[01:29:09] >> Yeah.\n[01:29:10] >> Two questions. The first is how do you\n[01:29:13] know when it's time to give up?\n[01:29:15] >> And how do you keep going when things\n[01:29:18] are not working?\n[01:29:20] >> So, this is um there's a like there's a\n[01:29:22] handful of what I call like eternal\n[01:29:24] questions that can I don't think uh\n[01:29:26] they're more dichotoies to be managed\n[01:29:27] than problems to solve. And so how much\n[01:29:30] should I consume today versus invest\n[01:29:32] into tomorrow? How much uh how much risk\n[01:29:34] am I willing to take? Uh which is the\n[01:29:36] classic should I push or should I pivot\n[01:29:38] for an entrepreneur? And the answer that\n[01:29:40] no one's going to like is that it's\n[01:29:41] actually up to you. So there's kind of\n[01:29:43] like good failure and bad failure. So\n[01:29:45] good failure is like I tried something\n[01:29:47] and I I saw that it didn't work and I\n[01:29:50] realize what I need to do instead and\n[01:29:51] I'm going to iterate continuously. Bad\n[01:29:53] failure is where I have a an assumption\n[01:29:57] that the world or the conditions were\n[01:29:59] going to be this way and my assumption\n[01:30:01] was false. And so if I believed that\n[01:30:04] people really wanted to have uh dog Zoom\n[01:30:06] calls or whatever, right? A Zoom a Zoom\n[01:30:08] made for dogs. Let's just take a\n[01:30:09] ridiculous example. Well, then I would\n[01:30:11] have to take a couple of need to like in\n[01:30:13] order for this to be successful, these\n[01:30:14] four things would have to be true. If I\n[01:30:16] find out after starting some iterations\n[01:30:18] that one of my three or four assumptions\n[01:30:20] that underpin this being successful long\n[01:30:21] term is not true, then I should not keep\n[01:30:24] trying to pursue this. And that is where\n[01:30:26] I would say we need to pivot. In a\n[01:30:28] situation where none of the conditions\n[01:30:30] that I or none of the the need to\n[01:30:31] beliefs have changed, all of those\n[01:30:32] conditions are still the same and it's a\n[01:30:34] it's a it's a deficiency in skill. Then\n[01:30:36] that is where I would push.\n[01:30:38] >> Now, how long will it take is going to\n[01:30:39] be completely predicated on how quickly\n[01:30:41] you can learn and the quality of that\n[01:30:43] feedback. And so to your point, I think\n[01:30:45] you said coach, community, and what was\n[01:30:46] the other one?\n[01:30:47] >> Commitment.\n[01:30:47] >> Commitment.\n[01:30:48] >> Some of consistency.\n[01:30:49] >> Yes. And so um the the commitment part\n[01:30:52] um if you want to increase your\n[01:30:53] commitment in anything. So I define\n[01:30:54] commitment by uh the elimination of\n[01:30:55] alternatives, right? So marriage is the\n[01:30:57] ultimate commitment. You eliminate all\n[01:30:58] alternatives, right? And so it's like we\n[01:31:00] want to get married to this opportunity.\n[01:31:01] We get married to this business. We have\n[01:31:02] to eliminate all alternatives. Which\n[01:31:03] means when your friend says, \"Hey, I\n[01:31:04] made 10 grand doing this thing.\" You\n[01:31:05] say, \"That's amazing. I don't know\n[01:31:07] anything about that and I know I know\n[01:31:08] two months of suffering from this one\n[01:31:10] and I'm going to start at zero there, so\n[01:31:11] I'd rather be two months in on this\n[01:31:12] one.\" Um but the but with that push or\n[01:31:16] pivot um we have to just take things to\n[01:31:18] the natural extreme which is how I like\n[01:31:20] to do it which is okay well if I do this\n[01:31:21] for 10 years and I keep getting better\n[01:31:22] do I think it's likely that I'll succeed\n[01:31:23] and the answer is usually yes and so\n[01:31:25] it's like well then I just keep need to\n[01:31:26] keep paying down those iterations and I\n[01:31:27] think Naval said it's not 10,000 hours\n[01:31:29] it's 10,000 iterations and I tend to\n[01:31:31] believe that.\n[01:31:32] >> Your new book's called 100 million\n[01:31:35] dollar money models.\n[01:31:36] >> Yeah.\n[01:31:37] >> It's like you know I think there'll be\n[01:31:39] people listening who like I just want to\n[01:31:40] make 100k a year. There'll be people\n[01:31:43] saying, \"I want to make 100k a month.\"\n[01:31:45] And then there'll be people saying, \"We\n[01:31:46] want to make $100 million business.\"\n[01:31:49] >> What's the difference at each of those\n[01:31:51] levels?\n[01:31:52] >> And what are you sharing here that you\n[01:31:54] haven't shared in the $und00 million\n[01:31:55] series before?\n[01:31:57] >> So, um, I'll take those questions one at\n[01:31:59] a time. So, I'll start with the second\n[01:32:01] question, which is, what's different\n[01:32:02] about this book? So,\n[01:32:03] >> offers answer the question, what do I\n[01:32:05] sell? And so, is an offer so good people\n[01:32:07] feel stupid saying no? So, basically\n[01:32:08] broke down the components of an offer.\n[01:32:09] So we gave a little example of one 5\n[01:32:11] hours for free. It's a very simple\n[01:32:12] offer, right? But there are offers that\n[01:32:14] you can include guarantees, you can\n[01:32:15] include scarcity, you can include\n[01:32:16] urgency, you can include bonuses and\n[01:32:18] then the actual core value itself.\n[01:32:20] There's a way to increase the value of\n[01:32:21] anything. So we use something called the\n[01:32:23] value equation, which is probably the\n[01:32:24] most known framework I have, which is\n[01:32:26] there four people say like create value,\n[01:32:28] but when you say how do I operationalize\n[01:32:29] that? If I say to a 5-year-old create\n[01:32:31] value, they're like I don't know what\n[01:32:32] that means. And so how do we break that\n[01:32:33] down in behaviors? So one is that some\n[01:32:35] dream outcomes are going to be more\n[01:32:37] valuable to somebody than something\n[01:32:38] else. So, if I go to a guy and say,\n[01:32:39] \"Hey, I can make you rich.\" Or some or I\n[01:32:41] say, \"Hey, I can make you good-looking.\"\n[01:32:42] Most men in general will say, \"I'd\n[01:32:44] rather be rich.\" If you go to women, it\n[01:32:46] flips the other way. But for them, that\n[01:32:48] means that the outcome itself is going\n[01:32:50] to be some outcomes are worth more than\n[01:32:51] others. That's one element of value. The\n[01:32:52] second element of value is perceived\n[01:32:54] likelihood of achievement. How risky is\n[01:32:55] it? How likely is it to occur? So, if I\n[01:32:57] said, \"Hey, I can make you rich and it's\n[01:32:58] guaranteed,\" it's going to be\n[01:32:59] significantly more valuable than if it's\n[01:33:01] uh you have to take a huge amount of\n[01:33:02] risk. The third variable is going to be\n[01:33:04] speed. So from the time you make the\n[01:33:06] decision to the time you get what you\n[01:33:07] want. Hey, I can guarantee that you're\n[01:33:09] going to get rich but it's going to take\n[01:33:10] 20 years. Plenty of people make that\n[01:33:12] like but a lot of people are like well\n[01:33:13] but now this 20 years I want to get rich\n[01:33:14] tomorrow. Right? So time is going to be\n[01:33:16] component of it. And then the fourth\n[01:33:17] component is is effort and sacrifice\n[01:33:19] which is two sides of the same coin.\n[01:33:20] Effort is all the things that you must\n[01:33:22] do that you don't want to do as a result\n[01:33:24] of this decision. And on the flip side\n[01:33:25] sacrifice is all the things you have to\n[01:33:26] give up that you would prefer to do but\n[01:33:28] you can no longer do as a result of the\n[01:33:29] decision. And so if we want to make the\n[01:33:31] most valuable offer, then we want to\n[01:33:33] create something that is a huge dream\n[01:33:34] outcome that happens guaranteed, that is\n[01:33:37] immediate, and that they don't have to\n[01:33:39] do anything for. Now, no offer is that\n[01:33:42] good, but those are the hypothetical\n[01:33:43] extremes, the ideals that we strive\n[01:33:45] towards. And I think that's a beautiful\n[01:33:46] thing for entrepreneurs is that all we\n[01:33:47] try to do is just get closer and closer\n[01:33:48] to all four of those pillars.\n[01:33:50] >> So that is the core of the offers book.\n[01:33:52] The lead's book is the core four. So we\n[01:33:53] went over earlier. So how do you promote\n[01:33:55] anything? And so that book takes all\n[01:33:57] eight of the components core four you do\n[01:33:58] and then uh the core that other people\n[01:34:00] do on your behalf and breaks down in\n[01:34:02] nitty-gritty detail step by step how to\n[01:34:03] do them. This book answers the question\n[01:34:06] how do I make money right? And so it's\n[01:34:08] like okay well I know what to sell and I\n[01:34:10] know how to advertise it but how do I\n[01:34:11] turn that process into making money? And\n[01:34:14] so most people uh like the thing that\n[01:34:16] separates when I look back on all the\n[01:34:17] companies that I've owned, advised,\n[01:34:18] sold, um the thing that separated the\n[01:34:20] businesses that were moderately\n[01:34:21] successful from the ones that were\n[01:34:22] exceptionally successful is that they\n[01:34:23] had a better money model. And a money\n[01:34:25] model is the core economic unit of the\n[01:34:27] business. So it's a deliberate sequence\n[01:34:29] of offers that is ideally tailored to do\n[01:34:32] one financial outcome, which is you\n[01:34:34] collect enough cash from one customer in\n[01:34:37] the first 30 days to get and service two\n[01:34:40] more customers.\n[01:34:42] >> And so when you have that amount of cash\n[01:34:44] up front, then it unlocks cash flow for\n[01:34:46] the business to grow as much as it wants\n[01:34:48] or at least until the next constraint of\n[01:34:50] the business. And so when I looked at\n[01:34:52] all the money models that I created is\n[01:34:53] there's basically four four different\n[01:34:55] objectives to make that happen. So one\n[01:34:57] is how do I get more people interested?\n[01:34:59] So that's going to be the nature of the\n[01:35:00] offer. You know buy X get Y free\n[01:35:02] giveaways things like that that like\n[01:35:04] okay I can structure this thing in a way\n[01:35:05] that makes way more people interested\n[01:35:06] than just saying hey buy my thing. The\n[01:35:08] second element is okay how do I get\n[01:35:10] those people to spend more money than\n[01:35:11] they otherwise would. So there's\n[01:35:12] different money models around that. The\n[01:35:14] third is going to be how do I make them\n[01:35:16] spend their money faster? How do I pull\n[01:35:17] that cash flow forward? And then the\n[01:35:19] fourth element of good money is a money\n[01:35:20] model is how do I get them to do it\n[01:35:22] again and again and again which can\n[01:35:23] either be recurring in a membership or\n[01:35:24] reoccurring like Coca-Cola. You still\n[01:35:26] buy it again and again it's just not on\n[01:35:27] subscription. And so if you have all\n[01:35:29] four of those things then you have a\n[01:35:31] business that can create tons and tons\n[01:35:32] of demand get lots and lots of money\n[01:35:34] upfront and get people to buy again and\n[01:35:36] again which then creates stability and\n[01:35:38] cash flow for the business long term.\n[01:35:39] And so that is basically the four\n[01:35:41] pillars of the book and it's broken down\n[01:35:42] in those four steps of these are the\n[01:35:44] these are the front-end offers that do\n[01:35:45] this. These are the the transition\n[01:35:47] points to how do I get someone to take\n[01:35:48] the next thing that's going to be more\n[01:35:49] expensive or how to get to take the\n[01:35:50] bottom thing or how to create pain\n[01:35:51] points, how to create downells, all of\n[01:35:53] those components which ultimately make\n[01:35:55] businesses significantly more\n[01:35:56] successful. And I started writing this\n[01:35:58] in 2019. It was the first book that I\n[01:36:00] started. So it was actually called um\n[01:36:02] lead lead generation to monetization\n[01:36:04] structures which you know very very sexy\n[01:36:06] name. Um but this was uh I had a mentor\n[01:36:09] that told me hey you're in the sale\n[01:36:10] process right now. you should document\n[01:36:11] all the artifacts uh kind of\n[01:36:13] crystallized knowledge at that point and\n[01:36:15] so that is what started that book. Now\n[01:36:18] offers and leads were basically that\n[01:36:20] book was like this thick and I was like\n[01:36:21] this is I can't so I actually peeled off\n[01:36:23] offers and then finished that first and\n[01:36:25] then peeled off leads and finished that\n[01:36:27] second and then finally I can get to the\n[01:36:29] money models which is actually what I\n[01:36:30] started six years ago.\n[01:36:32] >> And so I' I've I have not publicly\n[01:36:34] talked about any of the structures in\n[01:36:36] this book and I feel like I'm giving\n[01:36:38] birth I've been I've been pregnant for\n[01:36:39] six years. uh you know, conceptually\n[01:36:42] pregnant and I want to give birth to\n[01:36:43] this thing because I I think that this\n[01:36:45] will make the largest impact on business\n[01:36:47] owners bottom line of anything that I've\n[01:36:49] ever made. And it's been the source of\n[01:36:51] the vast majority of my material success\n[01:36:53] is being able to do this because when\n[01:36:55] you have a superior money model, it\n[01:36:57] gives you padding to be bad at\n[01:36:58] everything else\n[01:36:59] >> because you finally make more money per\n[01:37:01] customer than anyone else does in your\n[01:37:02] space, which means your advertising\n[01:37:03] doesn't have to be as good. You don't\n[01:37:04] have to be as good at sales. your your\n[01:37:05] your like the offer itself might not\n[01:37:08] necessarily be as good, but when you\n[01:37:09] sequence these things together properly\n[01:37:11] the right way, then you can unlock skill\n[01:37:12] in the business and then with that cash\n[01:37:14] flow buy down that ignorance debt and\n[01:37:16] then get give yourself time to to get\n[01:37:17] good at all the other stuff.\n[01:37:18] >> And what starting point would you say\n[01:37:20] this book's aimed at? Like where is\n[01:37:21] someone at in their journey?\n[01:37:22] >> You can start at zero because you could\n[01:37:23] start. So what's interesting about those\n[01:37:25] four things is that you don't need all\n[01:37:26] four. You just need one.\n[01:37:28] >> And over time because if you were trying\n[01:37:30] to do a business that had all four, you\n[01:37:31] had recurring, you have upfront, like\n[01:37:32] you would be completely inundated. So,\n[01:37:34] we would start with the first thing,\n[01:37:35] which is some sort of attraction offer.\n[01:37:37] How do we get something that's that's\n[01:37:38] more designed to get more customers or\n[01:37:41] more people to engage in your original\n[01:37:42] reachout, your paid ad, your your\n[01:37:44] content, whatever it is. Um, and so I\n[01:37:45] have the five most successful structures\n[01:37:47] that I have used and detailed step by\n[01:37:50] step exactly how to execute them. And\n[01:37:52] what's interesting is that this is the\n[01:37:53] stuff that so the offers book when it\n[01:37:56] came out, there wasn't a single other\n[01:37:57] book about offers, which is interesting.\n[01:37:58] And then it became kind of a household\n[01:38:00] name which is it was this massive gap in\n[01:38:01] the space but as soon as you see it\n[01:38:03] you're like this is everything you know\n[01:38:04] like this is how all of it works. I I\n[01:38:07] think that money models will be that\n[01:38:08] same thing where there's not a single\n[01:38:10] book that ties those concepts together\n[01:38:12] and as soon as it I think it will it\n[01:38:14] will exist in that that huge gap that\n[01:38:17] once you see it you can analyze any\n[01:38:18] business in that same way and\n[01:38:20] specifically your own.\n[01:38:21] >> Yeah I love it Alex. I'm honestly like\n[01:38:24] listening to you today and and I've\n[01:38:25] consumed your content for a long time\n[01:38:27] now. listening to you in person\n[01:38:30] consistently for this long around the\n[01:38:31] models that you've built is is a real\n[01:38:33] treat, man. It's it's it's so well\n[01:38:35] thought through. It's so systematic. I\n[01:38:37] love the way you think, the way you've\n[01:38:38] been able to train yourself to realize\n[01:38:40] that everything's built on behaviors and\n[01:38:42] the ability even something that you said\n[01:38:44] to me that's really going to stay with\n[01:38:46] me because I think about it in such a\n[01:38:48] similar way, but it's so obscure. Like\n[01:38:50] we we have a lot of similarities in our\n[01:38:52] beliefs and but some of them are a bit\n[01:38:53] more\n[01:38:54] >> from different angles, which I which I\n[01:38:55] love.\n[01:38:55] >> Yeah. from different angles, but some of\n[01:38:57] them are a bit more they're from\n[01:38:59] different angles, but some of them are a\n[01:39:00] bit more widespread held. But your one\n[01:39:03] thing you talked about today about how\n[01:39:05] when you watch people say what they\n[01:39:06] regret,\n[01:39:08] >> and I think about that all the time. I'm\n[01:39:10] like, of course you regret you didn't\n[01:39:12] spend enough time with your family,\n[01:39:14] >> but you're totally taking away from all\n[01:39:16] the benefits you just got right now. And\n[01:39:18] I'm not saying people shouldn't spend\n[01:39:19] time with their family. It's just when\n[01:39:21] you said that today, that was one thing\n[01:39:23] that I was like, I can't believe like to\n[01:39:25] have the ability to think it through to\n[01:39:27] that level to not just take something at\n[01:39:29] face value. And I think that's that's\n[01:39:32] the skill I see you have. Thanks.\n[01:39:34] >> Like that's the expert you're at is that\n[01:39:35] you don't take anything at face value. I\n[01:39:37] appreciate\n[01:39:37] >> and and that's hard\n[01:39:39] >> because it requires you to dig deep to\n[01:39:42] figure out, well,\n[01:39:43] >> what is the behavioral science here?\n[01:39:45] What is the what is the exchange here?\n[01:39:47] Like what emotions are we talking about?\n[01:39:49] I picked out some of my favorite Alex\n[01:39:51] Wosi quotes because I had to because\n[01:39:53] there's so many. All right, we've\n[01:39:55] touched on some of this, but it'll be\n[01:39:56] good to get your reaction to them again.\n[01:39:58] All right, so\n[01:39:59] >> this one I love because I think it's so\n[01:40:01] true. Most people want to become\n[01:40:03] millionaires because of what being a\n[01:40:05] millionaire allows you to do, not\n[01:40:07] because of what you have to do to become\n[01:40:09] a millionaire.\n[01:40:11] >> What do we do about that mindset?\n[01:40:14] >> It's uh it's wanting the view without\n[01:40:15] the climb. It's uh Jimmy Carr has a\n[01:40:17] great quote on this. Uh it's uh everyone\n[01:40:19] wants what you have but not what you did\n[01:40:21] to get it.\n[01:40:22] >> I think that if we make who we become\n[01:40:26] the goal\n[01:40:28] rather than the thing that we achieve\n[01:40:30] instead of winning once a decade, we can\n[01:40:32] win every day because you can\n[01:40:33] continually get better at being who you\n[01:40:35] are and then the achievement is just one\n[01:40:37] milestone along along the path. But at\n[01:40:40] least in my experience is as I've\n[01:40:42] actually approached milestones when it\n[01:40:43] becomes increasingly likely that I'm\n[01:40:44] going to achieve it, it matters less and\n[01:40:46] less. When I was in the lifting world,\n[01:40:48] if I if I thought whatever my lift was\n[01:40:49] and added 100 pounds, I would be like,\n[01:40:51] \"Oh my god, man, if I lifted that, that\n[01:40:52] would be insane.\" But by the time you\n[01:40:54] actually do lift that, you also lifted 5\n[01:40:56] lbs less than that before and you lifted\n[01:40:58] 10 pounds less than that before. So,\n[01:40:58] you're like, \"Well, it's really not that\n[01:41:00] big of a stretch anymore.\" And so, it\n[01:41:01] actually in some ways it's it's not even\n[01:41:03] nearly as fulfilling as you think it is.\n[01:41:05] Cuz by the time it happens, you're so\n[01:41:06] close to it, it seems obvious. And so um\n[01:41:10] shifting from who I become rather than\n[01:41:12] what I achieve or who I become as the\n[01:41:14] achievement um has been a wonderful\n[01:41:16] reframe for like sure you want to be a\n[01:41:18] millionaire but what you really want to\n[01:41:19] do is become the person who can become a\n[01:41:21] millionaire and that you can win every\n[01:41:22] day and then that takes away the um I\n[01:41:24] don't want to do the things that\n[01:41:27] >> Yeah. And that comes to one of the\n[01:41:28] things you talk about a lot that I love\n[01:41:30] is sense control. Like that that to me I\n[01:41:32] think one of the earliest clips I saw of\n[01:41:34] yours was someone had asked you\n[01:41:36] something like you know what do you\n[01:41:38] what's a trait you see in successful\n[01:41:40] people and I think you'd said three\n[01:41:42] things and I loved hearing that third\n[01:41:45] one. The first one was I think you said\n[01:41:46] something like\n[01:41:48] >> you know they're all people who who have\n[01:41:50] high standards so they they want they\n[01:41:51] expect a lot from themselves. Yeah. The\n[01:41:53] second was but at the same time they\n[01:41:56] they're good at not being that hard on\n[01:41:58] themselves when they don't get there.\n[01:41:59] >> Emotional control. Yeah.\n[01:42:00] >> Yeah. And then the third thing was like\n[01:42:01] sense control if I'm not wrong.\n[01:42:02] >> Yeah. Yeah. The other one was uh so it's\n[01:42:05] this\n[01:42:05] >> which one did I get wrong?\n[01:42:06] >> No. No. It's like uh you have this uh\n[01:42:08] inflated sense of self so you believe\n[01:42:10] you can achieve great things.\n[01:42:11] >> Yes. That's it.\n[01:42:11] >> You have this crippling insecurity\n[01:42:13] >> that that pushes you away. Yeah. And\n[01:42:15] then the third is that you can control\n[01:42:17] your emotions.\n[01:42:17] >> Yeah. And that that third and and I've\n[01:42:19] always thought it's the high standards,\n[01:42:21] high grace. That's my language around\n[01:42:24] it.\n[01:42:24] >> But the third one of of that\n[01:42:26] selfmastery,\n[01:42:28] >> what do you think is the number one\n[01:42:30] emotion\n[01:42:32] >> that people don't know how to control\n[01:42:35] that leads to failure?\n[01:42:36] >> That is such a good question,\n[01:42:39] fear.\n[01:42:42] Because I think one of the one of the\n[01:42:43] most one of the wildest questions um\n[01:42:46] that I read that you know kind of stuck\n[01:42:48] with me was like\n[01:42:50] what would you do if you weren't afraid?\n[01:42:53] And I think that's just a such a such a\n[01:42:54] a powerful question to ask because every\n[01:42:57] person has the the fear is the thing\n[01:42:59] that gives you the hundred reasons. And\n[01:43:01] what's really interesting about this is\n[01:43:02] that we are our brains are exceptionally\n[01:43:05] good at finding problems which is why\n[01:43:06] I'm a big fan of inverted thinking. So,\n[01:43:08] how can I think about all the ways to\n[01:43:10] kill my business and then do the\n[01:43:11] opposite? You'll your brain is so much\n[01:43:12] better at spotting problems than\n[01:43:13] spotting opportunities. And so, it's\n[01:43:14] like use that problem that problem\n[01:43:16] finding thing and then just flip it. And\n[01:43:18] it sounds like, oh, well, I would just\n[01:43:19] think of the opportunities that way.\n[01:43:20] It's like it doesn't actually work. You\n[01:43:21] actually have to think for the threats\n[01:43:23] and then flip them.\n[01:43:24] >> But\n[01:43:24] >> that's genius. I love that.\n[01:43:25] >> Yeah, that's Charlie Mongers. That's,\n[01:43:27] you know, you know, rest in peace. Um,\n[01:43:29] but from a from a fear perspective, it's\n[01:43:32] I think it's playing it out. It's like\n[01:43:33] what what am I actually most afraid of?\n[01:43:35] And so fear typically only lives in the\n[01:43:38] vague, not in the specific. We tend to\n[01:43:40] catastrophize to death. So if I make\n[01:43:43] this post and people laugh at me, I'll\n[01:43:44] get shunned and then I'll eventually go\n[01:43:45] alone and then die, right? So it's like\n[01:43:47] everything just goes to like death,\n[01:43:48] right? And so playing it out into the\n[01:43:50] specific is like, okay, well, I make\n[01:43:51] this post, some people will like it and\n[01:43:53] some people won't. And maybe I'll get\n[01:43:54] some negative comments. If I get\n[01:43:55] negative comments, I'll get more reach.\n[01:43:56] So maybe that's not a terrible thing.\n[01:43:57] And then and then that night I will have\n[01:43:59] dinner,\n[01:44:01] right? And that night I will go to bed,\n[01:44:03] >> right? And so uh making making it really\n[01:44:05] really specific and then just to add one\n[01:44:07] more thing on that. The other really big\n[01:44:10] downside of being human from an\n[01:44:11] opportunity moneymaking perspective is\n[01:44:13] that we underestimate the upside and we\n[01:44:17] overestimate the downside. And that has\n[01:44:19] been incredibly valuable for us to stay\n[01:44:20] alive\n[01:44:21] >> and not very valuable for us to make\n[01:44:24] money. And so when you if you're in the\n[01:44:26] developed world, the the the absolute\n[01:44:29] worst case scenario is that you still\n[01:44:32] have I say fortress, you still have you\n[01:44:35] still have a cover and you still have\n[01:44:36] food and you still have air and you\n[01:44:37] still have water because in the\n[01:44:38] developed world all those things are\n[01:44:40] available to anyone. And so it's like\n[01:44:41] okay so the worst case scenario is that\n[01:44:43] I live and I'm completely free and no\n[01:44:44] one bothers me. It's like you know that\n[01:44:45] actually sounds not so bad\n[01:44:47] >> when you actually play it all the way\n[01:44:48] out. And so um I think playing it out\n[01:44:50] and actually really thinking what would\n[01:44:52] I then do? Well, I probably reach out to\n[01:44:53] Sarah and she would let me sleep on her\n[01:44:55] couch. Okay. So, and I would I would ask\n[01:44:57] her if you can play. I'd be like, \"Hey,\n[01:44:58] Sarah, if I were to do something and I\n[01:45:00] were to fail, how long would you let me\n[01:45:01] sleep on your couch?\" She's like, \"I'd\n[01:45:02] give you 6 months.\" And you're like,\n[01:45:03] \"Okay.\" So, it al all of a sudden\n[01:45:05] becomes concrete. And I think that that\n[01:45:08] starts to really evaporate fear rather\n[01:45:10] than like, \"Oh, I will die.\"\n[01:45:11] >> Totally. Yeah. I remember that when I\n[01:45:12] when I made the leap. I was like, and\n[01:45:15] and of course I was in a position to be\n[01:45:16] able to say this, but I was like, \"Okay,\n[01:45:17] well, I'll just go back to what I was\n[01:45:19] doing. Like, if this didn't work, I will\n[01:45:21] just go back. like I'll figure out a way\n[01:45:23] >> get the job back\n[01:45:23] >> and I'll get the job back and I and I'll\n[01:45:25] and I'll go back to do it and and that\n[01:45:27] was the reality and of course it was\n[01:45:28] still at the time when I felt this was\n[01:45:30] taking up all of that.\n[01:45:31] >> All right, another one that I love\n[01:45:33] >> this this one really really hit me and\n[01:45:35] and I feel it's going to resonate with a\n[01:45:37] lot of people if you haven't heard it\n[01:45:38] yet. People fail not because there's\n[01:45:41] some magical list nobody has. They fail\n[01:45:44] because it's an obvious list nobody\n[01:45:46] does.\n[01:45:47] >> I'm so happy you like that one. It\n[01:45:49] didn't like I I just just to give kudos\n[01:45:51] to Jay here, you picked out tweets that\n[01:45:54] were not like super banger high\n[01:45:55] performers, but like I wrote these and I\n[01:45:57] was like this is like this is a thing.\n[01:45:58] >> I picked ones that really I didn't pick\n[01:46:00] them based on performance. I picked them\n[01:46:02] based on like I was like I read this I\n[01:46:04] was like yes like\n[01:46:05] >> I like that. So just kudos to you for\n[01:46:08] that because I it makes me feel good. Um\n[01:46:10] but yeah, so I mean this is a super\n[01:46:12] known one but like the magic isn't the\n[01:46:13] work that we're not doing right. It's\n[01:46:15] the obvious list. um if you were trying\n[01:46:17] to get in shape, you know, you should\n[01:46:19] eat less and you should move more. You\n[01:46:20] know that. And so I used to even do\n[01:46:22] these with when I would have a weight\n[01:46:23] loss customer would come in the door and\n[01:46:25] they'd be like, \"So tell me more about\n[01:46:26] the\" and I would just say like, \"Do we\n[01:46:28] really need to get into it?\" Like you\n[01:46:30] already know what you're supposed to do.\n[01:46:31] The question is why you aren't doing it.\n[01:46:32] That's what I'm here for.\n[01:46:34] >> And so in a lot of these situations,\n[01:46:35] like you probably know that if you're\n[01:46:37] going to invest, you should uh you know,\n[01:46:39] wait 10 years. And if you're not willing\n[01:46:40] to wait 10 years, then you shouldn't buy\n[01:46:41] it. Which means that if you're like,\n[01:46:42] \"Well, I don't have the time to do that\n[01:46:43] research.\" Then don't invest. increase\n[01:46:45] your active income, right? Um and so and\n[01:46:48] all these things like, okay, well, how\n[01:46:49] do I increase my active income? Well, I\n[01:46:50] know I need to do more than I currently\n[01:46:51] am. I know I need to put my stuff out\n[01:46:52] there. And so, one of my favorite frames\n[01:46:54] around this is um it's the Solomon\n[01:46:57] paradox, right? And so, for those who\n[01:46:58] don't know in the Bible, Solomon, wise\n[01:47:00] wise man. Um but it's called the Solomon\n[01:47:02] paradox because he gave amazing advice,\n[01:47:04] but his life was in shambles. And so,\n[01:47:07] the thing is is that we're exceptionally\n[01:47:08] good at giving advice and very good and\n[01:47:10] very bad at following it for ourselves.\n[01:47:12] And so what's interesting is that you\n[01:47:13] they actually did studies on this where\n[01:47:15] they had people they they whitewashed\n[01:47:16] someone's existing circumstances and\n[01:47:18] their conditions and had the same people\n[01:47:20] not knowing they were criticizing\n[01:47:22] themselves give critiques to this person\n[01:47:24] what to do to improve their lives. And\n[01:47:25] the thing is is that none of the people\n[01:47:26] were actually doing it. And so the thing\n[01:47:28] is um I like that frame because if you\n[01:47:30] parachute your sorry project yourself in\n[01:47:33] the future and look back and say okay\n[01:47:34] what would 80 years old version of me\n[01:47:36] tell me to do for some reason it kind of\n[01:47:37] like disembodies yourself a little bit\n[01:47:39] and you can get back and say well I\n[01:47:40] would tell myself to do this this and\n[01:47:41] this. And the thing is is that you have\n[01:47:43] complete context on your situation. And\n[01:47:45] so sometimes it's some of the best\n[01:47:47] advice you can get. And I know this is\n[01:47:48] kind of like the inverted thing where\n[01:47:49] you're like oh why why just actually go\n[01:47:51] through the process and say I'm going to\n[01:47:53] write down a conversation with myself\n[01:47:55] that's 80 years old. what would he or\n[01:47:57] she tell me to do? Um, and it probably\n[01:47:59] is that obvious list that no one does,\n[01:48:02] not the magical list that no one knows.\n[01:48:04] Because the thing is is that like the\n[01:48:05] clues of success are in plain sight.\n[01:48:08] >> It's just that the sweat that's require\n[01:48:10] the price tag associated with them is\n[01:48:11] the one that people don't want to pay.\n[01:48:13] >> So people don't really give up on their\n[01:48:14] dreams. They give up they they see what\n[01:48:17] it takes to get their dreams and then\n[01:48:19] decide it's too expensive.\n[01:48:21] >> And I think that's the big thing is is\n[01:48:23] they think it's mispriced. And maybe it\n[01:48:25] is. And I think that's okay. But my my\n[01:48:27] preference would be that many people\n[01:48:28] say, you know what, that's not worth it\n[01:48:30] to me. And then be like, great, you've\n[01:48:32] won. Like, you've won. You don't need to\n[01:48:35] get anywhere. You've already won where\n[01:48:36] you're at. So that's at least my my\n[01:48:38] thought on it.\n[01:48:39] >> Yeah. I love that. How does it how does\n[01:48:41] someone who listens to this episode\n[01:48:45] versus someone who applies this episode\n[01:48:47] live differently today or tomorrow?\n[01:48:50] >> Well, if someone just listens to the\n[01:48:51] episode, tomorrow will be the same for\n[01:48:52] you. Uh, so that's that's an easy one.\n[01:48:55] This was just entertainment for you.\n[01:48:57] Just define in terms of actions what you\n[01:48:59] were going to do. I mean, that is really\n[01:49:01] it. And so like you can prove to\n[01:49:02] yourself that you learned something from\n[01:49:04] this podcast rather than just being\n[01:49:06] entertained by this podcast by simply\n[01:49:08] doing something different, taking an\n[01:49:10] action. And so maybe it is just\n[01:49:12] recording that selfie video and texting\n[01:49:13] it to 100 people. That's it. You could\n[01:49:15] just do that and you would have I mean\n[01:49:17] you would be so much further ahead than\n[01:49:19] than you were yesterday. And what's\n[01:49:20] crazy is that the amount of uh progress\n[01:49:22] that you make in that first 20 hours is\n[01:49:24] greater than any amount of progress that\n[01:49:26] you will likely make over the remainder\n[01:49:27] of your career because going from\n[01:49:29] absolutely terrible to proficient\n[01:49:31] happens so fast. Now, to be clear, all\n[01:49:34] of the gains come from going from\n[01:49:36] proficient to master, which take a huge\n[01:49:37] amount of time, but it's it's one of the\n[01:49:39] most exciting times because you're like,\n[01:49:40] \"Oh my look, I can build an app now.\" Or\n[01:49:42] look, I can build a web page or look, I\n[01:49:43] I can I can show other people how to\n[01:49:44] sell stuff, whatever it is. And I think\n[01:49:46] I would I would just want to get to\n[01:49:47] that, like get to that fast learning\n[01:49:49] curve as fast as you can. And the only\n[01:49:50] way we can do that is starting.\n[01:49:52] >> I love it. All right, here's another\n[01:49:53] one. I don't know if it's a popular one\n[01:49:54] or not, but deleting work life balance\n[01:49:57] for a season nets you more work life\n[01:49:59] balance over a lifetime.\n[01:50:01] >> So, I I love this uh frame shift, which\n[01:50:04] is everyone talks about work life\n[01:50:06] balance, but no one talks about it over\n[01:50:07] what timeline.\n[01:50:09] >> Paul Graham said this from Y Cominator.\n[01:50:10] He said um in order to make a million\n[01:50:12] dollars, you have to endure a million\n[01:50:13] dollars worth of pain. And so you might\n[01:50:16] be able to endure a million dollars\n[01:50:17] worth of pain over 40 years or you can\n[01:50:19] crunch it into four crazy years and then\n[01:50:22] after that you can have whatever you\n[01:50:23] want to have afterwards. And so I I\n[01:50:26] think about life in seasons rather than\n[01:50:28] in you know on on microcosm of days and\n[01:50:30] and even weeks and I think that shifting\n[01:50:33] that perspective will really only solve\n[01:50:35] one core problem for people which is\n[01:50:36] that they feel like they are doing\n[01:50:37] something wrong by making a sacrifice\n[01:50:39] today. And there's always going to and\n[01:50:41] again it's an eternal question. How much\n[01:50:43] do I how much do I risk? Uh how much do\n[01:50:45] I consume versus invest? These are\n[01:50:47] classic human problems that will never\n[01:50:48] have a correct answer. And it's more\n[01:50:50] what's the correct answer for you and\n[01:50:51] your season right now based on the goals\n[01:50:52] you have. And so I think if anything I\n[01:50:55] would want that quote to give some\n[01:50:56] people permission\n[01:50:58] >> to work a weekend every once in a while\n[01:50:59] to to take the five to nine on both\n[01:51:01] sides of the day and say you know what I\n[01:51:03] am going to be unbalanced and that's\n[01:51:05] okay because at least in my observation\n[01:51:07] and probably yours I have yet to see a\n[01:51:09] hyper successful person who doesn't have\n[01:51:11] a wildly unbalanced life or at least for\n[01:51:12] a significant period of time\n[01:51:14] >> and we want to just make sure that we're\n[01:51:16] not looking at someone once they are a\n[01:51:17] billionaire and saying what are they\n[01:51:18] doing now because they might be in a\n[01:51:20] different season now and so don't look\n[01:51:21] at what you know Warren Buffett's doing\n[01:51:23] when he says, \"If I make two good\n[01:51:24] decisions a year, I've had a good year.\"\n[01:51:25] Well, if you make two good decisions a\n[01:51:27] year, you're still probably not you're\n[01:51:29] not going to be Warren Buffett, right?\n[01:51:30] Um, and so I I think about that as my as\n[01:51:33] as a my frame.\n[01:51:34] >> Yeah. Don't read someone's chapter 20\n[01:51:36] when you're writing your chapter one.\n[01:51:37] Like, it doesn't make any sense. And I\n[01:51:39] remember growing up, not growing up, I\n[01:51:41] remember a few years ago when Gary\n[01:51:44] Gary's version that I loved, which was\n[01:51:45] like in his words, and so I'll say, \"Eat\n[01:51:47] [ __ ] for two years and then eat caviar\n[01:51:49] for the rest of your life.\" Yeah.\n[01:51:59] >> I'm going to be really balanced for 10\n[01:52:00] years. And I was thinking about the\n[01:52:01] other day and you said seasons and\n[01:52:02] >> I was saying this the other day when I\n[01:52:04] was on tour. I was talking to Jesse Sler\n[01:52:06] >> and I said this to Jesse. We were\n[01:52:07] talking about something similar and I\n[01:52:08] was just like\n[01:52:09] >> I would never want a day a perfect day\n[01:52:12] is not a day where it rains, snows, sun\n[01:52:16] and fall, right? Like that's not a\n[01:52:17] perfect day. Like you wouldn't say that.\n[01:52:19] You would say, \"I hope it rains today. I\n[01:52:21] hope it snows today. I hope it's sunny.\n[01:52:22] And I hope the leaves shed.\" Like,\n[01:52:24] that's not a perfect day, but that's\n[01:52:26] what you want every day. And nature's\n[01:52:28] already showing you the cycles that\n[01:52:29] work.\n[01:52:30] >> Yeah.\n[01:52:30] >> But we're trying to go against nature by\n[01:52:32] saying, \"I want everything to happen\n[01:52:33] today.\"\n[01:52:34] >> And I want all my days to be over the\n[01:52:36] halfway line.\n[01:52:37] >> Yeah.\n[01:52:37] >> And so I think about this from a law of\n[01:52:39] large numbers perspective, which is\n[01:52:40] let's say you have 365 days in a year.\n[01:52:43] Um, and there's going to be, if you\n[01:52:45] change nothing, the bottom 10% of days,\n[01:52:48] you're going to have 36 days in the year\n[01:52:49] that are bottom 10% days that are,\n[01:52:51] there's nothing wrong with a day. It's\n[01:52:53] just that this happens to be a bottom\n[01:52:54] 10% day. And so, I think a lot of\n[01:52:56] suffering comes from just the normal\n[01:52:58] volatility or variation that exists in\n[01:53:00] life and then somehow ascribing meaning\n[01:53:02] to it and saying, \"Oh, and because this\n[01:53:04] is the bottom 10%, it is bad.\" Rather\n[01:53:06] than it is sunny, it is rainy and I need\n[01:53:09] rain in order to appreciate sun. Yeah.\n[01:53:11] >> Right. And so it's like we can't have\n[01:53:12] just upside. It's the trade-offs. Like I\n[01:53:14] want all the good without the bad. But\n[01:53:16] the bad is what makes the good good.\n[01:53:18] >> Yeah. Yeah. And and the bad is what\n[01:53:20] sometimes what keeps you going. Yeah.\n[01:53:21] >> Cuz if it was just good, maybe you'd\n[01:53:23] stop, maybe you'd give up.\n[01:53:25] >> Last one of these that I wanted to pick\n[01:53:26] out, which I think is going to help a\n[01:53:27] lot of people because I've been doing it\n[01:53:29] a lot. I'm wring my third book right\n[01:53:30] now, and this has changed my life.\n[01:53:32] >> It's amazing how much you can get done\n[01:53:33] if you work for 12 hours without your\n[01:53:35] phone.\n[01:53:37] >> So, I mean,\n[01:53:38] >> so simple yet so profound. So I defined\n[01:53:42] so the here's the the the number one the\n[01:53:44] the highest value productivity hack that\n[01:53:46] I can give anyone. So this is the the\n[01:53:48] hack of productivity\n[01:53:50] do nothing except for the task you set\n[01:53:52] out to achieve.\n[01:53:54] >> That's it. So everything that people do\n[01:53:56] in order to increase productivity that\n[01:53:57] is not working on the task at hand is by\n[01:53:59] very definition making them less\n[01:54:00] productive like period. And so I think\n[01:54:03] people have these very long routines. I\n[01:54:04] think they have these like I got to get\n[01:54:05] in the mood. I got in this mode. It's\n[01:54:06] like what if you could start taking\n[01:54:08] action despite your mood and then get\n[01:54:10] into the mood faster through taking the\n[01:54:12] action. And so all of the things that\n[01:54:14] have made me more productive in life\n[01:54:15] have been through elimination not\n[01:54:16] addition. And so it is eliminating\n[01:54:18] outside stimulus besides the one task\n[01:54:20] that I'm working on. And so if we think\n[01:54:22] the hypothetical ideal or hypothetical\n[01:54:24] extreme of the most focused person in\n[01:54:25] the world is that that person would do\n[01:54:27] literally nothing besides that one thing\n[01:54:28] which means they wouldn't eat, they\n[01:54:29] wouldn't sleep. Now at some point you're\n[01:54:30] like okay well in order for he has to\n[01:54:32] eat and he has to sleep. Okay. So every\n[01:54:34] other hour is just this one thing. And\n[01:54:36] so if we take that as a hypothetical\n[01:54:37] extreme, we want to approximate that or\n[01:54:39] get as close as possible to that extreme\n[01:54:40] as humanly possible. And so for me, it's\n[01:54:42] good night's sleep, knowing what I'm\n[01:54:44] going to start on the day before.\n[01:54:45] Caffeinate earplugs. I I double ear\n[01:54:47] plug. I put the plugs and I put the\n[01:54:48] things on. And I work in a room that has\n[01:54:50] no windows. Now some people are like\n[01:54:51] that's depressing for me, but for me it\n[01:54:53] allows me to lose myself in my work, not\n[01:54:55] get distracted by something that's going\n[01:54:56] on outside.\n[01:54:57] >> Well, I was just about to say I'm glad\n[01:54:58] you brought up environment because\n[01:55:00] everyone has an environment they thrive\n[01:55:01] in. So I'm the same. I need I need\n[01:55:03] instrumental music. I don't can't have\n[01:55:04] music with lyrics when I'm thinking like\n[01:55:05] I just I just can't do it. So I I have\n[01:55:08] some artists that I'm happy to listen to\n[01:55:09] instrumentals of. It also can't be songs\n[01:55:11] that I know. It has to be music that's\n[01:55:12] totally unpredictable and totally random\n[01:55:14] because it helps me with creativity.\n[01:55:16] >> Then I do need windows. I need natural\n[01:55:17] light, but I need to not see anything\n[01:55:20] real happening. So it's like sky tree.\n[01:55:23] It's like it's uh nondescript and\n[01:55:25] there's not like a mall.\n[01:55:26] >> Correct. Yeah. Not people. It can't be\n[01:55:28] people. And I I can't work in noisy\n[01:55:31] coffee shop. Like I can't work in\n[01:55:32] environments like that. And to me, the\n[01:55:34] environment is more important than this\n[01:55:36] whole mood builder thing\n[01:55:38] >> because that's like deep work. Like\n[01:55:41] you're in the cave doing the thing.\n[01:55:42] >> Can I can I tell a wild example?\n[01:55:44] >> Yeah.\n[01:55:44] >> So I believe you if you control the\n[01:55:47] conditions, you can control the outcome,\n[01:55:48] right? If you know all the variables.\n[01:55:49] And so if we want to be productive, we\n[01:55:51] want to control as many of those\n[01:55:52] conditions as possible. And so to type\n[01:55:53] hypothetical extreme, if I were to say,\n[01:55:55] \"Hey, I guarantee um that everybody\n[01:55:57] who's listening to this, if we were all\n[01:55:58] in one room, I could get everyone naked\n[01:56:00] without saying a word.\" People would\n[01:56:01] hear that and be like, \"Oh my god,\n[01:56:02] that's insane.\"\n[01:56:03] >> What I would do is I would lock all the\n[01:56:04] doors and I would turn up the the heat\n[01:56:06] to 200 and then just wait. And\n[01:56:07] eventually everyone would get naked. And\n[01:56:09] the point to that is that we can\n[01:56:11] reconstruct the environment to get the\n[01:56:12] desired outcome if we control as many of\n[01:56:14] those variables as possible. And so you\n[01:56:17] if you don't feel as productive as you\n[01:56:18] want, you get distracted easily, you\n[01:56:19] might not have even given yourself a\n[01:56:21] shot,\n[01:56:22] >> right? And if you're trying to work\n[01:56:23] while having your notifications on,\n[01:56:25] while letting people text you and call\n[01:56:27] you, and you're at, you know, in a in an\n[01:56:29] area where people are coming by and\n[01:56:31] like, is this is this chair free? Is\n[01:56:32] this table free? And you're constantly\n[01:56:34] getting pulled. It's like, you haven't\n[01:56:35] even gotten a chance. And maybe you have\n[01:56:37] a roommate who who walks in and out,\n[01:56:38] maybe they listen to music. I'm like,\n[01:56:39] and the thing is is that many people are\n[01:56:40] in those conditions and they're like,\n[01:56:41] man, I I think I have I think I have a\n[01:56:43] medical condition. I think I need to get\n[01:56:44] medicated. And it's like, dude, you\n[01:56:46] didn't give yourself a shot. Like Jerry\n[01:56:48] Seinfeld talks about how his his writing\n[01:56:50] condition is he has a desk in a room\n[01:56:51] that has nothing else and he's got a pad\n[01:56:53] and he's got a pen\n[01:56:55] >> and he's he doesn't have to write but he\n[01:56:58] can't do anything else.\n[01:56:59] >> And so if we define commitment as the\n[01:57:01] elimination of alternatives then we need\n[01:57:03] to commit to the work. Yeah.\n[01:57:04] >> Right. If focus is anything that is not\n[01:57:06] the work is not the work then that's it.\n[01:57:09] And so I think that we get there through\n[01:57:11] elimination not through addition.\n[01:57:12] >> Yeah. I felt that. I felt that. I think\n[01:57:14] it's going to help a lot of people. And\n[01:57:16] I I you're so right. Like even it's so\n[01:57:18] funny you say that. Up until 6 months\n[01:57:20] ago, I started to think I was like,\n[01:57:22] >> has my brain just been rewired by Tik\n[01:57:24] Tok?\n[01:57:25] >> Like I was like, have I really lost my\n[01:57:27] ability\n[01:57:28] >> for deep work? And I was having this\n[01:57:30] thought probably like six maybe 12\n[01:57:32] months ago\n[01:57:32] >> because I was racking my brain about my\n[01:57:34] new book and it wasn't as clear as it\n[01:57:36] used to be and whatever.\n[01:57:38] >> And I just started to do what I always\n[01:57:40] used to do.\n[01:57:41] >> Yeah. And all of a sudden it's all gone\n[01:57:42] away. And I was like, I'm writing like\n[01:57:44] for eight hours a day, Saturday and\n[01:57:46] Sunday on a new book every week. I love\n[01:57:48] it. I'm in the zone. I'm in the room\n[01:57:49] that I write in. And and I was like, oh,\n[01:57:51] it's it's it's right there. It's just I\n[01:57:53] didn't give myself the opportunity\n[01:57:55] because I was trying to do it with the\n[01:57:57] other\n[01:57:57] >> distress. Trying to squeeze it in. It's\n[01:57:59] like you can't squeeze it in focus. It's\n[01:58:01] a it's a jealous mistress.\n[01:58:02] >> It requires all your attention.\n[01:58:04] >> Yeah.\n[01:58:04] >> Love it. Alex, we end every episode with\n[01:58:06] a final five. These questions get asked\n[01:58:08] to everyone. Um, and so these are your\n[01:58:11] final five. They have to be answered in\n[01:58:12] one word to one sentence maximum.\n[01:58:14] >> Okay.\n[01:58:15] >> So, question number one, Alex, what is\n[01:58:18] the best advice you've ever heard or\n[01:58:20] received?\n[01:58:21] >> Do so much work it would be unreasonable\n[01:58:23] for you not to be successful?\n[01:58:25] >> Second question, what is the worst\n[01:58:27] advice you've ever heard or received?\n[01:58:29] >> Follow your passion.\n[01:58:31] >> Question number three, a piece of advice\n[01:58:34] you wish you received sooner.\n[01:58:37] Find people better than you and do\n[01:58:39] whatever you can to get them to help\n[01:58:41] you, including helping them first\n[01:58:42] without expectation.\n[01:58:44] >> Question number four, a lesson that took\n[01:58:46] you far too many times to learn.\n[01:58:49] >> Focus. One thing all in.\n[01:58:52] >> And fifth and final question. We ask\n[01:58:54] this to every guest who's ever been on\n[01:58:55] the show. If you could create one law\n[01:58:57] that everyone had to follow, what would\n[01:58:59] it be?\n[01:59:00] >> Everyone has to give all their wealth\n[01:59:01] away at the end of their life.\n[01:59:02] >> I love that one.\n[01:59:04] >> But not to your kids, but not No, but it\n[01:59:07] has to Yeah, exactly. It has to be given\n[01:59:08] away\n[01:59:08] >> to kids or every or It doesn't matter.\n[01:59:10] >> Yeah. No, not to your kids like to Yeah.\n[01:59:13] Yeah. You're saying beyond your kids.\n[01:59:14] Yeah. My friend just told me the other\n[01:59:16] day that his dad just took him out the\n[01:59:17] will and his dad's given all his money\n[01:59:20] away to charity and all the kids are not\n[01:59:22] getting anything. He was heartbroken. He\n[01:59:24] was like, \"Oh god, I thought I was going\n[01:59:25] to pay off the mortgage on my house.\"\n[01:59:26] >> It's so funny. So,\n[01:59:27] >> there's a Sanskrit saying around that\n[01:59:29] which is um\n[01:59:31] >> uh if you have a good son, there's no\n[01:59:34] need to accumulate wealth. If you have a\n[01:59:36] bad son, there's no point to accumulate\n[01:59:38] wealth.\n[01:59:39] >> And so at the end of the day,\n[01:59:40] >> that's I mean that's my worldview, which\n[01:59:42] is the reason that I I want the reason\n[01:59:44] that I would want the game to be\n[01:59:45] structured so that everybody has to give\n[01:59:47] all their stuff away at the end is\n[01:59:49] because if you look at second and third\n[01:59:50] order consequences of that, the people\n[01:59:52] who are the best at allocating or sorry\n[01:59:54] aggregating capital, the people are the\n[01:59:55] best at making money uh would be the\n[01:59:56] ones who are also the best at allocating\n[01:59:58] it. And so you'd actually have the the\n[02:00:00] best tools and the people who are best\n[02:00:02] skilled to use them. And so if you know\n[02:00:04] you have to give it away, then at some\n[02:00:05] point near the the later part of your\n[02:00:06] life, you would stop trying to amass um\n[02:00:09] and start trying to you'd focus on\n[02:00:11] giving. And I think most people who do\n[02:00:12] give get addicted to giving because they\n[02:00:15] realize they actually it fills a hole\n[02:00:16] that the wealth never did. Yeah.\n[02:00:18] >> Right. And so what ends up happening\n[02:00:19] though is that from a societal\n[02:00:20] perspective is that if all the best\n[02:00:22] allocators of capital then tried to\n[02:00:23] solve all the world's problems with the\n[02:00:25] capital they had, so many fewer problems\n[02:00:27] would exist that would the whole world\n[02:00:29] would get better. The other downstream\n[02:00:31] effect of that is that it would get rid\n[02:00:32] of a huge amount of kind of the\n[02:00:33] cronyism, the the nepotism, the things\n[02:00:35] where, you know, these these seventh\n[02:00:37] generation massive, you know, wealth uh\n[02:00:40] trust fund, you know, kids were who like\n[02:00:41] it doesn't serve the kids either. You\n[02:00:43] look at those families, they're a mess.\n[02:00:44] >> Um,\n[02:00:46] >> yeah. Yeah. On on on so many reasons.\n[02:00:48] Um,\n[02:00:48] >> and so I'm a big believer in equal\n[02:00:50] opportunity, not equal outcomes. And so\n[02:00:52] if everybody's slate was clean day one\n[02:00:54] because no one got daddy's inheritance,\n[02:00:57] then everyone starts at zero as close as\n[02:00:59] possible. Obviously genetics, you know,\n[02:01:01] can can play play a factor there, but I\n[02:01:03] think that's as as equal of a start as\n[02:01:05] we can get. And then everyone starts at\n[02:01:08] zero and and the ones who super win then\n[02:01:11] turn into super givers.\n[02:01:12] >> And I like that.\n[02:01:14] >> Yeah. And if you don't, one thing I've\n[02:01:15] learned about that as well is if you\n[02:01:17] don't give now, you won't give later.\n[02:01:19] this feeling of like when I get a\n[02:01:21] million dollars I'll give more. It\n[02:01:23] doesn't work that way. It's it's a\n[02:01:25] proportion like it will hurt 10% at a\n[02:01:27] million dollars. It will hurt 10% at\n[02:01:29] 100k. Like it's not that's not going to\n[02:01:31] change. And another phrase that we'd\n[02:01:33] always hear in the monastery was uh God\n[02:01:35] doesn't see how much you give, God sees\n[02:01:36] how much you hold back.\n[02:01:38] >> And so that's why I like your law a lot\n[02:01:40] because it's that feeling of like,\n[02:01:42] >> hey, you know, at the end of it, I I\n[02:01:44] gave it all. Uh, the book is called $100\n[02:01:46] million Money Models, part of the $100\n[02:01:49] million series. Alex, I hope this is the\n[02:01:51] first of many, many conversations we\n[02:01:53] have online and offline. Truly loved our\n[02:01:56] time together. And I'm honestly, I've\n[02:01:58] become a bigger fan spending this time\n[02:01:59] with you and uh this this was a\n[02:02:01] masterass for so many. I'm going to be\n[02:02:02] sending this to a lot of people I know\n[02:02:04] who need to There's there's some\n[02:02:06] podcasts that you do and you're just\n[02:02:07] like, \"Yeah, I'm going to send this\n[02:02:09] personally to people in my life who I\n[02:02:12] think this is going to change for.\" So,\n[02:02:13] thank you so much, man.\n[02:02:14] >> I'm super humbled and very honored. So,\n[02:02:16] thank you so much for having me.\n[02:02:17] >> Thank you, man. If this is the year that\n[02:02:19] you're trying to get creative, you're\n[02:02:21] trying to build more, I need you to\n[02:02:23] listen to this episode with Rick Rubin\n[02:02:25] on how to break into your most creative\n[02:02:27] self, how to use unconventional methods\n[02:02:30] that lead to success, and the secret to\n[02:02:33] genuinely loving what you do. If you're\n[02:02:36] trying to find your passion and your\n[02:02:37] lane, Rick Rubin's episode is the one\n[02:02:40] for you. Just because I like it, that\n[02:02:42] doesn't give it any value. Like as an\n[02:02:44] artist, if you like it, that's all of\n[02:02:46] the value. That's the success comes when\n[02:02:49] you say, \"I like this enough for other\n[02:02:51] people to see\n",
  "source_file": "data/transcripts/youtube/jay-shetty-podcast-2025-08-04-gEF67-G9MO0.txt"
}