{
  "video_id": "qSUqZtipYf0",
  "channel": "Tim Ferriss",
  "channel_slug": "tim-ferriss",
  "title": "Don't Half-Ass Your Dreams — Bill Gurley",
  "date": "2025-12-30",
  "upload_date": "20251230",
  "duration": 572,
  "url": "https://www.youtube.com/watch?v=qSUqZtipYf0",
  "chapters": [],
  "transcript": "[00:00] Let's talk about this is going to be a\n[00:02] segue to talking about running down a\n[00:05] dream and all things involved with that.\n[00:08] Maybe we could start with an anecdote\n[00:11] from a fellow Austin night. Likes to\n[00:13] play the bongos, long hair, associated\n[00:16] with smoke and reaper every once in a\n[00:18] while.\n[00:20] Matthew talking about a short anecdote\n[00:23] about Matthew before we started\n[00:25] recording. Would you mind sharing that?\n[00:27] As I was kind of wrapping up the book, I\n[00:30] started listening to Green Lights and I\n[00:32] was told you had to listen to it because\n[00:34] of course he reads it. So you get all\n[00:35] the great Mccah affections as you read\n[00:38] it. But there's a story in it that just\n[00:41] popped in my brain and kind of\n[00:43] summarized exactly what I'm trying to\n[00:46] accomplish with this book, Running Down\n[00:48] a Dream. And he had spent the vast\n[00:52] majority of his young adult life. So\n[00:55] this anecdotes from when he was like 20,\n[00:58] 21, telling his family he was going to\n[01:00] be a lawyer. And so he'd gotten into the\n[01:03] University of Texas. He was pre-law.\n[01:05] Every time he went home, he talked\n[01:07] about, \"Yeah, I'm going to be a lawyer.\"\n[01:09] And he had met some people at Texas that\n[01:13] had convinced him that he should switch\n[01:16] to film school. And he had immense\n[01:19] anxiety about sharing this with his\n[01:21] father. his father, this is all in the\n[01:24] book, but his father's a very tough\n[01:26] individual. And so, reason to be\n[01:28] fearful, you know, when you're going to\n[01:31] drop some news, no longer going to be a\n[01:33] lawyer. I'm going to go to film school.\n[01:36] And he builds it up a lot in the book.\n[01:38] Like, I didn't know when I was going to\n[01:40] talk to him. Like, you can imagine being\n[01:41] in that situation. You're delaying,\n[01:43] delaying, delaying. But he finally tells\n[01:45] his dad. And his dad utters this very\n[01:48] simple phrase, \"Well, don't halfass it.\"\n[01:51] And he says, you know, of all the\n[01:53] reactions he could have had, don't\n[01:55] halfass it were the last words I\n[01:56] expected to hear and the best words he\n[01:59] could have ever said to me. And he said\n[02:01] in that single moment, he gave him\n[02:02] blessing, consent, approval, validation,\n[02:05] privilege, honor, freedom, and\n[02:07] responsibility. Called it rocket fuel.\n[02:10] And I'd like to believe there are a\n[02:12] number of people out there, young\n[02:15] adults, maybe even some mid midlife\n[02:18] career, who have this notion that they\n[02:22] should be doing something else, but\n[02:23] society has put them on a path or just\n[02:27] the way they metriculated through\n[02:30] college put them into a career that they\n[02:33] just don't love and that they have this\n[02:35] inkling that they could go do this\n[02:37] thing. Or maybe you're a young kid and\n[02:39] you really want to do X, but everybody\n[02:42] else is telling you to do A, B, and C.\n[02:44] Like, I want to help them have the\n[02:47] confidence and permission to go do X, to\n[02:50] go chase this dream.\n[02:52] >> And as you hinted at from our last call,\n[02:56] I think the amount of your ability to\n[02:59] make connections and to gather\n[03:01] information and learn on your own pace\n[03:05] has never been better. You can literally\n[03:08] just sit there and talk to Chad GPT six\n[03:12] hours a day if you so choose and learn\n[03:15] so much about any particular field. And\n[03:19] so like your ability to take things into\n[03:23] your own hands and to go try and be\n[03:26] successful in this thing that you feel\n[03:28] passionate about I think has never been\n[03:30] better. Why do you think when you\n[03:33] initially gave and subsequently had to\n[03:36] go online run down a dream as a\n[03:39] presentation, why do you think that took\n[03:42] why did it strike a chord in the way\n[03:44] that it did? What do you think it was? I\n[03:46] think we've built a society like\n[03:49] nobody's fault like we just have built a\n[03:51] society where we love to celebrate\n[03:54] people that are successful in a lot of\n[03:57] different fields but when it comes to\n[03:59] our own children we tend to think way\n[04:04] more pragmatically about what they\n[04:06] should be doing. you know, lawyers,\n[04:09] consultants,\n[04:11] doctors, computer scientists, like it's\n[04:13] all these jobs that have certainty to\n[04:16] the financial component. And I think\n[04:19] that's like so well intended. Like I\n[04:22] don't think there's mal intent of anyone\n[04:25] in the system. And I'm a parent of\n[04:27] three. Like I've been through this. You\n[04:28] just feel this obligation to try and\n[04:31] push them towards prosperity. But it's\n[04:34] not intellectual prosperity. It's not\n[04:37] happiness. It's it's financial\n[04:39] stability.\n[04:40] >> Yes. That most people are guiding\n[04:42] children towards. This isn't that\n[04:44] complicated a math, but most people end\n[04:46] up working 80,000 hours in their life.\n[04:49] It's a third of your life. Why do\n[04:52] something you don't like? There's Gallup\n[04:54] poll data on career engagement and 59%\n[04:58] of people say they're not engaged at\n[05:00] work. And this is that whole quiet\n[05:02] quitting thing that we hear so much\n[05:04] about. And some of these numbers are at\n[05:06] an all-time low. It just seems horrific\n[05:08] that people are kind of sauntering\n[05:11] through life.\n[05:12] >> What are some of the keys to\n[05:15] taking the path less traveled than in\n[05:18] this case, right? There are few I\n[05:20] highlighted for myself, but where should\n[05:22] we start? I highlighted one for myself.\n[05:24] We don't have to start here, but go\n[05:26] where the action is. I just think this\n[05:27] is so underrated\n[05:31] and people it further undervalue it\n[05:33] maybe in a digital world but we can\n[05:36] start anywhere you want. That's just one\n[05:38] that really jumped out to me because I\n[05:40] think it's really underrated. But where\n[05:43] would you like to start\n[05:44] >> in the book? One of the things that we\n[05:45] tie together very early on is the\n[05:49] interplay between\n[05:51] passion or fascination or curiosity and\n[05:54] learning. And the way to be most\n[05:57] successful in any endeavor, but\n[05:59] certainly if you're going to go tilt it,\n[06:02] something that's less pragmatic\n[06:05] >> is to be the smartest, most\n[06:07] knowledgeable person you can possibly\n[06:08] be. And knowledge is free now, as we've\n[06:11] talked about. And I have this test for\n[06:14] whether or not you're actually\n[06:17] truly passionate about what you're\n[06:19] trying to do, which is do you self-learn\n[06:22] on your own time? like would you not\n[06:25] watch Breaking Bad and read about this\n[06:28] field and be energized by that activity?\n[06:32] >> Mhm.\n[06:33] >> If you are and you know we have 20 30\n[06:37] different stories in the book of people\n[06:39] that have been successful almost all of\n[06:40] them check that box.\n[06:42] >> You just have this amazing ability to\n[06:46] gain knowledge so much faster than\n[06:48] everyone else you would be competing\n[06:50] with.\n[06:50] >> Mh.\n[06:51] >> And that's going to be useful. that's\n[06:53] unquestionably gonna be useful.\n[06:54] >> It makes me think of an interview I saw\n[06:56] a long time ago actually. It was quite a\n[06:58] few years ago, but it was an interview\n[07:00] with Joe Rogan and he said something\n[07:03] that surprised me. It might surprise a\n[07:05] lot of people, which was along the lines\n[07:08] of he's not good at it was either\n[07:11] willpower or discipline, which is he's\n[07:13] in great shape. Obviously, he's black\n[07:15] belt in jiu-jitsu. He's done what he's\n[07:17] done with the podcast. He's the\n[07:19] undisputed king of podcasting, etc.,\n[07:22] etc. And he said, \"I'm not actually good\n[07:24] at whether it was discipline or\n[07:26] willpower, but I am good at obsession.\n[07:28] It's all on or all off.\" And I've seen\n[07:32] that. I'm sure you've seen this in a lot\n[07:35] of the entrepreneurs who actually make\n[07:36] it to the other side and create these\n[07:38] mega successes. They are just obsessed.\n[07:42] And that gives them a huge not just\n[07:45] knowledge advantage, but endurance\n[07:46] advantage. You just go down the check\n[07:50] boxes. It's all advantages.\n[07:51] >> I had the opportunity to talk to Angela\n[07:53] Duckworth when I was working on this and\n[07:56] her book Grit talks about two\n[07:58] components, passion and perseverance.\n[08:00] And I heard a podcast she had done\n[08:02] recently where she said if she could go\n[08:04] back,\n[08:05] >> she would put far more weight on the\n[08:06] passion than the perseverance because\n[08:09] she says we've taught our children to\n[08:11] grind. Mhm.\n[08:12] >> And so once again, starting in sixth\n[08:14] grade, they're told to learn the flute\n[08:16] and take lacrosse and do all this stuff\n[08:19] and crush the SATs and take the extra\n[08:23] credit classes and all this and they all\n[08:25] do it and then they go to college and\n[08:27] how you doing? They take six hours of\n[08:28] class instead of four and they're just\n[08:30] going. But eventually, she says, if you\n[08:33] don't have that passion, you just burn\n[08:36] out. And so you're right about the\n[08:37] energy part. I think it's both knowledge\n[08:39] and you've put in more cycles.\n[08:42] >> Yeah. It makes me think of maybe this is\n[08:45] cliched in Silicon Valley because it\n[08:47] gets so oft repeated, but a lot of folks\n[08:49] listening will not have heard it, which\n[08:51] is if you're looking for the next sort\n[08:53] of technological breakthrough or\n[08:55] something on the edge, look for what the\n[08:57] nerds are doing on the weekends, right?\n[08:59] It's not just a great way to find what\n[09:02] might be coming around the corner in a\n[09:04] few years. It's a great way to find the\n[09:06] people to bet on who are already using\n[09:08] their excess their free time to work on\n[09:11] these things. I think of Pettis and 3D\n[09:14] printing. I mean, I can just go down the\n[09:15] list.\n[09:15] >> And by the way, that's another advantage\n[09:17] of going to the epicenter is there's\n[09:19] more people doing that all the time.",
  "transcript_source": "youtube_captions",
  "has_timestamps": true
}